var dictionary = {
  ////////////////////////////////////////////////////////////        ก           150      คำแรก     ///////////////////////////////////////////////// 
    "กกช้าง": "หญ้าสะลาบ", "ก๊ก": "หมู่", "กกุธภัณฑ์": "เครื่องสูง", "กง": "กง", "ก้งโค้ง": "โก่งโคะ",
"กงพัด": "คานเรือน", "กงสุล": "กงซุล", "กฎหมาย": "กดหมาย", "กด": "เต๊ก", "กตัญญู": "กตัญญู",
"โค่น": "ก่น", "ก่นสร้าง": "สร้าง,บุกเบิก", "ก้นกบ": "ก้นกบ,ก้นย้อย", "ก้นงอน": "ก้นกึ่ง", "ก้นง้อน": "ก้นแง้น",
"ก้นลีบ": "ก้นแต็บ", "ก้นบีด": "พังพอน", "ก้นรั่ว": "ก้นรั้ว,ก้นโล้ง", "ก้นหนัก": "ก้นตั๋ง,ก้นหนัก", "ก้นกระแทก": "ก้นยอกพอด",
"กบดาน": "กบพอด", "กบไสไม้": "เต่า,กบ,กบโท,เต่าโทไม้", "กบทู": "แปจอง", "กรง": "ขง", "กรด": "น้ำกรด",
"กรน": "ขน", "กรรไกร": "มีดยับ", "กรรมสิทธิ": "ตกเป็น", "กรวด": "แฮ่,ซายหยะ,แร่หิน", "กรวดน้ำ": "หยาดน้ำ",
"กร้วม": "ควบ", "กรวย": "สวย", "กรวยบ้าน": "ผีเสื้อน้อย", "กรวยป่า": "ผีเสื้ื้อหลวง", "กรอ": "พือ",
"กรอก": "ถอก", "กร๊อยกร๋อย": "หย๊อกหยอย", "กรอกแกรก": "ก็อกแก็ก", "กรองคา": "ไพคา", "กร่อน": "ค่อม",
"กรอบ": "ขอบ", "กร่อย": "จาง", "กร่อย": "บ่ม่วน", "กระ": "ขะ", "กระเง้ากระงอด": "ป้องง้อง",
"กระจก": "แก้ว", "กระจกเงา": "แว่น", "กระจง": "ไก้", "กระจอกงอกง่อย": "ทุกข์ยาก", "กระจองอแง": "เดือดซ้าว",
"กระจ้อน": "จ่อน", "กระจัดกระจาย": "ฟุ้งฟี่ฟุ้งฟาย", "กระจับ": "มะจับ", "กระจ่า": "พาก", "กระจ่าง": "เผี้ยน",
"กระจุกผม": "จุกผม,จ็อกผม", "กระจุบ": "จุบ", "กระจู้": "อี่จู้", "กระเจี้ยบ": "ต้นเสงเครง", "กระเจี้ียว": "ดอกอาว",
"กระแจะ": "ต้นพระยายา", "กระโจน": "โจน,โสน", "กระโจมไฟ": "ท่อไฟ,เรือนไฟ", "กระโจมอก": "รั้งอก", "กระฉอก": "สั่น,ฟะ",
"กระโฉม": "อ้มกบ", "กระเฉด": "ผักหนอง", "กระชอน": "ซอน", "กระชัง": "เหิง", "กระชั้น": "จ้วนจั้น",
"กระชับ": "แหน้น", "กระชาก": "สะทก", "กระชาย": "กะซาย", "กระชุ": "ตะลุ่มฝ้าย", "กระชุมกระชวย": "เก๋ง",
"กระเชา": "ขะเชา", "กระเช้า": "กระเช้า", "กระเช้าสีดา": "ตองห่อข้าวย่าบา", "กระซิบ": "สาบ,ซุบซาบ", "กระเซน": "สะเด็น",
"กระดก": "ดก", "กระด้ง": "ด้ง", "กระดอ": "ควย(คำหยาบ)", "กระดอง": "อ้อง", "กระดอน": "สะท้อน",
"กระดอม": "มะนอยชา", "กระดังงา": "สะบานงา", "กระด้งงาแดง": "เขืองแค่งม้า", "กระดั่งงา": "สะบันงาเครือ", "กระดาก": "อาย,เดียม",
"กระดาน": "ขะดาน", "กระดาษ": "พึมพื้อ", "กระดิก": "ท้วง", "กระดิ่ง": "มะดิ่ง", "กระดึง": "มะเด็ง",
"กระดุกกระดิก": "ดุกดิก", "กระดุม": "มะต่อม", "กระดูก": "ดูก", "กระเด็น": "สะเด็น", "กระเด้า": "เด้า",
"กระเดาะ": "เดาะ", "กระเดาะปาก": "ดะปาก", "กระเดียด": "ค่างแอว", "กระเดียม": "เดียม", "กระเดือก": "ลููกก้องคอ",
"กระเดื่อง": "มอง", "กระแดก": "เขย็ก", "กระแด่ว": "แด่ว ๆ", "กระโดกกระเด็ก": "ดกเด็ก", "กระโดงคาง": "ตงคาง",
"กระโดด": "โดด", "กระโดน": "ผาหาด", "กระได": "คันใด", "กระไดลิง": "คันใด", "กระต่องกระแต่ง": "ต่องแต่ง",
"กระต๊อบ": "ตูบ", "กระต่าย": "กะต่าย", "กระติบ": "แอ็บข้าว", "กระตือรือร้น": "ฟั่ง", "กระตุก": "หน๊อก,ตุก",
"กระตุกกระติก": "ตุกติก", "กระตุ้งกระติ้ง": "เยียะสลิด", "กระแตไต่ไม้": "กูดไม้,กูดขาฮอก", "กระโตกกระตาก": "โกกกาก", "กระถด": "ขด",
"กระถินเทศ": "ดอกคำใต้", "กระถินบ้าน": "กะถิน", "กระถินพิมาน": "ต้นพิมาน", "กระเถิบ": "ขด,ถ็อดแถ็ด", "กระโถน": "กะโถน",
"กระทก": "สะทก", "กระทกข้าว": "ฝัดข้าว", "กระทง": "อ้อง", "กระทงลาย": "มะแตกเครือ", "กระทบ": "ตำ",
"กระทบกระทั่ง": "ทิ่มตำ", "กระทบกระเทียบ": "หย้อ", "กระทบกระเทือง": "สนั่น", "กระทบกระเทือน": "สนั่น", "กระทบกระแทก": "แดกดัน",
"กระทอก": "แดกขึ้นแดกลง", "กระท่อนกระแท่น": "เป๋นติ่นเป๋นต่อน", "กระท่อม": "ตูบ", "กระทะ": "หม้อขาง", "กระทายหิน": "ตายเหินขาว",
"กระทำ": "เยียะ", "กระทิง": "กะทิง", "กระทึง": "สารภีแนน", "กระทืบ": "ทืบ", "กระทืบยอบ": "หญ้าจิยอบ",
"กระทุงหมาบ้า": "ผักง้วนหมู"
,"กระทุ้ง": "ทั่ง", "กระทุ้งข้าว": "จ่อมข้าว", "กระทุ่ม": "หญ้าหมาน้อย", "กระทุ่มน้ำ": "ทุ่มเต็น", "กระทุ่มบก": "ตองเหลือง",
"กระทู้": "กะทู้", "กระเทียม": "หอมเตียม", "กระเทือน": "สนั่น", "กระแทก": "ทั่ง", "กระโน้น": "ก่อนเนิ้น",
"กระบก": "บ่ะมื่น", "กระบวน": "ขะบวน", "กระบาย": "น้ำบวย", "กระบอก": "บอก", "กระบอง": "ไม้ค้อน",
"กระบองเพชร": "เขียะลิ้นหมา", "กระบาก": "คางคาก", "กระบุง": "เพียด", "กระเบน": "หางผ้าต้อย", "กระเบ็นเหน็บ": "เหน็บเตี่ยว",
"กระเบา": "บ่ะเปา", "กระเบื้องถ้วย": "เฟื้องถ้วย", "กระเบื้องไทย": "ดินขอ", "กระเบื้องเคลือบ": "กะเบื้องน้ำคาบ", "กระปรี้กระเปร่า": "เก๋ง",
"กระป๋อง": "กะหล็อก", "กระปั้วกระเปี้ย": "ปั้วเปี้ย", "กระปุกหลุบ": "ปุกหลุก", "กระปุกหลุก": "ปุกหลุก", "กระปุ่มกระป่ำ": "ป็อกแป็ก",
"กระโปก": "ขะหลำ", "กระผม": "ข้าเจ้า", "กระพังโหม": "หญ้าตดหมา", "กระพี้": "พี้", "กระพี้นางนวล": "พี้จัน",
"กระพี้เขาควาย": "คำแนบ", "กระพือ": "พือ", "กระพุ้งแก้ม": "พุงแก้ม", "กระพุ่ม": "ผะหนม", "กระเพาะ": "ปูม",
"กระเพื่อม": "ดิ้น", "กระมัง": "ก๊า", "กระมิดกระเมี้ยน": "มุดมิด", "กระย่องกระแย่ง": "ย่องแย่ง", "กระรอก": "ฮอก",
"กระไร": "จะใด", "กระลำพัก": "ขอนดอก", "กระลำเพาะ": "บ่ะล็อบแล็บ", "กระวาน": "เหร้วป่า", "กระวี": "กาวี",
"กระษัย": "บ่ะโหก", "กระสาปน์": "กหาปณะ", "กระสวย": "สวย", "กระสัง": "ผักรากกล้วย", "กระสับกระส่าย": "ใจบ่ดี",
"กระสา": "สา", "กระสาย": "น้ำแตว", "กระสือ": "สือ", "กระสุน": "กง", "กระเส่า": "เส่า",
"กระเสาะกระแสะ": "เสาะแสะ", "กระเสือกกระสน": "กลิ้งเกลือก", "กระแส": "ขะแส", "กระหน่ำ": "ซ่ำ", "กระหม่อม": "ขะหม่อม",
"กระหยิ่ม": "ยุ้มใจ", "กระหัง": "พง", "กระหาย": "อยาก", "กระหืดกระหอบ": "บ่ะเฮ่เจ๋กั๋ง", "กระเหม็ดกระแหม่": "ฮิฮอม",
"กระแอม": "อะแฮม", "กรัก": "ขัก", "กรักขี": "สักขี", "กรัง": "หนะ", "กรับ": "เหิบ",
"กราก": "งอม", "กร่าง": "ไม้ลุง", "กราด": "ยู", "กราน": "คาน", "กร้าน": "ค้าน",
"กราบ": "ขาบ", "กราม": "เขี้ยวเค้า", "กราย": "กาย", "กร้าว": "ห้าว", "กรำ": "ตาก",
"กริ่ง": "อิกขลิก", "กริบ": "ขิบ", "กริ้ว": "ขิ่ว", "กรีด": "ขีด", "กรุ": "ถุ",
"กรุง": "โขง", "กรุงเขมา": "พังชะเมา", "กรุณา": "ขุณณา", "กรุ่น": "ฟุ้ง", "กรุย": "ทุย",
"กรู": "สด", "กลเม็ด": "เชิง", "กลบ": "ปก", "กลม": "มน", "กล้วยกรัน": "กล้วยแก่น",
"กล้วยแขก": "กล้วยทอด", "กล้วยเขา": "กล้วยผา", "กล้วยครั่ง": "กล้วยน้ำครั่ง", "กล้วยตานี": "กล้วยป่า", "กล้วยนาค": "กล้วยน้ำ",
"กล้วยนางนวล": "กล้วยน้ำ", "กล้วยน้ำละว้า": "กล้วยใต้", "กล้วยไม้": "ดอกเอื้อง", "กล้วยร้อยหวี": "กล้วยนวล", "กล้วยฤษี": "จันทร์ป่า",
"กล้วยสั้น": "กล้วยตีบกุ", "กล้วยหอม": "กล้วยค้าว", "กล้วยหอมค่อม": "กล้วยพ่ำ", "กล้วยหอมจันทร์": "กล้วยนิ้วมือนาง", "กล้วยหักมุม": "กล้วยส้มหม่น",
"กล้วยน้ำนม": "กล้วยน้ำ", "กลองแขก": "กลองสะบัดชัย", "กลองชนะ": "กลองสะบัดชัย", "กลองยาว": "กลองแอว", "กลองเถิดเทิง": "กลองแอว",
"กลองโยน": "กลองบูชา", "กล่อง": "กับ", "กล้องแกล้ง": "อ้องแอ้ง", "กลอน": "กลอง", "กลัก": "กับ",
"กลัด": "กะหลัด", "กลัดหนอง": "ขงหนอง", "กลับ": "ปิก", "กลับกรอก": "สับปะหลี้", "กลั้วคอ": "ล้องคอ",
"กลาก": "ขาก", "กลางเก่ากลางใหม่": "หมัง", "กลางคน": "หัดสะเทิม", "กลางคืน": "เมื่อคืน", "กลางวัน": "เมื่อวัน",
"กล้ามมะพร้าว": "เกิ้มบ่ะพร้าว", "กล้ามเนื้อ": "กล้าม", "กล้าย": "กล้วยกล้าย", "กล่าวถึง": "จ่าเถิง", "กล้ำกราย": "ซวาด",
"กลึง": "เคี่ยน", "กลืน": "ลืน", "กลุ้มใจ": "หยุ้งใจ", "กวด": "ไล่เหิบ", "กวดขัน": "เคร่ง",
"กวน": "คุย", "ก๊วยเตี๋ยวฮ่อ": "ข้าวซอย", "กว้าง": "กว้าง", "กวาดตา": "สอดตา", "กว้าน": "ฮุ",
"กวี": "กาวี",
"ก้อร้อก้อติก": "ตุกติก", "ก็องก็อย": "ผีตองเหลือง", "กอบ": "โกบ", "กอบเกื้อ": "ก่อเกื้อ", "กะจิก": "ค้องก้อง",
"กะชะ": "ซ้า", "กะซับ": "เกียงนา", "กะชิง": "สารพีแหน", "กะตังกะติ้ว": "บ่ะตัง", "กะตังใบ": "ตองแต้ม",
"กะต้าก": "กะแต้ก", "กะทกข้าว": "ฝัดข้าว", "กะทกรก": "น้ำใจใคร่", "กะทอ": "ทอ", "กะทันหัน": "จ้วนจั้น",
"กะทือ": "บ่ะปอกกะแดก", "กะทุ่มโคก": "พุ่มเขา", "กะเทย": "พู้เมีย", "กะเทาะ": "สะเดาะ", "กะแท้": "แมงแคง",
"กะแทง": "ดอกก้าน", "กะเบ็งตัวผู้": "ห้อมเกี่ยวคำ", "กะเบียด": "งุ้น", "กะปริดกะปรอย": "ปิดๆปอยๆ", "กะพริบตา": "พับตา",
"กะพล่องกะแพล่ง": "ปุ้นๆเพ้ๆ", "กะเพรา": "กะเพา", "กะเมง": "ห้อมเกี่ยว", "กะรุ่งกะริ่ง": "โหวกหวาก", "กะเร่อกะร่า": "เล่อล่า",
"กะละแม": "ข้าวหนมปาด", "กะลา": "กะโหล้ง", "กะเหรี่ยง": "ยาง", "กะโหลก": "กะหลก", "กะไหล่": "เคลือบ",
"กัก": "เกิ้ด", "กั๊ก": "ไขว่ควง", "กักขฬะ": "หยาบช้า", "กังหันน้ำ": "หลุก", "กัณรัศ": "ม้ากัณฐัก",
"กัด": "ขบ", "กัดสบัด": "คาบสะวัด", "กัน": "กัน", "กันท่า": "เกิ้ดเกิ้ง", "กันเอง": "อันเดียวกัน",
"กั้น": "เกิ้ง", "กันเกรา": "มันปลา", "กันดาร": "ยาก", "กั้นหยั่น": "หอกทั่ง", "กับแก้": "กับแก้",
"กับข้าว": "ของกิ๋น", "กัปปิย์จังหัน": "ข้าวปลาอาหาร", "กับแกล้ม": "ของกับ", "กัลปพฤกษ์": "กัลป์นั้นเอง", "กากะบาท": "ตีนกา",
"กากะทิง": "บ่ะนาวกาน", "กาจับหลัก": "บ่ะเขือบ้าดอกคำ", "กางเกง": "เตี่ยว", "กางเกงชั้นใน": "เตี่ยวใน", "กางเกงขาสั้น": "เตี่ยวสั้น",
"กาเรการ่อน": "เอื้องปากเป็ด", "กางเกงขายาว": "เตี่ยวยาว", "กางเกงลิง": "เตี่ยวลิง", "กางเกงสีคราม": "เตี่ยวหม้อห้อม", "ก้างปลาข้าว": "บ่ะแตก",
"ก้างปลาเทศ": "ผักส้มกุ้ง", "กานพลู": "จันทร์จี๋", "ก้านเหลือง": "ทุ่มคำ", "กามโรค": "มดตะกิต", "การครัว": "ก๋านเยียะกิ๋น",
"การะเกด": "กาแกด", "ก้าวร้าว": "ล่วงล้ำ", "กาสามปีก": "บ่ะแปบป่า", "กาสลัก": "บ่ะเขือบ้าดอกคำ", "กาหลง": "ผักเสี้ยนบ้าน",
"ก้าไหล่": "ทะ", "กาฬโรค": "โรคกาฬดำ", "กำกับ": "คุม", "กำหมัด": "กำลูกกุย", "ก้ำกึ่ง": "ก้ำเกิ่ง",
"กำจัด": "บ่ะแข่น", "กำจาย": "บ่ะช่ำ", "กำชับ": "เข", "กำนัน": "กำนัน", "กำนัล": "นางนาฏสนม",
"กำปั่น": "สะเพา", "กำพู": "ทุ่ม", "กำพืช": "ชาติเชื้อ", "กำมะถัน": "มาด", "กำมะลอ": "เทียม",
"กำมะหยี่": "กำมะยิ", "กำหราบ": "ขนาบ", "กำหนด": "จั้ง", "กำหนดค่า": "กะค่า", "ราคา": "กะค่า",
"กำหนดหมาย": "กดหมาย", "กำไล": "แขน", "กิ่ง": "เค็ด", "กิ้งก่า": "จั๊กก่า", "กิ้งกือ": "แมงแสนตี๋น",
"กินนร": "กินนะรอน", "กินเลี้ยง": "ซุม", "กินเลี้ยงแต่งงาน": "กิ๋นแขก", "กี่": "กี้", "เจ้ากี้เจ้าการ": "เจ้าหน้าเจ้าต๋า",
"กีด": "กีด", "กึกก้อง": "เกิดก้อง", "กึ่ง": "เกิ่ง", "กุ": "ขึ้ลม", "กุ้งยิง": "ต๋าต๋อน",
"กุญแจ": "ขะแจ", "กุญแจมือ": "ขะแจมือ", "กุฎิ": "กุฏี", "กุยช่าย": "หอมแป้น", "กุฏฐัง": "ขี้เรื้อน",
"เก": "เหล้", "เก๋": "เปิง", "เก๊ก": "เถ้", "เกกมะเหรก": "ฮ้าย", "เกง": "เกง",
"เก่ง": "แกว่น", "เกตุมาลา": "จิกโมลี", "เก็บ": "เมี้ยน", "เก็บยา": "ฮิบยา", "เก็บหอมรอมริบ": "ฮอมติฮอมเตาะ",
"เกย": "เก่ย", "เกรอะกรัง": "เหนอะหนะ", "เกราะ": "เขาะ", "เกรง": "เกง", "เกรงใจ": "ผานใจ",
"เกรงว่า": "กลั๋วว่า", "เกริน": "เกิน", "เกลิ่น": "ช่าว", "เกรียก": "เหยี้ยม", "เกรียง": "เบียง",
"เกรียน": "หิ้น", "เกรียบ": "เหียก", "เกรียม": "แห้ม", "เกรียวกราว": "ซ้าวๆ", "เกเร": "ฮ้าย",
"เกล็ดนาคราช": "กีบม้าลม", "เกลอ": "เกลอ", "เกลา": "แต่ง", "เกล้ากระผม": "ข้าเจ้า", "เกล้าผม": "ข้าเจ้า",
"เกล้ากระหม่อม": "ข้าเจ้า", "เกลี่ย": "เขี่ย", "เกลี่ยไกล่": "ฟู่จา", "เกลี้ยกล่อม": "เป๊า", "เกลียด": "ชัง",
"เกลี่ยวดำ": "เกี่ยว",
"ก้อร้อก้อติก": "ตุกติก", "ก็องก็อย": "ผีตองเหลือง", "กอบ": "โกบ", "กอบเกื้อ": "ก่อเกื้อ", "กะจิก": "ค้องก้อง",
"กะชะ": "ซ้า", "กะซับ": "เกียงนา", "กะชิง": "สารพีแหน", "กะตังกะติ้ว": "บ่ะตัง", "กะตังใบ": "ตองแต้ม",
"กะต้าก": "กะแต้ก", "กะทกข้าว": "ฝัดข้าว", "กะทกรก": "น้ำใจใคร่", "กะทอ": "ทอ", "กะทันหัน": "จ้วนจั้น",
"กะทือ": "บ่ะปอกกะแดก", "กะทุ่มโคก": "พุ่มเขา", "กะเทย": "พู้เมีย", "กะเทาะ": "สะเดาะ", "กะแท้": "แมงแคง",
"กะแทง": "ดอกก้าน", "กะเบ็งตัวผู้": "ห้อมเกี่ยวคำ", "กะเบียด": "งุ้น", "กะปริดกะปรอย": "ปิดๆปอยๆ", "กะพริบตา": "พับตา",
"กะพล่องกะแพล่ง": "ปุ้นๆเพ้ๆ", "กะเมง": "ห้อมเกี่ยว", "กะรุ่งกะริ่ง": "โหวกหวาก", "กะเร่อกะร่า": "เล่อล่า",
"กะละแม": "ข้าวหนมปาด", "กะลา": "กะโหล้ง", "กะเหรี่ยง": "ยาง", "กะโหลก": "กะหลก", "กะไหล่": "เคลือบ",
"กัก": "เกิ้ด", "กั๊ก": "ไขว่ควง", "กักขฬะ": "หยาบช้า", "กังหันน้ำ": "หลุก", "กัณรัศ": "ม้ากัณฐัก",
"กัด": "ขบ", "กัดสบัด": "คาบสะวัด", "กัน": "กัน", "กันท่า": "เกิ้ดเกิ้ง", "กันเอง": "อันเดียวกัน",
"กั้น": "เกิ้ง", "กันเกรา": "มันปลา", "กันดาร": "ยาก", "กั้นหยั่น": "หอกทั่ง", "กับแก้": "กับแก้",
"กับข้าว": "ของกิ๋น", "กัปปิย์จังหัน": "ข้าวปลาอาหาร", "กับแกล้ม": "ของกับ", "กัลปพฤกษ์": "กัลป์นั้นเอง", "กากะบาท": "ตีนกา",
"กากะทิง": "บ่ะนาวกาน", "กาจับหลัก": "บ่ะเขือบ้าดอกคำ", "กางเกง": "เตี่ยว", "กางเกงชั้นใน": "เตี่ยวใน", "กางเกงขาสั้น": "เตี่ยวสั้น",
"กาเรการ่อน": "เอื้องปากเป็ด", "กางเกงขายาว": "เตี่ยวยาว", "กางเกงลิง": "เตี่ยวลิง", "กางเกงสีคราม": "เตี่ยวหม้อห้อม", "ก้างปลาข้าว": "บ่ะแตก",
"ก้างปลาเทศ": "ผักส้มกุ้ง", "กานพลู": "จันทร์จี๋", "ก้านเหลือง": "ทุ่มคำ", "กามโรค": "มดตะกิต", "การครัว": "ก๋านเยียะกิ๋น",
"การะเกด": "กาแกด", "ก้าวร้าว": "ล่วงล้ำ", "กาสามปีก": "บ่ะแปบป่า", "กาสลัก": "บ่ะเขือบ้าดอกคำ", "กาหลง": "ผักเสี้ยนบ้าน",
"ก้าไหล่": "ทะ", "กาฬโรค": "โรคกาฬดำ", "กำกับ": "คุม", "กำหมัด": "กำลูกกุย", "ก้ำกึ่ง": "ก้ำเกิ่ง",
"กำจัด": "บ่ะแข่น", "กำจาย": "บ่ะช่ำ", "กำชับ": "เข", "กำนัน": "กำนัน", "กำนัล": "นางนาฏสนม",
"กำปั่น": "สะเพา", "กำพู": "ทุ่ม", "กำพืช": "ชาติเชื้อ", "กำมะถัน": "มาด", "กำมะลอ": "เทียม",
"กำมะหยี่": "กำมะยิ", "กำหราบ": "ขนาบ", "กำหนด": "จั้ง", "กำหนดค่า": "กะค่า", "ราคา": "กะค่า",
"กำหนดหมาย": "กดหมาย", "กำไล": "แขน", "กิ่ง": "เค็ด", "กิ้งก่า": "จั๊กก่า", "กิ้งกือ": "แมงแสนตี๋น",
"กินนร": "กินนะรอน", "กินเลี้ยง": "ซุม", "กินเลี้ยงแต่งงาน": "กิ๋นแขก", "กี่": "กี้", "เจ้ากี้เจ้าการ": "เจ้าหน้าเจ้าต๋า",
"กีด": "กีด", "กึกก้อง": "เกิดก้อง", "กึ่ง": "เกิ่ง", "กุ": "ขึ้ลม", "กุ้งยิง": "ต๋าต๋อน",
"กุญแจ": "ขะแจ", "กุญแจมือ": "ขะแจมือ", "กุฎิ": "กุฏี", "กุยช่าย": "หอมแป้น", "กุฏฐัง": "ขี้เรื้อน",
"เก": "เหล้", "เก๋": "เปิง", "เก๊ก": "เถ้", "เกกมะเหรก": "ฮ้าย", "เกง": "เกง",
"เก่ง": "แกว่น", "เกตุมาลา": "จิกโมลี", "เก็บ": "เมี้ยน", "เก็บยา": "ฮิบยา", "เก็บหอมรอมริบ": "ฮอมติฮอมเตาะ",
"เกย": "เก่ย", "เกรอะกรัง": "เหนอะหนะ", "เกราะ": "เขาะ", "เกรง": "เกง", "เกรงใจ": "ผานใจ",
"เกรงว่า": "กลั๋วว่า", "เกริน": "เกิน", "เกลิ่น": "ช่าว", "เกรียก": "เหยี้ยม", "เกรียง": "เบียง",
"เกรียน": "หิ้น", "เกรียบ": "เหียก", "เกรียม": "แห้ม", "เกรียวกราว": "ซ้าวๆ", "เกเร": "ฮ้าย",
"เกล็ดนาคราช": "กีบม้าลม", "เกลอ": "เกลอ", "เกลา": "แต่ง", "เกล้ากระผม": "ข้าเจ้า", "เกล้าผม": "ข้าเจ้า",
"เกล้ากระหม่อม": "ข้าเจ้า", "เกลี่ย": "เขี่ย", "เกลี่ยไกล่": "ฟู่จา", "เกลี้ยกล่อม": "เป๊า", "เกลียด": "ชัง",
"เกลี่ยวดำ": "เกี่ยว",
"เกลือก":"เยียว","เกลื้อน":"เขี้ยน","เกวียน":"เกียน","เกว้า":"กว้าว","เก้อ":"เคิก",
"เกะกะ":"เติก","เกาลัด":"ก่อเดือย","เก้าอี้":"ตั่งอี้","เกิน":"ล้ำ","เกินไป":"ล้ำไป",
"เกี๋ยง":"หนิ้ง","เกี๋ยงงอน":"หนิ้ง","เกี๋ยงแย่ง":"ลู่","เกียจ":"คร้าน","เกียรติยศ":"ชื่อเสียง",
"เกียรติศักดิ์":"ศักดินา","เกี้ยว":"หยอก","เกี๊ยะ":"ก็อบแก๊บ","เกื้อกลู":"ค้ำชู","เกือก":"เกิบ",
"เกือบ":"ฮิม","แก":"ตั๋ว","แก้เกี้ยว":"แก้ตั๋ว","แก้แค้น":"ตอบเวร","แก้ต่าง":"แก้ตาง",
"แก้เผ็ด":"เยียะตอบ","แกงจืด":"แก้งต้ม","แกงร้อน":"แกงงุ้น","แกงป่า":"แกงขม","แก่งแย่ง":"หนิ้ง",
"แกร่ง":"แต็ก","แกร่ว":"แซ่ว","แกล้ง":"แข้ง","แกลบ":"แกลบแก่","แกล้ม":"กับ",
"แก้วสารพัตรนึก":"แก้วมณีโชติ","แกแล":"สะลัก","แก้ว":"ตะไหลแก้ว","แก้วตาไว":"หนามจายแทง","แกะ":"ขวัก",
"โก้":"ครึ","โกง":"ส้อ","โก้งเก้ง":"โหย้งเหย้ง","โก้งโค้ง":"โก่งโก๊ะ","โกน":"ขูด",
"โกย":"โกบ","โกรก":"โจก","โกรธ":"โขด","โกร๋น":"อ๋อย","โกโรโกเต":"หลุหละ",
"ใกล้เคียง":"แหมะ","ไก่อู":"ไก่โชง","ไก่ชน":"ไก่โชง","ไก่ขันปลาย":"ไก่ขันเลย",
"ไก่นา":"นกทุ่ม","ไก๋":"แผ","ไกร":"กวาง","คำเมือง":"กำเมือง",

 


///////////////////////////////////////////////////////////ข/////////////////////////////////////////
"ขจร": "สลิด", "ขจี": "จี", "ขนเพชร": "กิ๋ว", "ขนลุก": "ขนคิงลุก,ขนลุก", "ขนบ": "แบบเบ้า","ข้าว": "เข้า",
"ข้นแค้น": "ผาน,ทุกข์ยาก,เบียะฮำ", "ขนม": "ข้าวหนม", "ขนมกรุบ": "ข้าวหนมคาถา,ข้าวหนมขี้แมว", "ขนมกวน,กาละแม": "ข้าวหนมปาด", "ขนมจีน": "ข้าวหนมเส้น",
"ขนมต้ม": "ข้าวหนมมะลาน,ข้าวหนมหัวหงอก", "ขนมเหนียว": "ข้าวหนมเปี่ยง,ข้าวเปี่ยง", "ขนมทอง": "ข้าวหนมวง", "ขนมเทียน": "ข้าวหนมเทียน,ข้าวหนมจ๊อก", "ขนมสอดไส้": "ข้าวหนมจ๊อก",
"ขนมนางเล็ด": "ข้าวแตน", "ขนมปากหม้อ": "ข้าวแคบ", "ขนมขาวนึ่ง": "ข้าวหนมเกลือ", "ขนมเมล็ดนึ่ง": "ข้าวหนมคนน้ำอ้อย", "ขนอน": "อ่าย",
"ขนอบ": "กับ", "ขนัด": "ที่", "ขนัน": "เค้น", "ขนาย": "ขนาย,ขนัย", "ขนาน": "พาก",
"ขนาน": "แฟ", "ขนุน": "มะหนุน", "ขนุนป่า": "มะหนุนดอย", "ขนุนนก": "หาดซาน", "ขนุนละมุด": "มะหนุนหนัง",
"ขบขัน": "หน้าใคร่หัว,ปูนดีใคร่หัว,มอกม่วน", "ขบกราม": "ยั้นเขี้ยว", "ข่มขืน": "ข่มขืน,เม็ก,เต็ก", "ข่มเหง": "ข่มเหง,ค่ำ", "ขมวด": "หมวด",
"ขมับ": "หงีบ", "ขมา": "ษะมา,สมมา", "ขม้ำ": "หม่ำ,หมั่น", "ขมิ้นชัน": "ข้าวหมิ้นไข", "ขมิ้นนาง": "มะแระนก",
"ขมิ้นอ้อย": "ข้าวหมิ้นขึ้น", "ขมีขมัน": "ฟัง,ฟังฟ้าว", "ขมึง": "โจง,โจ่,โจงตาใส่", "ขมุกขมัว": "มืดซุ้มซิ้ม,สะลุ้มสะลิ้ม", "ขมุบขมิบ": "หมุบหมิบ",
"ขโมย": "ลัก", "ขยอก": "หนอน", "ขยอก": "ขยอก,กลืน", "ขยะ": "ขี้เยื้อ,ขี้เฮอะ", "ขยะแขยง": "ชะ,กิเหลียด",
"ขยัก": "หยัก,ยอย,แหม็ด", "ขยักขย่อน": "หนๆถอยๆ", "ขยักขย้อน": "อึกอัก", "ขยัน": "หมั่น", "ขยัน": "ก่อหนัง,ขยัน",
"ขยับ": "ขด", "ขยุกขยิก": "ดุกดิก", "ขยุกขยิก": "หยุกหยิก", "ขยาด": "กลัว,พ่าน", "ขยาย": "ขยาย,ควาก",
"ขยำ": "พั่น", "ขยิบตา": "พริบตา,พับตา", "ขยี้": "ยั้ี,ยูยี", "ขยุ้ม": "ยุ่ม,ยว่าม", "ขรม": "ซ้าว,ลั่น",
"ขรรค์ชัย": "ศรีขรรค์ชัย", "ขรึม": "ดัก,ชด,จึมมึก", "ขรุขระ": "ป๊อกแป็ก,บุกปัก,ขุขะ", "ขลัง": "ยำ,พิษยำ", "ขรัวตา": "ตุ๊ปู่,ครูบา",
"ขลาด": "หย้าน", "ขลุกขลัก": "ขัด", "ขลุกขลิก": "มะกะโหลก,มะขะโหลก", "ขลุกขลุ่ย": "มัวเมา,หมก", "ขวง": "ขี้ขวง",
"ขวด": "ขวด,พวง", "ข่วน": "ยาด,วัก", "ขวนขวาย": "ขงขวาย", "ขลุม": "แก๊ก,กือ", "ขวักไขว่": "สับสน,ซะไซ้",
"ขว้าง": "คว่าง", "ขวางหน้า": "เทิก,เคิก", "ขวางๆรีๆ": "หนๆขวางๆหนๆถอยๆ", "ขวาน": "มุย", "ขวานโยน": "มะลู",
"ขวานผ่าพืน": "มุยโบะหลัว,มุยม่าย", "ขอโทษ": "ขอษะมา,ขมสมมา", "ของชำร่วย": "ของรอม", "ของแถมพก": "ของเติ่ม,ของเตื่อม", "ขอรับ,ขอรับกระผม": "เจ้า",
"ของกำนัล": "ของฝาก", "ขอด": "เขาะ", "ขะมักเขม้น": "ฟัั่งฟ้าว,ฟั่งเยียะ", "ขัณฑสกร": "ดีน้ำตาล", "ขัดแตะ": "สาน",
"ขัน": "ขัน", "ขันชะเนาะ": "เค้น", "ขันทองพยาบาท": "ต้นจิเดียม,ต้นป่าช้าหมอง,มะดูกเสื่อม", "ขันที": "พู้เมีย,หน้อง", "ขันหมาก": "ขันดอง",
"ขับ": "ขับ,ไล่", "ขับ": "ร่ำ", "ขั้ว": "ขวั้น", "ขากรรไตร": "ตงคาง", "ขา": "ยาม",
"ขานาง": "ไม้นาง", "ขา": "เจ้า,เหย", "ข่าต้น": "ต้นพลู", "ข้าพเจ้า,ข้าพระพุทธเจ้า": "ข้าเจ้า,ผู้ข้า,ข้าน้อย", "ข้าง": "ข้าง,พ่าง",
"ข้างขึ้น": "เดือนออก", "ข้างแรม": "เดือนแรม", "ข้าง": "ทาง", "ขาดคราว": "ขาดหว่าง", "ขาดทุน": "ปุดทุน,ปุดทึน,หลุบทึน",
"ขาดตลาด": "ขาดกาด", "ขาดตัว": "ที่ทึก,ตายตัว", "ขาดมือ": "หวิดมือ", "ขาดเหลือ": "หวิดคาด", "ข้างเคียง": "แหมะ",
"ข้าแต่": "ข้าแด่", "ขานาง": "ช้างเผือกหลวง", "ขาม": "ขาม,หย้าน,ยำแยง", "ข่าย": "ห่าย,เคิ้ง", "ข้าวเกรียบปากหม้อ": "ข้าวแคบ",
"ข้าวเกรียบว่าว": "ข้าวควบ", "ข้าวจ้าว": "ข้าวจ้าว", "ข้าวเช้า": "ข้าวงาย", "ข้าวกลางวัน": "ข้าวตอน", "ข้าวเย็น": "ข้าวแลง",
"ข้าวต้ม": "ข้าวต้ม", "ข้าวตอกแตก": "ตีนตัง", "ข้าวโพด": "ข้าวสาลี", "ข้าวต้มผัด": "ข้าวต้มกระทิ", "ข้าวนาสวน": "ข้าวไร่",
"ข้าวนาเมือง": "ข้าวนา", "ข้าวยาคู": "ข้าวคุ", "ข้าวปลูก": "ข้าวเชื้อ", "ข้าวตาก": "ยาบข้าวจี่", "ข้าวกล้า": "กล้า",
"ข้าวเบา": "ข้าวดอ", "ข้าวหนัก": "ข้าวปี", "ข้าวเหนียว": "ข้าวหนึ้ง", "ข้าวเหนียวดำ": "ข้าวก่ำ", "ข้าวพอง": "ข้าวแตนซี",
"ข้าวเม่า": "ข้าวเหม้า", "ข้าวฟ่าง": "ข้าวป้าง", "ข้าวปิ้ง": "ข้าวจี่", "ข้าวเย็น": "ข้าวแลง", "ข้าวสาร": "ข้าวสาร",
"ข้าวเหนียวมูลกะทิ": "ข้าวมัน"
,"ข้าวเปียก": "ข้าวเปียะ", "ข้าวพระ": "ข้าวพระเจ้า", "ข้าวละมาน": "ข้าวนก", "ข้าวเหนียวแดง": "ข้าวหนมแดง", "ข้าวของ": "ข้าวของ",
"ข้าวสารดอกใหญ่": "บ่ะโอเครือ", "ข้าศึก": "ข้าเสิ้ก", "ข่าวอกุศล": "คำโอ่เน่า", "ขาเขียด": "ผักหิน", "ขิงแครง": "ขิงแคง",
"ขี้ขลาด": "ขี้แขะ", "ขี้กลาก": "ขี้ขาก", "ขี้ครอก": "หญ้าอี่ยู้", "ขี้โคลน": "ขี้เปลอะ", "ขี้ชัน": "ขะย้า",
"ขี้เกียจ": "ขี้คร้าน", "ขี้บ่น": "ขี้จ่ม", "ขี้สนิม": "ขี้เหมี้ยง", "ขี้เต่า": "ขี้แฮ้", "ขี้เหร่": "ผ่างฮ้าย",
"ขี้เหนียว": "ขี้จิ", "ขี้แย": "ขี้ไห้", "ขี้โว": "ขี้โว", "ขี้ดุ": "ขี้สวก", "ขี้ผึ้ง": "ชีปุก",
"ขี้ครอก": "หย้าผมยุ่ง", "ขี้เหล็กเทศ": "ผักเห็ด", "ขี้โกง": "ขี้ส้อ", "ขี้โอ่": "ขี้หย้อง", "ขี้ขโมย": "ขี้ลัก",
"ขี้ง่วง": "ขี้เหงา", "ขี้ปด": "ขี้จุ", "ขี้เซา": "ขี้เหงา", "ขี้ตืด": "ขี้จิ", "ขี้นก": "ขี้นก",
"ขี้แมลงวัน": "ขี้แมงงน", "ขึง": "เขิง", "ขึงตา": "โจ่ต๋า", "ขึงพืด": "เขิงวา", "ขึ้ง": "หมิ้ง",
"ขื่น": "ฮึน", "ขือขวาง": "ขื่อป็อก", "ขื่อคัด": "ขื่อป็อก", "ขื่อจมูก": "ขื่อดัง", "ขุด": "บก",
"ขุนแผน": "ปู่แถนย่าแถน", "ขุน": "เกือ", "ขู่เข็ม": "ขู่เข็น", "เข": "เหล้", "เขก": "วัด",
"เข็ด": "ต่อง", "เข็ดฟัน": "เข็ดเขี้ยว", "เข็น": "ยู้", "เข่น": "ไห่", "เข็มกลัด": "เข็มกะหลัด",
"เข็มขัด": "สายฮั้ง", "เข้มงวด": "เคร่ง", "เขม่น": "ขะเม่น", "เข็มป่า": "เข็มต๋าไก่", "เขม่า": "ขี้เขม่า",
"เขมือบ": "ฮากเลือด", "เขย": "ชาย", "เขยก": "ขะเย็ก", "เขย่ง": "แหย่งแหยะ", "เขยตาย": "สมชื่น",
"น้ำข้าว": "สมชื่น", "เขย่า": "สว่าย", "เขยิน": "ซุน", "เขยิบ": "ขด", "เขยื้อน": "ฟั่นเฟือน",
"เขลา": "ง่วงใบ้", "เขา": "เขา", "เข้าเจ้า": "ผีเข้า", "เข้าท่า": "เปิง", "เข้าที": "เปิง",
"เขียน": "แต้ม", "เขียม": "ขี้จิ", "เขี้ยว": "เขี้ยว", "เขื่อง": "ฮาม", "แขก": "แขก",
"แข่ง": "เอี่ยง", "แข้ง": "แค่ง", "แขนคอก": "แขนส็อก", "แขม็บ": "ขะแม็บ", "แขยง": "จ๊ะ",
"แขย่ง": "แขย็บ", "โข่ง": "โค่ง", "โขมง": "ฟุ้ง", "โขลก": "โขก", "โขลง": "โขง",
"โขลนทวาร": "ประตูป่า", "ไข": "ไข", "ไข่ดัน": "เอนขอด", "ไข่มด": "แมงมัน", "ไข่แดง": "มอนไข่",
"ไข่แหน": "ผำ", "ไข้": "เมื่อย", "ไข้จับสั่น": "ไข้ป่า", "ไข้สั่นเรื้อรัง": "ไข้ป้าง", "ไข้นกนางแอ่น": "ไข้สันนิบาต",
"ไข้หวัดใหญ่": "ไข้เส่า", "ไข้ปอดบวม": "ไข้เจ็บอก", "ไข้รวกสาด": "ไข้ลากสาด", "ไขว่คว้า": "กุ่มคว้า", "ไขว่ห้าง": "ขาก่ายง้อน",
"ไขว้เขว": "ขวิดขวาง", "ไขสือ": "เยียะบ่ฮู้", "ไขเสนียด": "ขี้หม่า", "ไขหู": "เยียะหลึ่ง"

///////////////////////////////////////////////////////////////////////////////////ค      //////////////////
,"คง": "หมั้นคุง", "คงกระพัน": "ข่ามคง", "คงคาเดือด": "ป้านแถ", "คด": "คด", "คนทรง": "ที่นั่งผี",
"คนทา": "ไม้ซี่", "คนทิสอขาว": "ผีเสื้อน้อย", "คนทิสอดำ": "ผีีเสื้อหลวง", "คนที": "น้ำต้นคันที", "คนทีเหมา": "ถ่านไฟผี",
"คนโท": "น้ำต้้นดิน", "คนธรรพ": "คันธัพพะ", "คนละ": "และคนและเทื่อ", "ค้นหูก": "ค้นหูก", "คบ": "ตามแคร่",
"ครรภ์": "คัพภะ", "ครรโลง": "คะโลง", "ครรไล": "คาไค", "ครวญคราง": "อือคราง", "ครองผ้า": "ที่รงผ้า",
"ครองจีวร": "ทงผ้า", "ครองเพศ": "ทะรงเพศ", "ครองเมือง": "กินเมือง", "ครองสิกขา": "ทะรงสิกขา", "ครองชีพ": "เลี้ยงชีพ",
"ครอบ": "ควบ", "ครอบจักรวาล": "มะกล่องข้าว", "คร่อม": "ควบ", "ครั้ง": "เทื่อ", "ครั้้งคราว": "เทื่อยาม",
"ครั้งนั้น": "คราวนั้น", "ครั้งนี้": "คราวนี้", "ครั้งแรก": "หนที", "ครั้งหลัง": "หนลุน", "ครั้งกระโน้น": "เมื่อก่อนเนิ้น",
"ครั้งก่อน": "คราวก่อน", "ครั่นคร้าม": "หย้านกลัว", "ครั่น": "หย้าน", "ครั่นตัว": "ปวดเมื่อย", "ครั้น": "คัน",
"ครัว": "เตาไฟ", "คราด": "เผือ", "คราม": "ครามห้อม", "คราว": "ซ่ำ", "คร่าว": "กว้าว",
"คร่ำครวญ": "ไห้หอนวอนทุกข์", "คริสต์": "คริสต์", "ครีบ": "กีบ", "ครี": "ผ่างร้าย", "ครึกครื้น": "ม่วนงัน",
"ครึกโครม": "ตูมตาม", "ครึ่ง": "เกิ่ง", "ครึ่งชาติ": "น้ำผ่า", "ครื้ม": "คุ้ม", "ครุ": "น้ำถุ้ง",
"ครู่": "บึด", "คฤห": "คห", "คลอง": "เหมือง", "คล่อง": "เลี่ยน", "คล้อง": "คะล้อง",
"คล้องจอง": "คับ", "คลอด": "ออกลูก", "คล้อย": "ช้าย", "คล้อยตาม": "ลุยทวย", "คละ": "สุน",
"คลัก": "อื้ด", "คลัง": "เล้ม", "คลั่ง": "จวง", "คลับคล้ายคลับคลา": "เหมือนพ่องบ่เหมือนพ่อง", "คล้า": "แหย่ง",
"ครางเเครง": "แคงใจ", "คลาย": "มาย", "คลำ": "ซวาม", "คล้ำ": "ซ้ำ", "คลี่": "ควี่",
"คลึง": "คะลิก", "คลื่น": "แคมน้ำ", "คลื่่นไส้": "ค้นท้อง", "คลื่นเหียน": "ขะมุขะมุ่น", "คลุก": "สุน",
"คลุ้ง": "ฟุ้ง", "คลุก": "คะลุม", "คลุมโปง": "คุ่มคะลุม", "คลุ้ม": "คุ้ม", "ควง": "ค้อง",
"ควบด้าย": "คบฝ้าย", "ควั่น": "ขวั้น", "คว้า": "เปี่ย", "ความ": "คำ", "ความกรุฌา": "คำขุณณา",
"ควาน": "งม", "คว้าน": "ควาด", "ควายทุย": "ควายงก", "ควายเปลี่ยว": "ควายหงาน", "ควายเผือก": "ควายพอน",
"ควายเบิ่ง": "ควายเลอ", "ควายตัวผู้": "ควายพู้", "ควายตัวเเม่": "ควายแม่", "ความรุ่น": "ควายสื่อ", "ลูกควาย": "ควายน้อย",
"ควายอ่อน": "ควายน้อย", "คว่ำ": "ขวั้้ำ", "คอพอก": "คอเอิม", "ค่อนขอด": "เยาะไย", "ค่อนแคะ": "เยาะไย",
"ค่อน": "ข้อน", "ค้อนกลอง": "มะค้อนค้อง", "ค้อนหมาขาว": "พ้าวพันลำ", "ค่อม": "ข้อ", "ค่อมทอง": "แมงทับคำ",
"คอย": "ถ้า", "ค่อยยังชั่ว": "ยังเเควน", "ค่อยดีขึ้น": "ดีขึ้นพ่อง", "คะ": "เจ้า", "คะนอง": "อืน",
"คะนึง": "คะนิง", "คะเน": "คาด", "คะยั้นคะยอ": "เหนี่ยว", "คั่ง": "อื้ด", "คะมำ": "วำ",
"คัดจมูก": "คัดดัง", "คัดหนังสือ": "ร่ายหนังสือ", "คัดค้าน": "ท้วงติง", "คัดคลองเลื่อย": "คัดคองเลื่อ", "คัดเลือด": "อึดเลือด",
"คัดเค้า": "เค็ดเค้า", "คันยอ": "คันจำ", "คับขัน": "ร้อนร้าย", "คั่น": "ขั้น", "คันทรง": "ก้านถง",
"คับแคบ": "กีด", "คั่ว": "ขั้้ว", "คา": "ขำ", "ค่าคบ": "ง่าอ้าย", "คาง": "กาง",
"คางทูม": "ฮ่าวอก", "คางคก": "ค้างคาก", "ค่าง": "อี่ค่าง", "ค้างคาว": "รุ้งคาว", "ค้างคาวลูกหนู": "อี่บิง",
"คาดคั้น": "ขนาบ", "คาดเอว": "รัดแอว", "ค้าน": "โต้", "คาพยุต": "คาวุต", "คามวาสี": "หนบ้าน",
"คาย": "กาย", "คาราคาซัง": "ขำคะขำคา", "คำป่า": "มะค้ายคัด", "คำฝอย": "ดอกคำ", "คำราม": "คราง",
"คำเครือ": "พ้านเขากวาง"
,"คำลึกซ้ำ" : "คำเลิ้กแลบ", "คำแสด" : "คำยง", "คิด" : "คึด", "คิดค้น" : "คึดค้าว", "คี่" : "คีก",
"ครีมปากนกแก้ว" : "กีมนกเค้า", "ครีม" : "กีม", "คึกคัก" : "อุกหนา", "คืนฉ้าย" : "ผึกบืม", "คืน" : "ขืน",
"คืนยันรุ่ง" : "คืนรุ่ง", "คุก" : "คอก", "คุกเข่า" : "คู้เข่า", "คุ้ง" : "โค้ง", "คุณ" : "อี่นาย",
"คุดทะราด" : "ขี้โม้", "คุ้มครอง" : "ปกปักรักษา", "คุ้มดีคุ้มร้าย" : "จับดีจับร้าย", "คุย" : "อู้", "คู" : "คือ",
"คูน" : "ทูน", "คู่สร้าง" : "ตัวกรรมตัวเวร", "เคยตัว" : "หย้าม", "เครา" : "ขนกาง", "เครื่อง" : "ครัว",
"เตรื่องไทยทาน" : "ครัวทาน", "เครื่่องครัว" : "ครัวกิน", "เครื่องใน" : "ครัวใน", "เครื่องมือ" : "ครัวมือ", "เครื่องราง" : "ของข่าม",
"เครื่อฃสาย" : "เครื่องสาย", "เครื่องสูง" : "พัดพ้าวจาวมร", "เคล็ด" : "ห้าน", "เคล้น" : "บึีบ", "เคล้า" : "สูน",
"เคลิ้ม" : "ลุืมคิฃ", "เคลม" : "และเลียม", "เคลื่อน" : "คร้าย", "เคลือบ" : "คาบ", "เคลือบเเคลง" : "สะเเคงใจ",
"เคลือบแฝง" : "ยั้อมแปลง", "เคอะ" : "เงอะงะ", "เคารพ" : "คารวะ", "เคารพยำเกรง" : "คารวะยำแยง", "เคาะ" : "ต่อย",
"เคาะเเคะ" : "เกาะแกะ", "เคียง" : "เฮียง", "เคี่ยม" : "เกล็ดคำ", "เคียว" : "เขี้ยว", "เคี่ยวเข็ญ" : "ขนาบ",
"เคือง" : "เคียด", "แค่" : "มอก", "แค่น" : "จา", "แค้น" : "แค้นใจ", "แคบ" : "กีด",
"แคบ้าน" : "แคแดง", "แคร่" : "คานหาม", "แคระ" : "แค้น", "เเคล้วคลาด" : "ก้าดแก้ว", "เเคล้วคลาด" : "ก้าดแก้ว",
"แคล้วคล่อง" : "แกว่น", "แคะ" : "ขวัก", "โคก" : "โทก", "โคกกระสุน" : "หนามดิน", "โคกกระออม" : "หญ้าแมงหมี่",
"โคคลาน" : "ขมิ้นเครือ", "โคดม" : "โคตมะ", "โคน" : "เค้า", "โค่น" : "ก่น", "โคมเวียน" : "โคมผัด",
"โครงจมูก" : "หมงดัง", "โครม" : "ตึ๊ง", "โครมคราม" : "ตึ๊๊งตั๊ก", "โคลง" : "คะโลง", "โคลงเคลง" : "โงนเงน",
"โคลน" : "ขี้เปอะ", "ใคร" : "ใผ", "ใคร่ครวญ" : "คึดคนิง", "ไคร้หางนาด" : "หนอดน้ำ", "ไค้หางหมา" : "หาดน้ำ",
"คง" : "หมั้นคุง", "คงกระพัน" : "ข่ามคง", "คงคาเดือด" : "ป้านแถ", "คด" : "คด", "คนทรง" : "ที่นั่งผี",
"คนทา" : "ไม้ซี่", "คนทิสอขาว" : "ผีเสื้อน้อย", "คนทิสอดำ" : "ผีีเสื้อหลวง", "คนที" : "น้ำต้นคันที", "คนทีเหมา" : "ถ่านไฟผี",
"คนโท" : "น้ำต้้นดิน", "คนธรรพ" : "คันธัพพะ", "คนละ" : "และคนและเทื่อ", "ค้นหูก" : "ค้นหูก", "คบ" : "ตามแคร่",
"ครรภ์" : "คัพภะ", "ครรโลง" : "คะโลง", "ครรไล" : "คาไค", "ครวญคราง" : "อือคราง", "ครองผ้า" : "ที่รงผ้า",
"ครองจีวร" : "ทงผ้า", "ครองเพศ" : "ทะรงเพศ", "ครองเมือง" : "กินเมือง", "ครองสิกขา" : "ทะรงสิกขา", "ครองชีพ" : "เลี้ยงชีพ",
"ครอบ" : "ควบ", "ครอบจักรวาล" : "มะกล่องข้าว", "คร่อม" : "ควบ", "ครั้ง" : "เทื่อ", "ครั้้งคราว" : "เทื่อยาม",
"ครั้งนั้น" : "คราวนั้น", "ครั้งนี้" : "คราวนี้", "ครั้งแรก" : "หนที", "ครั้งหลัง" : "หนลุน", "ครั้งกระโน้น" : "เมื่อก่อนเนิ้น",
"ครั้งก่อน" : "คราวก่อน", "ครั่นคร้าม" : "หย้านกลัว", "ครั่น" : "หย้าน", "ครั่นตัว" : "ปวดเมื่อย", "ครั้น" : "คัน",
"ครัว" : "เตาไฟ", "คราด" : "เผือ", "คราม" : "ครามห้อม", "คราว" : "ซ่ำ", "คร่าว" : "กว้าว",
"คร่ำครวญ" : "ไห้หอนวอนทุกข์", "คริสต์" : "คริสต์", "ครีบ" : "กีบ", "ครี" : "ผ่างร้าย", "ครึกครื้น" : "ม่วนงัน",
"ครึกโครม" : "ตูมตาม", "ครึ่ง" : "เกิ่ง", "ครึ่งชาติ" : "น้ำผ่า", "ครื้ม" : "คุ้ม", "ครุ" : "น้ำถุ้ง",
"ครู่" : "บึด", "คฤห" : "คห", "คลอง" : "เหมือง", "คล่อง" : "เลี่ยน", "คล้อง" : "คะล้อง",
"คล้องจอง" : "คับ", "คลอด" : "ออกลูก", "คล้อย" : "ช้าย", "คล้อยตาม" : "ลุยทวย", "คละ" : "สุน",
"คลัก" : "อื้ด", "คลัง" : "เล้ม", "คลั่ง" : "จวง", "คลับคล้ายคลับคลา" : "เหมือนพ่องบ่เหมือนพ่อง", "คล้า" : "แหย่ง",
"ครางเเครง" : "แคงใจ",
"คลาย" : "มาย", "คลำ" : "ซวาม", "คล้ำ" : "ซ้ำ", "คลี่" : "ควี่", "คลึง" : "คะลิก",
"คลื่น" : "แคมน้ำ", "คลื่่นไส้" : "ค้นท้อง", "คลื่นเหียน" : "ขะมุขะมุ่น", "คลุก" : "สุน", "คลุ้ง" : "ฟุ้ง",
"คลุก" : "คะลุม", "คลุมโปง" : "คุ่มคะลุม", "คลุ้ม" : "คุ้ม", "ควง" : "ค้อง", "ควบด้าย" : "คบฝ้าย",
"ควั่น" : "ขวั้น", "คว้า" : "เปี่ย", "ความ" : "คำ", "ความกรุฌา" : "คำขุณณา", "ควาน" : "งม",
"คว้าน" : "ควาด", "ควายทุย" : "ควายงก", "ควายเปลี่ยว" : "ควายหงาน", "ควายเผือก" : "ควายพอน", "ควายเบิ่ง" : "ควายเลอ",
"ควายตัวผู้" : "ควายพู้", "ควายตัวเเม่" : "ควายแม่", "ความรุ่น" : "ควายสื่อ", "ลูกควาย" : "ควายน้อย", "ควายอ่อน" : "ควายน้อย",
"คว่ำ" : "ขวั้้ำ", "คอพอก" : "คอเอิม", "ค่อนขอด" : "เยาะไย", "ค่อนแคะ" : "เยาะไย", "ค่อน" : "ข้อน",
"ค้อนกลอง" : "มะค้อนค้อง", "ค้อนหมาขาว" : "พ้าวพันลำ", "ค่อม" : "ข้อ", "ค่อมทอง" : "แมงทับคำ", "คอย" : "ถ้า",
"ค่อยยังชั่ว" : "ยังเเควน", "ค่อยดีขึ้น" : "ดีขึ้นพ่อง", "คะ" : "เจ้า", "คะนอง" : "อืน", "คะนึง" : "คะนิง",
"คะเน" : "คาด", "คะยั้นคะยอ" : "เหนี่ยว", "คั่ง" : "อื้ด", "คะมำ" : "วำ", "คัดจมูก" : "คัดดัง",
"คัดหนังสือ" : "ร่ายหนังสือ", "คัดค้าน" : "ท้วงติง", "คัดคลองเลื่อย" : "คัดคองเลื่อ", "คัดเลือด" : "อึดเลือด", "คัดเค้า" : "เค็ดเค้า",
"คันยอ" : "คันจำ", "คับขัน" : "ร้อนร้าย", "คั่น" : "ขั้น", "คันทรง" : "ก้านถง", "คับแคบ" : "กีด",
"คั่ว" : "ขั้้ว", "คา" : "ขำ", "ค่าคบ" : "ง่าอ้าย", "คาง" : "กาง", "คางทูม" : "ฮ่าวอก",
"คางคก" : "ค้างคาก", "ค่าง" : "อี่ค่าง", "ค้างคาว" : "รุ้งคาว", "ค้างคาวลูกหนู" : "อี่บิง", "คาดคั้น" : "ขนาบ",
"คาดเอว" : "รัดแอว", "ค้าน" : "โต้", "คาพยุต" : "คาวุต", "คามวาสี" : "หนบ้าน", "คาย" : "กาย",
"คาราคาซัง" : "ขำคะขำคา", "คำป่า" : "มะค้ายคัด", "คำฝอย" : "ดอกคำ", "คำราม" : "คราง", "คำเครือ" : "พ้านเขากวาง",
"คำลึกซ้ำ" : "คำเลิ้กแลบ", "คำแสด" : "คำยง", "คิด" : "คึด", "คิดค้น" : "คึดค้าว", "คี่" : "คีก",
"ครีมปากนกแก้ว" : "กีมนกเค้า", "ครีม" : "กีม", "คึกคัก" : "อุกหนา", "คืนฉ้าย" : "ผึกบืม", "คืน" : "ขืน",
"คืนยันรุ่ง" : "คืนรุ่ง", "คุก" : "คอก", "คุกเข่า" : "คู้เข่า", "คุ้ง" : "โค้ง", "คุณ" : "อี่นาย",
"คุดทะราด" : "ขี้โม้", "คุ้มครอง" : "ปกปักรักษา", "คุ้มดีคุ้มร้าย" : "จับดีจับร้าย", "คุย" : "อู้", "คู" : "คือ",
"คูน" : "ทูน", "คู่สร้าง" : "ตัวกรรมตัวเวร", "เคยตัว" : "หย้าม", "เครา" : "ขนกาง", "เครื่อง" : "ครัว",
"เตรื่องไทยทาน" : "ครัวทาน", "เครื่่องครัว" : "ครัวกิน", "เครื่องใน" : "ครัวใน", "เครื่องมือ" : "ครัวมือ", "เครื่องราง" : "ของข่าม",
"เครื่อฃสาย" : "เครื่องสาย", "เครื่องสูง" : "พัดพ้าวจาวมร", "เคล็ด" : "ห้าน", "เคล้น" : "บึีบ", "เคล้า" : "สูน",
"เคลิ้ม" : "ลุืมคิฃ", "เคลม" : "และเลียม", "เคลื่อน" : "คร้าย", "เคลือบ" : "คาบ", "เคลือบเเคลง" : "สะเเคงใจ",
"เคลือบแฝง" : "ยั้อมแปลง", "เคอะ" : "เงอะงะ", "เคารพ" : "คารวะ", "เคารพยำเกรง" : "คารวะยำแยง", "เคาะ" : "ต่อย",
"เคาะเเคะ" : "เกาะแกะ", "เคียง" : "เฮียง", "เคี่ยม" : "เกล็ดคำ", "เคียว" : "เขี้ยว", "เคี่ยวเข็ญ" : "ขนาบ",
"เคือง" : "เคียด", "แค่" : "มอก", "แค่น" : "จา", "แค้น" : "แค้นใจ", "แคบ" : "กีด",
"แคบ้าน" : "แคแดง", "แคร่" : "คานหาม", "แคระ" : "แค้น", "เเคล้วคลาด" : "ก้าดแก้ว", "เเคล้วคลาด" : "ก้าดแก้ว",
"แคล้วคล่อง" : "แกว่น", "แคะ" : "ขวัก", "โคก" : "โทก", "โคกกระสุน" : "หนามดิน", "โคกกระออม" : "หญ้าแมงหมี่",
"โคคลาน" : "ขมิ้นเครือ", "โคดม" : "โคตมะ", "โคน" : "เค้า", "โค่น" : "ก่น", "โคมเวียน" : "โคมผัด",
"โครงจมูก" : "หมงดัง",
"โครม": "ตึ๊ง", "โครมคราม": "ตึ๊๊งตั๊ก", "โคลง": "คะโลง", "โคลงเคลง": "โงนเงน", "โคลน": "ขี้เปอะ",
"ใคร": "ใผ", "ใคร่ครวญ": "คึดคนิง", "ไคร้หางนาด": "หนอดน้ำ", "ไค้หางหมา": "หาดน้ำ", "คง": "หมั้นคุง",
"คงกระพัน": "ข่ามคง", "คงคาเดือด": "ป้านแถ", "คด": "คด", "คนทรง": "ที่นั่งผี", "คนทา": "ไม้ซี่",
"คนทิสอขาว": "ผีเสื้อน้อย", "คนทิสอดำ": "ผีีเสื้อหลวง", "คนที": "น้ำต้นคันที", "คนทีเหมา": "ถ่านไฟผี", "คนโท": "น้ำต้้นดิน",
"คนธรรพ": "คันธัพพะ", "คนละ": "และคนและเทื่อ", "ค้นหูก": "ค้นหูก", "คบ": "ตามแคร่", "ครรภ์": "คัพภะ",
"ครรโลง": "คะโลง", "ครรไล": "คาไค", "ครวญคราง": "อือคราง", "ครองผ้า": "ที่รงผ้า", "ครองจีวร": "ทงผ้า",
"ครองเพศ": "ทะรงเพศ", "ครองเมือง": "กินเมือง", "ครองสิกขา": "ทะรงสิกขา", "ครองชีพ": "เลี้ยงชีพ", "ครอบ": "ควบ",
"ครอบจักรวาล": "มะกล่องข้าว", "คร่อม": "ควบ", "ครั้ง": "เทื่อ", "ครั้้งคราว": "เทื่อยาม", "ครั้งนั้น": "คราวนั้น",
"ครั้งนี้": "คราวนี้", "ครั้งแรก": "หนที", "ครั้งหลัง": "หนลุน", "ครั้งกระโน้น": "เมื่อก่อนเนิ้น", "ครั้งก่อน": "คราวก่อน",
"ครั่นคร้าม": "หย้านกลัว", "ครั่น": "หย้าน", "ครั่นตัว": "ปวดเมื่อย", "ครั้น": "คัน", "ครัว": "เตาไฟ",
"คราด": "เผือ", "คราม": "ครามห้อม", "คราว": "ซ่ำ", "คร่าว": "กว้าว", "คร่ำครวญ": "ไห้หอนวอนทุกข์",
"คริสต์": "คริสต์", "ครีบ": "กีบ", "ครี": "ผ่างร้าย", "ครึกครื้น": "ม่วนงัน", "ครึกโครม": "ตูมตาม",
"ครึ่ง": "เกิ่ง", "ครึ่งชาติ": "น้ำผ่า", "ครื้ม": "คุ้ม", "ครุ": "น้ำถุ้ง", "ครู่": "บึด",
"คฤห": "คห", "คลอง": "เหมือง","คำ":"กำ",


///////////////////////////////////////////////////////////////////////////////////////////     ฆ
"ฆ้อง": "ก๊อง", "ฆ้องวง": "พาดค้อง", "ฆ้องหม่อง": "ก๊องน้อย", "ฆ้องโหม่ง": "ก๊องโหม้ง", "ฆ้องใหญ่": "ก๊องหลวง",
"ฆ่า": "ข้า", "เฆี่ยน": "บุ๋บ", "โฆษณา": "เอิ่นป่าว",


///////////////////////////////////////////////////////////////////////////////////////////     ง
"งกๆงนๆ": "ดกๆโงนๆ", "งง": "งง", "งด": "ยั้ง", "ง่วง": "ใคร่หลับ", "ง่วงนอน": "เหงาหลับ",
"ง่วน": "หยุ้ง", "งวยงง": "ตกสะกึด", "ง้อ": "อ่อนหา", "ง้องอน": "อ่อนหา", "งอเเง": "ขี้อ้อน",
"งอนไถ": "ง้อนไถ", "งอบ": "กุบ", "งอม": "หง่อม", "ง่อย": "เปลี้ย", "งั่ง": "ง่าว",
"งัด": "พึด", "งัวเงีย": "เหงาหลับ", "งาขาว": "งาม้อน", "งาแซง": "งาม้อน", "งาไซ": "งาม้อน",
"งาน": "การ", "งามฃอน": "เลางาม", "ง่าม": "ง่า", "ง้าว": "งิ้วผ่า", "งิ้ว": "งิ้วสร้อย",
"งุนงง": "ตกสะกึด", "งุ้ม": "ง้ม", "งูก้นกบ": "งูก่านป้อง", "งูขว้างค้อน": "งูค้อนก้อม", "งูเขียว": "งูไส้หมา",
"งูเขียวใบไม้": "งูทับคา", "งูเขียวหางไหม้": "งูหางแห้ม", "งูคอแดง": "งูเพาคอแดง", "งูงวงช้าง": "งูเขียว", "งูจงอาง": "งูจองสะอาง",
"งูทับทาง": "งูทับทาน", "งูปี่แก้ว": "งูจองเเจ้", "งูลายสอ": "งูสิงสร้อย", "งูลายสอใหญ่": "งูสิงหลวง", "งูลายสาบ": "งูจองดาว",
"งูแสงอาทิตย์": "งูฟ้าเหลื้อม", "งูไส้เดือน": "งูดีน", "งูเห่าลาน": "งูเห่าปลวก", "งูเห่าหม้อ": "งูห้อม", "งูบ": "มูบ",
"เงย": "ดหงย", "เงา": "เหง้า", "เงินเชื่อ": "เงินแปะ", "เงินตรา": "เงินถา", "เงินปลีก": "เงินย่อย",
"เงี่ย": "เหงี่ยง", "เงียบ": "ดัก", "เงียบกริบ": "ดักปิ้ง", "เงียบเชียบ": "ดักปิ้งเย็นจ้อย", "เงื้อ": "ยก",
"เงื่องหงอย": "เหงาหงอย", "เงื่อนกระทก": "เงื่อนสะทก", "เงื่อนไข": "ข้อไข", "เงื่อนงำ": "ซ่อนเงื่อน", "เงื้อม": "เงิ้ม",
"เงื้อม": "เงิ้มผา", "แงงอน": "แง่", "โง่": "ง่าว", "โง่เง่า": "ง่าวใบ้ง่าวๆ", "โง้ง": "โว้ง",


//////////////////////////////////////////////////////////////////////////////////////////////     จ
"จง" : "จุ่ง", "จงกรม" : "จงขม", "จงกล" : "จังกอน", "จงกลนี" : "จังกอนแดง", "จด" : "แต้ม",
"จดจำ" : "จื่อจำ", "จตุโลกบาล" : "ท้าวทั้งสี่", "จนกระทั่ง" : "จนถึง", "จน" : "เปียะฮำ", "จนตรอก" : "จนจ็อก",
"จนแต้ม" : "จนจ็อก", "จนมุม" : "จนแจ่ง", "จบ" : "สุด", "จมน้ำ" : "ดิกน้ำ", "จมูก" : "ดัง",
"จรด" : "คุง", "จรดล" : "เตียว", "จรล่ำ" : "จ่ำล่ำ", "จรวด" : "บอกไฟขึ้น", "จระเข้" : "จะเข้",
"จรเข้" : "จะเข้", "จริง" : "แต๊", "จริงจัง" : "แต้ว่า", "จริต" : "สริต", "จลาจล" : "วุ่นวาย",
"จ๊วก" : "จัวะ", "จ้วงจาบ" : "ล่วงล้ำ", "จวน" : "ฮิม", "จวนแจ" : "จ้วนจั้น", "จ่อ" : "จอด",
"จอก" : "กากอก", "จอง" : "หมาย", "จ้อง" : "ผ่อ", "จอแจ" : "อึ๊ดเอ๊า", "จอด" : "ยั้ง",
"จ้อน" : "จ่อน", "จอบ" : "ขอบก", "จ่อม" : "คุ", "จะ" : "หยะ", "จ๊ะ" : "เจ้า",
"จะกละ" : "ต๋ายกะ", "จะกวด" : "แลน", "จะงอย" : "หงอน", "จักจี้" : "เดียม", "จักรพรรดิ" : "จักกวัตติ",
"จักรวาลฟ้าครอบ" : "ตันกล่องข้าว", "จัญไร" : "เสื่อม", "จัด" : "แก่", "จัดจ้าน" : "ปากม้า", "จั่น" : "กะท้ำ",
"จน" : "ปี้จั่น", "จันทร์แดง" : "จันทน์ผา", "จันทรคราส" : "จะคาดทือเดือน", "จั่นหับ" : "หับ", "จับ" : "ยับ",
"จับจด" : "เหลาะแหละ", "จับเจ่า" : "จกโจ่", "จับพลัดจับผลู" : "ตำผึงตำผัง", "จับยาม" : "ดูเมื่อ", "จับจ่าย" : "จกจ่าย",
"จับไข้" : "เมื่อย", "จับด้าย" : "ว้นฝ้าย", "จับฉ่าย" : "คล้ายแกงแค", "จ่า" : "จ่า", "จ่าหน้า" : "ขึ้นต้น",
"จ๋า" : "เจ้า", "จาก" : "ลุก", "จาตุรทิศ" : "จตุทิสสะ", "จามร" : "พัดพ้าวจามร", "จามจุรี" : "ช้าขาม",
"ซึก" : "ช้าขาม", "จาระไน" : "ไขแจ้ง", "จารีตร" : "ฮีต", "จามจุรีป่า" : "กาง", "จารึก" : "จารืก",
"จ้าละหวั่น" : "วุ่นวาย", "จำ" : "จ่ำ", "จำคุก" : "ขังคอก", "จำปาป่า" : "จำปาป่า", "จำพรรษา" : "จำวัสสา",
"จำวัด" : "นอนหลับ", "จำเดิม" : "แรกเริ่ม", "จำนำ" : "ขัน", "จำนอง" : "ขัน", "จำกัด" : "เป็นมอก",
"จำเจ" : "สะลวด", "จำนง" : "มักใคร่", "จำนรรจา" : "เจียรจา", "จำนำพรรษา" : "จำวัสสา", "จำบัง" : "หายตัว",
"จำปีป่า" : "บุญทา", "จำแลง" : "ตะแหลง", "จำหลัก" : "ขวัก", "จิ้งจก" : "จั๊กกิ้ม", "จิงจ้อ" : "จีจ้อ",
"จิ้งหรีด" : "จี้ฮีต", "จิ้งหรีดโกร่ง" : "จิ้กุ้ง", "จิตกาธาร" : "กองฟอน", "จิ้งเหลน" : "จั๊กเล้อ", "จิ๋ว" : "หนิ้ว",
"จีวร" : "จีวร", "จึง" : "จีง", "จืด" : "จาง", "จุก" : "แกน", "จุกๆจิกๆ" : "จ็อกแจ็ก",
"จุกชี" : "แท่นแก้ว", "จุกนารี" : "อ้าหลวง", "จุกโรหินี" : "กล้วยไม้", "จุกเสียด" : "จุกเสียบ", "จุดไฟ" : "ติดไฟ",
"จุ่น" : "ลิงลม", "จุ้นจ้าน" : "วุ่นวาย", "จุ๋นจู๋" : "กิดดิด", "จุลศักราช" : "สักคาด", "จู่" : "จู่ลู่",
"จู้" : "อิ้ว", "จูบ" : "ซุ้ย", "เจดีย์" : "ธาตุ", "เจ๊ง" : "จอด", "เจตพังคี" : "เป้าเงิน",
"เจตมูลเพลิง" : "พิดพิวแดง", "เจน" : "เลี่ยน", "เจรจา" : "ฟู่", "เจริญ" : "จำเริญ", "เจ่อ" : "เว่อ",
"เจอะ" : "ปะ", "เจ่าจุก" : "จกมก", "เจ้า" : "ผี", "เจ้าข้า" : "ข้าเจ้า", "เจ้าคะ" : "เจ้า",
"เจ้าขุนมูลนาย" : "ท้าวขุนมูลนาย", "เจ้าผู้ครองนคร" : "เจ้าหลวง", "เจ้าภาพ" : "เจ้าการ", "เจ้าอาวาส" : "ตุ๊หลวง",
"เจาะ" : "บ่อง", "เจิง" : "เลอ", "เจียน" : "ฮิม", "เจียวไข่" : "ป่ามไข่", "เจือ" : "สูน",
"เจื่อน" : "เย่", "แจ๋" : "เป้อเหล้อ", "แจก" : "ปัน", "แจกัน" : "หม้อดอก", "โจก" : "โป่",
"โจงกระเบน" : "เหน็บเตี่ยว", "โจน" : "โสน", "โจษจัน" : "เล่าลือ", "ใจแคบ" : "ใจกีด", "ใจเฉื่อย" : "ใจจ้า",
"ใจจืด" : "ใจกีด", "ใจชื้น" : "ใจเย็น", "ใจดำ" : "ใจกีด", "ใจดำอำมะหิต" : "ใจดำ", "ใจโต" : "ใจใหญ่",
"ใจป้ำ" : "ใจกล้า", "ใจเพชร" : "ใจแข็ง", "ใจไม้ไส้ระกำ" : "ใจกีด", "ใจร้าย" : "ใจดำ", "ใจเสาะ" : "ขี้แอ่",


//////////////////////////////////////////////////////////////////////////////////////////////        ฉ
"ฉกรรจ์":"ลำสะกัน", "ฉกษัตริย์":"สักขัตติย์", "ฉงน":"สังกา", "ฉนวน":"พันชั้น", "ฉบับ":"จะบับ",
"ฉมวก":"เหลม", "ฉมัง":"หมาน", "ฉลอง":"จะหลอง", "ฉลัก":"ขวัก", "ฉลาด":"หล็วก",
"ฉลุ":"ต้อง", "ฉวย":"คว้า", "ฉ้อฉล":"ขี้ฉ้อ", "ฉ่อย":"จ๊อบ", "ฉอเลาะ":"ออเซาะ",
"ฉะฉาน":"เผาะผ่อย", "ฉนั้น":"จะอั้น", "ฉะนี้":"จะอี้", "ฉัตร":"พระยาลืมวัง", "ฉัน":"เฮา",
"ฉาบ":"สว่า", "ฉิบหาย":"สิบหาย", "ฉิว":"หมิ้ง", "ฉีกหน้า":"หักหน้า", "ฉีดยา":"แทงยา",
"ฉุกเฉิน":"ฮ้อนฮ้าย", "ฉุน":"ขื่น", "ฉุนเฉียว":"ขี้เคียด", "ฉุย":"สุ่ย", "ฉุดฉาด":"บาดหูบาดต๋า",
"เฉดหัว":"ยู้หัว", "เฉพาะ":"คิ่น", "เฉลว":"ตาเหลว", "เฉลียวใจ":"อิกขะหลิกใจ", "เฉวียงบ่า":"สว้าน",
"เฉอะแฉะ":"เชอะแชะ", "เฉา":"เหี่ยว", "เฉียง":"แจ่ง", "เฉียงพร้าดำ":"เกียงภาดำ", "เฉียงพร้านางแอ":"เกียงภานางแอ",
"เฉียงพร้ามอญ":"เกียงภามอญ", "เฉียด":"ซวาด", "เฉือน":"เถือ", "แฉ":"แผ่", "แฉลบ":"ถะแหล็ด",
"แฉล้ม":"สะแล้ม", "แฉะ":"เพอะ", "โฉ่":"ฟุ้ง", "โฉบ":"ยว่าม", "ไฉน":"จะใด",
"ฉะอ้อน":"อ้อน", "ฉาด":"ป้าบ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ช
"ชก":"จก", "ชงโค":"หูกวางป่า", "ชงโคนา":"เสี้ยว", "ชดเชย":"ส้าย", "ชฎา":"ขะโจม",
"ชนะ":"ชนะ", "ชนัก":"แหลน", "ชนาง":"สะหล้อ", "ชบา":"ดอกใหม่", "ชมนาด":"หญ้าช้างย้อย",
"ชมนาดฝรั่ง":"อ้มสาย", "ชมพูทวีป":"ชุมพูทีป", "ชมพู่":"บ่ะชมพู่", "ชม้อย":"ม้อย", "ชมพู่น้ำ":"บ่ะสมุทร",
"ชมพู่น้ำดอกไม้":"บ่ะน้ำหอม", "ชราบ":"ซราบ", "ช่วง":"เช่น", "ช่วงใช้":"ช่องใช้", "ชวย":"ชอย",
"ช้องระอา":"จองสะอา", "ช้องนาง":"รางจือ", "ชอบกล":"งืด", "ช้อน":"ชอน", "ชะอุ้ม":"อุ่มฮุ่ม",
"ชะง่อน":"ง่อน", "ชะงัก":"หยุดลง", "ชะง้ำ":"ง้ำ", "ชะงุ้ม":"ง้ม", "ชะเง้อ":"เหง้อ",
"ชะเงื้อม":"เงิ้ม", "ชะแง้":"แหงน", "ชะโงก":"หยื้อ", "ชะตา":"ชาตา", "ชะนี":"อี่ฮุย",
"ชะเนาะ":"ไม้ลูกเค้น", "ชะมด":"อัม", "ชะมดเช็ด":"เห็มอ้ม", "ชะมดเชียง":"คู้", "ชะรอย":"รอยว่า",
"ชะลอ":"ค้าย", "ชะลอม":"ซ้าลอม", "ชะลูด":"ชูดลูด", "ชะแลง":"เหล็กงัด", "ชะโลม":"ฮม",
"ชะอม":"ผักหละ", "ชะเอม":"เครือเขาขม", "ชะเอมไทย":"ส้มป่อยหวาน", "ชะวาก":"สรอก", "ชักเย่อ":"ชักส้าว",
"ชัด":"ถอบ", "ชัดเจน":"จัดเจน", "ชันนะตุ":"ชันตุ", "ชันโรง":"ตังนี", "ชัยพฤกษ์":"ลมแล้ง",
"ชัยเภรี":"กลองชัย", "ช่าง":"สล่า", "ช้างดำ":"เอื้องทกโท", "ช่างกระไร":"อะหยัง", "ชาขอย":"ช้าข่อย",
"ช้างพัง":"ช้างแม่", "ช้างพลาย":"ช้างปู้", "ช้างหนี":"ช้างปล้น", "ช้างงวง":"ช้างดอ", "ช้างตกมัน":"ช้างย้อย",
"ช้างผะชด":"ช้างต่อ", "ช้าช่อม":"ชะช่อน", "ช่างพูด":"ช่างฟู่", "ชาด":"หาง", "ชาดหรคุณ":"หอระคุณ",
"ชาด":"ขี้", "ช้าพลู":"พลูนก", "ชายผ้าสีดา":"ตองห่อข้าวย่าบา", "ชายโสด":"บ่าว", "ชาย":"ช้าย",
"ช้าเลือด":"ผักปู่ย่า", "ช้าหมอง":"ต้นป่าช้าหนอง", "ชายกระเบน":"หางเตี่ยว", "ชายเฟือย":"เผือยไม้", "ชำ":"บง",
"ช่ำชอง":"แกว่น", "ชำนาญ":"แกว่น", "ชำมะนาด":"หญ้าช้างย้อย", "ชำร่วย":"ฮอม", "ชำรุด":"หลุพัง",
"ชำเลือง":"ช้าย", "ชำแหละ":"คัว", "ชิง":"ลู่", "ชิงชัน":"เกล็ดแดง", "ชิงช้า":"จุ๊งจ้า",
"ชิงช้าวาลี":"ชุ้งช้าลิง", "ชิงซี่":"ชี่", "ชิชิ":"คำ", "ชิด":"แหมะ", "ชิน":"เคย",
"ชิ้น":"ติ่น", "ชิมลาง":"ลองเชิง", "ชี":"แม่ขาว", "ชื้น":"ชุ้ม", "ชุก":"ซุม",
"ชีผ้าขาว":"แมงคัน", "ชืด":"จาง", "ชุกชี่":"แท่นแก้ว", "ชุด":"หมื้อ", "ชุน":"ฝง",
"ชุบย้อม":"ย้อมแปลง", "ชุบสรง":"ผ้าอาบ", "ชุบอาบ":"ผ้าอาบ", "ชุม":"ซุม", "ชุมนุม":"สุม",
"ชุมรุม":"ปาง", "ชุมเห็ดเทศ":"หลับมืนหลวง", "ชุมเห็ดไทย":"หลับมืนน้อย", "ชูมือ":"เยอมือ", "เช่น":"อย่างว่า",
"เชลียง":"สะเลียง", "เช่าพระ":"ปูชาพระเจ้า", "เช้าตรู่":"เช้ามืด", "เชิง":"ตี๋น", "เชิงเทียน":"ค้างเทียน",
"เชิงกราน":"เคียงไฟ", "เชิงกลอน":"กลอน", "เชิงเทิง":"ม่อนเทิง", "เชิงตะกอน":"กองฟอน", "เชื้อเชิญ":"ชักเชิญ",
"เชี่ยนหมาก":"ขันหมาก", "เชื่อ":"จึก", "เชื้อสาย":"เชื้อ", "เชือก":"เจือก", "เชื่อง":"คุ้น",
"เชือด":"ปาด", "เชื่อม":"จอด", "แช่อิ่ม":"ดองหล้ม", "โชคดี":"หมาน", "โชงโลง":"โช่น",
"โชน":"โจ้", "ใช่":"แม่น", "โชน":"กูดทิศ", "ใช้":"ใจ้", "ไช":"จี",
"โชว์":"เปียะ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ซ
"ซด":"หีบ","ซน":"ฮ้าย","ซบ":"มูบ","ซวดเซ":"ซะเล","ซวดทรง":"ฮั่ง",
"ซวนเซ":"ซะเล","ซวย":"แกน","ซอ":"สีทะร้อ","ซอก":"สรอก","ซอกแซก":"สอด",
"ซอน":"หยด","ซ่อน":"บ่ม","ซ้อง":"ส้อง","ซ่อนกลิ่น":"มะลิลา","ซ่อมแซม":"ส้อมแซม",
"ซอย":"หน้อย","ซอมซ่อ":"ซ่อย่อ","ซักซร้าว":"ซะซ้าว","ซักส้าว":"ซักส้าว","ซัง":"ตอ",
"ซัด":"มะซัก","ซัดเซ":"ระเหระหน","ซา":"วะ","ซาง":"เหียง","ซ้ำ":"ลื้ม",
"ซ้ำซาก":"ลื้ื้มเก่าลื้มใหม่","ซาวเสียง":"ซ่าว","ซิ":"แล่","ซี":"แล่","ซี่":"สี้",
"ซี่โครง":"ดูกสี้ข้าง","ซีก":"โขบ","ซีด":"เผิด","ซึก":"ช้าขาม","ซึ่ง":"เซิ่ง",
"ซึ้ง":"แล่บ","ซุกซน":"ฮ้ายด้าน","ซุง":"ธุง","ซุ่ม":"ผก","ซุ้ม":"โขง",
"ซุ่มซ่าม":"เหล้อๆเซอๆ","ซุย":"พุ่ย","ซู":"เยือก","ซูบ":"เผิด","เซ":"ซะเล",
"เซงแซ่":"จ๊อก","เซ่น":"เลี้ยง","เซ่อ":"ง่าว","เซ่อเชอะ":"ง่าวใบ้","เซิง":"เฮิง",
"เซื่อง":"ทุ่น","แซ่":"ซ้าว","แซะ":"แสะ","โซ่":"โส้","โซม":"คุ",
"ไซร้":"ไสร้",



///////////////////////////////////////////////////////////////////////////////////////////////////// ฌ
"ฌาน":"ซาน",


///////////////////////////////////////////////////////////////////////////////////////////////////// ญ
"ญวน":"แถว", "ญาติ":"ยาด", "ญาติดี":"ดีฮ่อกัน",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฎ
"ฎีกา":"ฎีกา",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฐ
"ฐาน":"แท่น","ฐานสิงห์":"ตีนสิงห์","ฐานันดร":"ฐานันตะระ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฒ
"เฒ่า":"แก่","เฒ่าแก่":"เถ้าแก่",


///////////////////////////////////////////////////////////////////////////////////////////////////// ณ
"เณร":"พระหน้อย",


///////////////////////////////////////////////////////////////////////////////////////////////////// ด
"ดงดึก":"ดงเลิ้ก","ดนตรี":"นนถี","ด้วงดิน":"มะขี้เบ้า","ด้วงมะพร้าว":"กว่างป้าว","ด่วน":"ฟั่ง",
"ด้วย":"ทวย","ด้วยว่า":"เผื่อว่า","ดอกจอก":"ย่อ","ดอกดิน":"ดอกก้าน","ดอกทอง":"สำเพ็ง",
"ดอกเบี้ย":"ขี้ดอก","ดอกไม้พุ่ม":"บอกไฟเทียน","ดอกไม้เพลิง":"บอกไฟ","ดอกไม้ไหว":"คำแฮ","ดอก":"ดอก",
"ดอดเข้า":"แอบ","ดอย":"ทอย","ดัก":"เกิ้ด","ดักดาน":"ดึกดักหักขำ","ดักแด้":"ชู้",
"ดั่งนั้น":"หยั่งอั้น","ดั่งนี้":"หยั่งอี้","ดั่งหนึ่ง":"เหมือนหนึ่ง","ดั้ง":"เสาดั้ง","ดั้งเดิม":"มะเก่า",
"ดัดจริต":"เยียะสริต","ดัน":"ยู้","ดันทุรัง":"ดึงดัน","ดาดาษ":"ดาสเต็ม","ดาก":"ตาด",
"ด่าง":"โก้ง","ด่างพร้อย":"ปิ้วเเมง","ดาดปูน":"ลาดปูน","ด่าน":"อ่าย","ด้าน":"พ่าง",
"ดายหญ้า":"เผื้ยวหญ้า","ด้าย":"ฝ้าย","ดาวกระจาย":"คำแพ","ดาวเรืองพม่า":"คำแพ","ดาวงอนไถ":"ดาวง้อนไถ",
"ดาวดึงส์":"ดาวติงสา","ดาวประกายพฤกษ์":"ดาวผาคอง","ดาวเรือง":"ดอกคำปู้จู้","ดาวลูกไก่":"ดาววี","ดาวหมู":"ดาวหมูคอง",
"ดาวหาง":"ดาวควัน","ดำนา":"ปลูกข้าว","ดำดง":"ดำดง","ดำรง":"ทำรง","ดำริ":"คึดไว้",
"ดิง":"มะกุ๊น","ดินดำ":"เฝ่า","ดินประสิว":"ดินไฟ","ดินสอดำ":"ปิด","ดีขึ้น":"ยังเเควน",
"ดีงูต้น":"มะคอมขม","ดีแท้":"ดีแต้","ดีฉัน":"ข้าเจ้า","ดิฉัน":"ข้าเจ้า","ดีดขัน":"แมงคอลัน",
"ดิถี":"ติตถี","ดินดาน":"ดินดาก","ดินสอพอง":"ดินสอฟอง","ดีนาคราช":"ดีงู","ดึก":"เดิ้ก",
"ดึกดำบรรพ์":"เก่าเกื้อ","ดื่น":"เป่อเลอะ","ดื่ม":"ดื่ม","ดุ":"สวก","ดุร้าย":"ดุฮ้าย",
"ดุจ":"ดูดั่ง","ดุด":"บุ่น","ดุม":"มะต่อม","ดุษณีภาพ":"ตุณหิภาวะ","ดุเหว่า":"กะเวา",
"ดู":"ผ่อ","ดูกร":"ผ่อก่อน","ดูก่อน":"ผ่อก่อน","ดูแคลน":"ดูแควน","ดูดาย":"ผ่อดอมดาย",
"ดูดู๋":"ผ่อลุ","ดูลูก":"ดูแควน","ดูแนะ":"ผ่อแล่","ดูเหมือน":"เหมือนหยั่ง","เด็ก":"ละอ่อน",
"เด็กชาย":"เด็กจาย","ดูหมอ":"ดูเมื่อ","เดโช":"เตโช","เดน":"ซาก","เด่น":"ป้อย",
"เดาะ":"เดียะ","เดิน":"เตียว","เดียร์ถีย์":"อัญญติตถีย์","เดี๋ยว":"กำเดียว","เดี๋ยวนี้":"มะเดี๋ยวนี้",
"เดือนขาด":"ดับหน","เดือนฉาย":"บานเดือน","เดือนขึ้น":"เดือนออก","เดือนเพ็ญ":"เดือนเพ็ง","เดือนหงาย":"เดือนเเจ้ง",
"เดือยไก่":"พริกก้นชี้","แดกห่า":"ฮากเลือด","โด่ไม่รู้ล้ม":"หนาดพา","โดด":"โจน","โดน":"ต๋ำ",
"โดย":"ตวย",


///////////////////////////////////////////////////////////////////////////////////////////////////// ต
"ตกกระ" : "ตกขะ", "ตกกล้า" : "หว่านกล้า", "ตกค้าง" : "เคิ้น", "ตกตลึง" : "ตกสะกึด", "ตกเบ็ด" : "จ่อมเบ็ด",
"ตกประหม่า" : "ตกคะพ่า", "ตกมัน" : "ย้อย", "ตกลูก" : "ออกลูก", "ตกอับตกจน" : "ตกทุกข์ได้ยาก", "ตถาคต" : "ตถาคตะ",
"ต้น" : "เค้า", "ต้นน้ำ" : "ขุนน้ำ", "ต้นคิด" : "ต้นคึด", "ตม" : "เปอะ", "ตรง" : "ทัด",
"ตรงกับ" : "พร่ำว่า", "ตรวน" : "โส้", "ตรอก" : "คอง", "ตรอง" : "คึดกอง", "ตระ" : "ถะ",
"ตระกูล" : "ขะกูล", "ตระเตรียม" : "แต่งดา", "ตระแบก" : "เปือย", "ตระแบกขาว" : "เปือยสะแอน", "ตระแบกแดง" : "เปือยเลือด",
"ตระแบกเลือด" : "เปือยเลือด", "ตระพัง" : "ถระพังสอด", "ตระเวน" : "สอดไป", "ตระหง่าน" : "ต่านง่าน", "ตระหนี่" : "ขี้จิ",
"ตรา" : "ต๋า", "ตรากตรำ" : "บุกบัน", "ตราบเท่า" : "ตราบต่อเท้า", "ตรี" : "ตี", "ตรึง" : "เขิง",
"ตรุ" : "ถุ", "ตรุษ" : "ปีใหม่", "ตรุษจีน" : "เครือออน", "ตรู่" : "เช้ามืด", "ตลก" : "ต๋าหลก",
"ตลบแตลง" : "ตะแหลง", "ตลับ" : "แอ็บ", "อับ" : "แอ็บ", "ตลอด" : "เสี้ยง", "ตลาด" : "กาด",
"ตลาดสด" : "กาดหมั้ว", "ตลึง" : "สลั้ง", "ตวัด" : "สะวัด", "ตวาด" : "เอ็ก", "ตอหม้อ" : "เส้าป็อก",
"ตะกู" : "ทุ่มเตน", "ตะโกนา" : "มะโกนา", "ตะโกบ้าน" : "มะโกนา", "ตะโกน" : "เอิ้น", "ตะไกร" : "มีดยับ",
"ตะขบ" : "มะเกวน", "ตะขบฝรั่ง" : "มะตากบ", "ตะขาบ" : "จั๊กเข้บ", "ตะขิตตะขวง" : "เดียม", "ตะคร้อ" : "มะเคาะ",
"ตะครั่นตะครอ" : "ปวดๆเมื่อยๆ", "ตะคร้ำ" : "ไม้ค้ำ", "ตะคว้ำ" : "หวีด", "ตะคริว" : "เกี่ยว", "ตะครุบ" : "คุบ",
"ตกกละ" : "กะ", "ตะกวด" : "แลน", "ตะกละตะกลาม" : "ตายกะตายกลั้น", "ตะกอ" : "เขา", "ตะกั่ว" : "ชืน",
"ตะกัง" : "เบ็ดพวง", "ตะกาย" : "เปี่ยง", "ตะกุย" : "ยาด", "ตะกุกตะกัก" : "กุกๆกักๆ", "ตะเกียง" : "ผังน้ำมัน",
"ตะเกียบ" : "ไม้ถู่", "ตะเกียกตะกาย" : "กลิ้งเกลือก", "ตะแกรง" : "เหิง", "ตอก" : "จด", "ต้อง" : "ถ้า",
"ตอด" : "เดีอด", "ตอน" : "เมื่อ", "ตอบ" : "ตอบ", "ตอบเเตบ" : "มะปอบแปบ", "ต่อย" : "ตี๋",
"ต้อยติ่ง" : "ผักดีด", "ต่อว่า" : "ว่าต่อ", "ต่อไส้" : "เพียะฟาน", "ตะกร้อ" : "มะต้อ", "ตะกร้า" : "ซ้า",
"ตะกรุด" : "ยันต์", "ตอนเย็น" : "เมื่อแลง", "ตอนกลางคืน" : "เมื่อคืน", "ตะคอก" : "เอ็ก", "ตะค้า" : "หวายหอม",
"ตะคุ่ม" : "จะคุ่ม", "ตะเครียว" : "ถุงแหตะเครียว", "ตะเคียนหนู" : "ไม้เหว", "ตะเเคง" : "สะแกง", "ตะไคร่" : "ไคคู่",
"ตะไคร้" : "จั๊๊กไคร", "ตะไคร้ต้น" : "พูต้น", "ข่าตัน" : "พูต้น", "ตะไคร้น้ำ" : "ไคร้น้ำ", "ตะไคร้บก" : "ไคร้บก",
"ตะไคร้หอม" : "ไคร้หอม", "ตะไคร้หางนาค" : "ไคร้หางนาค", "ตะนอย" : "ลิ้นทอง", "ตะบอง" : "ค้อนก้อม", "ตะบองเพชร" : "เขียะลิ้นหมา",
"ตะบัน" : "บอกบัน", "ตะบันไฟ" : "บัดไฟ", "ตะบึง" : "บึ่ง", "ตะเบง" : "เบ่ง", "ตะไบ" : "สะไบ",
"ตะปุ่มตะป่ำ" : "ปุ่มป่ำ", "ตะปู" : "เหล็กกล", "ตะพด" : "ไม้ค้อน", "ตะพานหนู" : "ยาง", "ตะพาบน้ำ" : "ปลาฝา",
"ตะพึดตะพือ" : "ตำผึงตำผัง", "ตะเพิด" : "เหิบ", "ตะโพก" : "ตะค่าม", "ตะโพน" : "กลองทึง", "ตะมอย" : "ผ้ำ",
"ตะรังตังกวาง" : "มะเหนียง", "ตะรังตังช้าง" : "หานช้างร้อง", "ตะราง" : "คอก", "ตะล่อม" : "จ้อม", "ตะล่อมข้าว" : "ปุ่มข้าว",
"ตะลิตะลาน" : "ฟั่งฟ้าว", "ตะลึง" : "สลั้ง", "ตะลุ่ม" : "ตะล่อม", "ตะลุ่มนก" : "น้ำนอง", "ตะลุมบอน" : "รุม",
"ตะลูมพุก" : "สาก", "ตะลุย" : "ลุยดา", "ตะเเลงแกง" : "ตะแลงแกง", "ตะไล" : "บอกไฟจักจ่า", "ตะวัน" : "ตาวัน",
"ตระวาน" : "หญ้าหางโหว้", "ตะเวน" : "สอดล่า", "ตระเวน" : "สอดล่า", "ตักเตือน" : "ปกเติน", "ตั๊กแตน" : "จั๊กแตน",
"ตักบาตร" : "ใส่บาตร", "ตัง" : "ตึ๊ง", "ตั้งครรภ์" : "ตั้งท้อง", "ตั้งต้น" : "ตั้งเค้า", "ตั้งโอ๋" : "ตังโอ",
"ตัง": "ตึ๊ง", "ตั้งครรภ์": "ตั้งท้อง", "ตั้งต้น": "ตั้งเค้า", "ตั้งโอ๋": "ตังโอ", "ตัด": "กก",
"ตัดถนน": "ตัดตาง", "ตัดเต้า": "พ้านลอ", "ตัดเพ้อ": "ต่อว่า", "ตันหยง": "ดอกแก้ว", "ตัวผู้": "ตัวพู้",
"ตัวเมีย": "ตัวแม่", "ตัวอย่าง": "แบบ", "ตั้วโผ": "ตัวโป่", "ตัวเกง": "ตัวหมาย", "ตาทวด": "พ่อหม่อน",
"ตาข่าย": "ห่าย", "ตาตุ่ม": "ต๋าตี๋น", "ตาถั่ว": "ตาจาว", "ตาบอดตาใส": "ตาใส", "ตาปีตาชาติ": "ทังปีทังชาติ",
"ตาเสือ": "มะอ้า", "ตาง": "ตาง", "ต่าง": "ต่าง", "ตาตุ่มบก": "ค่างกวม", "ต่างหู": "ลานหู",
"ตานดำ": "มะถ่านไฟผี", "ตานเสี้ยน": "หาด", "ตานขโมย": "ทรางก้นเหี่ยว", "ตานหม่อน": "หวดหม่อน", "ต่าน": "ขวา",
"ตาม": "ตวย", "ตามที": "ช่างมัน", "ตามมีตามเกิด": "ตามแต่อันมี", "ตายคืน": "ตายลืม", "ตายทั้งกลม": "ตายกลม",
"ตายห่า": "ตายฮ่า", "เรียก": "ฮ้อง", "แทง": "ปัก", "ตำลึงทอง": "เครือเขาขมน้อย", "ต่ำ": "แต่ม",
"ตำแยช้าง": "หานช้างร้อง", "ตาลปัตรฤษี": "บัวบก", "ตำแย": "หานไก่", "ตำแยแมว": "หานไก่ตัวพู้", "ตำแยตัวผู้": "หานไก่ตัวพู้",
"ตำรวจ": "ต๋ำนวด", "ตำรับ": "ผักแคบ", "ตำหนิ": "ป้าว", "ตำหนิติเตียน": "อหิติเตียน", "ติ่งหาย": "ติ่งหาย",
"ติดไฟ": "ดังไฟ", "ติดจะบ้า": "สึ่งตึง", "ติดสอยห้อยตาม": "ติดต้อยห้อยตาม", "ติดอ่าง": "ปากคัก", "ติเตียน": "นินทา",
"ติเตียนนินทา": "เล่าหน้าจาขวัญ", "ตี": "บุบ", "ตีไก่": "ชนไก่", "ตีขลุม": "ตีกิน", "ตีคอ": "จาพอ",
"ตีแปลง": "เกลือกบวก", "ตีแผ่": "ตีแบ", "ตีโพยตีพาย": "โวยๆวายๆ", "ตีลังกา": "ปิ้นจะหลิ้น", "ตีเสมอ": "เทียม",
"ตีหน้า": "แปลงหน้า", "ตี่": "ตี้", "ตีนตุ๊กแก": "หญ้าหูควาก", "ตีนนก": "กาสามปีก", "ตีนนกยูง": "กูดช้อง",
"ตีนเเรต": "ตีนเเรต", "ตึก": "ตึ๊ก", "ตึง": "เคร่ง", "พยาธิติกลม": "ตืดกลม", "พยาธิแบน": "ตืดแพบ",
"ตื้อ": "ตื้อ", "ตุ๊": "อุตุ", "ตุ๊กแก": "ต๊กโต", "ตุง": "ดู้ง", "ตุมกา": "มะตึ่ง",
"ตุ่มมังกร": "ไหลายลวง", "ตุ้มหู": "ต๊อกหู", "ตุหรัดตุเหร่": "ระเวเหหน", "ตูด": "ก้น", "ตูดหมูตูดหมา": "หญ้าตดหมา",
"ตูม": "จี", "เต็ง": "แงะ", "เต็งรัง": "ไม้เปา", "เต็งหนาม": "เปาหนาม", "เต้นรำ": "ฟ้อนรำ",
"เต็มตื้น": "ตื้นตัน", "เต็มที่": "นักแก", "เตย": "เกียง", "เตยหลวง": "เกียงหลวง", "เตร่": "สอด",
"เตรียม": "ดา", "เตลิดเปิดเปิง": "เปิด", "เตะ": "เตะ", "เต่าทอง": "เต่าคำ", "เต๋า": "มะแก่ว",
"เตร็ดเตร่": "เลิง", "เต่าร้าง": "เขียง", "เติบโต": "ขึ้นใหญ่", "เติม": "เติ่ม", "เตี้ย": "ต่ำ",
"เตียง": "ชอง", "เตียน": "เตียน", "เตือน": "เติน", "แตงกวา": "บ่แต๋ง", "แตงไทย": "บ่ะแต๋งแลง",
"แตงโม": "บ่ะเต้า", "แตงร้าน": "บ่ะเเต๋งซั้ง", "แตงอ่อน": "บ่ะแต๋งหน่อม", "แตงป่า": "บ่ะแต๋งยาง", "แตงไร่": "บ่ะเเต๋งจีง",
"แต่งงาน": "กินเเขก", "แตร": "แน", "แต้ว": "ติ้วเลือด", "โตก": "ขันโตก", "ไต้": "ข้าย้า",
"ใต้ถุน": "พื้น", "ไตรจีวร": "ผ้าไตร", "โต้ตอบ": "ตอบถ้อย", "ไตรปิฎก": "ไตรปิฎกะ",



///////////////////////////////////////////////////////////////////////////////////////////////////// ถ
"ถก" : "โจเอ", "ถกเขมร" : "เค็ดม่ำ", "ถด" : "ขด", "ถนน" : "หนทาง", "ถนอม" : "ตอม",  
"ถนัด" : "ช่าง", "ถนิม" : "เครื่องหย้อง", "ถนิมอาภรณ์" : "เครื่องหย้องของประดับ", "ถมปัด" : "ลายน้ำคาบ", "ถมไป" : "เป่อเล้อ",  
"ถลก" : "เฮ้น", "ถลกบาตร" : "ถงบาตร", "ถมึงทึง" : "มึกคึก", "ถลกปอ" : "ลึบปอ", "ถล่ม" : "หล่ม",  
"ถลอก" : "เถอะ", "ถลัน" : "หลัน", "ถลา" : "ซูด", "ถลำ" : "วำ", "ถลึงตา" : "เขิงตา",  
"ถลุง" : "หุง", "ถ่วง" : "หน่วง", "ถวาย" : "ขวาย", "ถ้วยแก้ว" : "จอกแก้ว", "ถอก" : "ลอก",  
"ถอง" : "ทั่ง", "ถอน" : "หลก", "ถ่อน" : "ส่วน", "ถอนคำ" : "ขืนคำ", "ถอนเสนียด" : "ถอดขืด",  
"ถอบแถบ" : "มะปอบแปบ", "ถอบแถบเครือ" : "ขางแดง", "ถอย" : "ถอย", "ถอยหลังเข้าคลอง" : "เอาฮีตเก่า", "ถ้อยที" : "ต่างคน",  
"ถัง" : "น้ำคุ", "ถังมังกร" : "ไหลายลวง", "ถัด" : "แถ็ด", "ถัว" : "เกื้อ", "ถั่วกระด้าง" : "มะถั่ว",  
"ถั่วเขียว" : "มะถั่วถิม", "ถั่วคิ้วนาง" : "มะถั่วผี", "ถั่วแดง" : "ถั่วแป", "ถั่วตายยาก" : "มะถั่วแระ", "ถั่วฝักพร้า" : "มะถั่วแปบพร้าโต้",  
"ถั่วนก" : "มะถั่วไฟ", "ถั่วฝักยาว" : "มะถั่วยาว", "ถั่วยะสง" : "มะถั่วดิน", "ถั่วลันเตา" : "มะถั่วลันเตา", "ถั่ว" : "มะถั่ว",  
"ถั่วแดง" : "มะถั่วแปบ", "ถั่วผี" : "มะถั่วแปบ", "ถั่วราชมาศ" : "มะบอย", "ถั่วแขก" : "ถั่่วฝรั่ง", "ถ้า" : "คันว่า",  
"ถาง" : "ถะ", "ถาน" : "วำิด", "ถ่ายรูป" : "ถ่ายหูบ", "ถาดทอง" : "ตะไหลคำ", "ถ่ายปัสสวะ" : "เยี่ยว",  
"ฉี่" : "เยี่ยว", "ถ่ายอุจจาระ" : "ขี้", "ถีบ" : "ตั่ง", "ถึก" : "เถิ้ก", "ถึง" : "เถิ้ง",  
"ถึงกัน" : "เถิงกัน", "ถึงคราวจะได้" : "พอพล้างได้", "ถึงที่" : "จูตี้", "ถึงว่า" : "เติงว่า", "ถือ" : "ก่ำ",  
"ถือศีล" : "จำศีล", "ถือดี" : "อวดดี", "ถือปูน" : "โบกปูน", "ถือยศ" : "ไว้ยศ", "ถือสา" : "ถือทือ",  
"ถุง" : "ถง", "ถุงเท้า" : "ถงเท้า", "ถุงตะเครียว" : "ถงคะชา", "ถุย" : "ทุย", "ถู" : "ถู",  
"ถูกกระทำ" : "ถูกแป๋ง", "ถูกแกล้ง" : "ถูกแข้ง", "ถูกคุณ" : "ถูกตู้", "ถูกแท้" : "แม่นแต้", "ถูกแล้ว" : "แม่นเเล้ว",  
"ถูลู่ถูกัง" : "ถูไถ", "เถลไถล" : "หล็อบแหล็บ", "เถลิก" : "เถิก", "เถลิกศก" : "เถลิกศก", "เถอะ" : "เตอะ",  
"เถาคันแดง" : "หญ้าปกตอ", "เถ้า" : "ขี้้เท่า", "เถาย่านาง" : "ช้อยนาง", "เถาพันซ้าย" : "เครือเขาคู้", "เถาอีโม้" : "เครือเจน",  
"เถาวัลย์" : "เครือเขา", "เถาวัลย์เปรียง" : "เครือค้องแถบ", "เถาวัลย์ปูน" : "เครือเขาปูน", "เถาเอนอ่อน" : "ตีนเป็ดเครือ", "เถิดเทิง" : "กลองแอว",  
"แถม" : "เติ่ม", "แถว" : "แถว", "โถม" : "โดด", "ไถ้" : "ไท่", "ไถล" : "พะเลิด",


///////////////////////////////////////////////////////////////////////////////////////////////////// ท
"ทแกล้ว": "เสนาหาญ", "ทดน้ำ": "กั้นน้ำ", "ทดแทน": "แทน", "ทดรอง": "จ่านฮอง", "ทดลอง": "ชาม",
"ทน": "ข่าม", "ทแยง": "ซ้วย", "ทรง": "ทะรง", "ทรงกลด": "ทือเกิ้ง", "ทรงผี": "เข้าผี",
"ทรพี": "พาก", "ทัพพี": "พาก", "ทรมาน": "ธรมาน", "ทรวง": "ทะรวง", "ทรามวัย": "ทราม",
"ทราย": "ซ้าย", "ทรายหยาบ": "ซายหยะ", "ทวง": "ท้อ", "ท่วงที": "เชิง", "ทรวดทรง": "ฮูปฮั่ง",
"ทวด": "หม่อน", "ทวน": "ลื้ม", "ท้วน": "พี", "ท่วม": "ถ้วม", "ทวย": "เท้าแขน",
"ทวาร": "ตวาน", "ทวีป": "ทีป", "ทอแสง": "ยอแสง", "ท้อ": "มะมุ่น", "ท้อถอย": "ใจอ่อน",
"ทอง": "คำ", "ทองกรอบ": "คำำผ่อย", "ทองกราว": "กวาว", "ทองคำเปลว": "คำปลิว", "ทองเครือ": "กวาวเครือ",
"ทองใบ": "คำใบ", "ทองพันชั่ง": "แฮพันชั้น", "ทองเหลืองป่า": "ทองเดือนห้า", "ทองหลางมน": "ทองแค", "ทองบ้าน": "ทองเผือก",
"ทองลงหิน": "ทองแข", "ทองสุก": "คำสุก", "ทองหลวง": "ทองป่า", "ทองเผือก": "องบ้าน", "ท่องเที่ยว": "ท่องเต้า",
"ท้องคุ้ง": "น้ำโค้ง", "ท้องเดิน": "หลุต๊อง", "ท้องผูก": "ท้องถัก", "ท้องเฟ้อ": "ท้องขึ้น", "ท้องมาน": "มานอุง",
"ท้องร่วง": "หลุต๊อง", "ทอด": "จืน", "ทอดโกลน": "พาดพะเลิน", "ทอดตลาด": "เลหลั่ง", "ทอดทิ้ง": "ทอดทูม",
"ทอดรวง": "ออกงวง", "ทอน": "ทอน", "ทอยกอง": "หมากหย่อ", "ทะนาน": "แครง", "ทะยอย": "ยอย",
"ทะยาน": "โผ", "ทะลวง": "โล่ง", "ทะลัก": "ผะหลด", "ทะลาย": "คะแนง", "ทะลุ": "ผด",
"ทะเล": "ตะเล", "ทะเลสาป": "คว้าน", "ทะเลาะ": "ผิดเถียง", "ทักขิโณทก": "น้ำหยาด", "ทักษิณาวรรต": "ผัดตาสิน",
"ทัง": "มะเยา", "ทั้ง": "ทัง", "ทังอิ้ว": "มะเยา", "ทัด": "เหน็บ", "ทั้งลงทั้งราก": "ขี้รากสองคอง",
"ทับ": "เต๋ง", "ทับทิม": "บ่ะค้อ", "ท่า": "ถ้้า", "ท้าทาย": "ท้า", "ทาง": "ตาง",
"ทางเดิน": "ตางเตียว", "ทางสี่แยก": "ตางไขว่ควง", "ทางช้างเผือก": "กองจ๊างเผือก", "ทานบดี": "เจ้าของตาน", "ทานตะวัน": "บัวผัด",
"ทานวัตถุ": "ครัวตาน", "ท่าน": "เพิ่น", "ทาบ": "ซาบ", "ทาบทาม": "ช่าว", "ท่ามกลาง": "ท่ำกล๋าง",
"ทาย": "ทวาย", "ท้ายทอย": "ง่อน", "ทายกทายิกา": "ศรัทธา", "ทารก": "ลูกอ่อน", "ทารุณ": "ใจดำ",
"ท้าวจตุโลก": "ท้าวทั้งสี่", "ทำ": "เยียะ", "ทำครัว": "เยีียะกิน", "ทำท่า": "เตะฮั่ง", "ทำที": "แต่งเยียะ",
"ทำลิง": "เยียะหน้าวอก", "ทำนบ": "แท", "ทำนาย": "หมอทวาย", "ทำนายฝัน": "ทวายคำฝัน", "ทำเนา": "บ่พอร้าย",
"ทำบุญ": "กระทำบุญ", "ทำบุุญต่ออายุ": "สืบชะต๋า", "ทำมาหากิน": "ฮิหา", "ทำไม": "เยียะหยั่ง", "ทำลาย": "ม้าง",
"ทิ้ง": "คว่าง", "ทิ้้งขว้าง": "ละคว่าง", "ทิ้งทาน": "ผุยทาน", "ทิ้งถอน": "ถ่อน", "ทิด": "หนาน",
"ทิพย์": "ทิพพ", "ทิม": "ถิ่ม", "ทิว": "แนว", "ทิศ": "หน", "ที": "เทื่อ",
"ทีเดียว": "กำเดียว", "ทีเเรก": "เตื่อแรก", "ทีหลัง": "เตื่อหน้า", "ที่ทำการเจ้าผู้ครอง": "เค้าสนามหลวง", "ที่ทำการไปรษณีย์โทรเลข": "โรงสาย",
"ที่ลับ": "ที่สะแวก", "ที่ลุ่ม": "ที่โห่ง", "ทึ่ง": "อิกขลิก", "ทึมทึก": "สาวเถ้า", "ทึบ": "อึบ",
"บึกทึ่อ": "บึ่ก", "ทือ": "ลุ่น", "ทุก": "กุ", "ทุ่ง": "ต้ง", "ทุด": "ทุย",
"ทุกทิศ": "กุทิสะ", "ทุกฝ่าย": "กุฝ่าย", "ทุกหนทุกแห่ง": "กุหนกุแห่ง", "ทุน": "ทึน", "ทุนเดิม": "เค้าทึน",
"ทุบ": "บุบ", "ทุบตี": "บุบตี๋", "ทุพภิกขภัย": "กลั้นอยาก", "ทุ่ม": "คว่าง", "ทุ่มเถียง": "ถ้องเถียง",
"ทุรนทุราย": "เปลี่ยน", "ทุกเรศ": "เอ็นดู", "ทุเลา": "ยังเเควน", "ทุศีล": "ทุสีละ", "ทู่": "มุ่ม",
"ทูต": "ผู้ต่างหน้า", "เท": "ถอก", "เท็จ": "จุ", "เทพทาโร": "จะไครต้น", "เทริด": "ขะโจม",
"เทศกาล": "ปเวณี", "เทอญ": "เต่อ", "เท่าไร": "เต้าใด", "เท่าใด": "เต้าใด", "เท่ากัน": "เต้ากั่น",
"เท่าตัว": "เต้าตั๋ว", "เท่านั้น": "เต้าอั้น", "เท่านี้": "เต้าอั้ี้", "เท้า": "ตี๋น", "เท้าถีบ": "ตี๋่งตั่ง",
"เท้าสาน": "ข้าวสาร", "เท้ายายม่อม": "เดงจ้อน", "เทิด": "ทูน", "เทิน": "ม่อน", "เทิบทาน": "เนิบนาบ",
"เที่ยงคืน": "เกิ่งคืน", "เที่ยงวัน": "ตาวันเตี่ยง", "เทียนแดง": "เตียนใต้", "เทียบ": "เตะ", "เทียนฤษี": "ตี๋นเป็ด",
"เทียม": "ชอน", "เทียรย่อม": "เตียนย่อม", "เทียว": "กำเดียว", "เทื้อ": "เคิ้น", "เทื้อก": "เทือก",
"เที่ยว": "เที่ยว", "เทือกแถว": "เชอ", "แทงหวย": "ต้นพุย", "แทน": "แตน", "แทบแท่นประธาน": "แท่นแก้ว",
"แทบ": "เกือบ", "แทะ": "แหง้น", "โทรม": "คร่ำ", "โทรมหญิง": "เม็กแม่ยิง", "ไทย": "ไตย",
"ไทยทาน": "ครัวตาน", "ไทรกร่าง": "ไฮ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ธ
"ธง" : "ทง", "ธนู" : "ด้ามไม้", "ธมงรก" : "ข็อก", "ธรรมกถึก" : "ธรรมกถิกะ", "ธรรมปริศนา" : "ธรรมเปสนา",
"ธรรมวัตร" : "ธรรมมหาวัตร", "ธำมรงค์" : "ทำรงค์", "เธอ" : "ตั๋ว", "ธุระ" : "ก๋าน", "ธุระกิจ" : "เวียกก๋าน", "โธ่" : "พุทโธ",


///////////////////////////////////////////////////////////////////////////////////////////////////// น
"นกกระจอก":"นกจอก","นกกระจาบ":"นกจอกฟ้า","นกกระจิบ":"นกจิบ","นกกระเจี๊ยบ":"นกมะปู่","นกกระเด้าลม":"นกแอ่นลม",
"นกกระตั้ว":"นกกะถัว","นกกระต้อยตีวิต":"นกแตนแต้","นกกระเตน":"นกเตน","นกกระทา":"นกปะทา","นกกระทุง":"นกทุ่งทุง",
"นกตะกลุม":"นกทุ่งทุง","นกกระไน":"นกมะแห้","นกกระปูด":"นกกดปูด","นกกระเรียน":"นกเขียน","นกกระลาง":"นกยางหลวง",
"นกกระลิง":"นกแลหม้อ","นกกระเวน":"นกเกวน","นกกระสา":"นกคองู","นกกลิ้งเขน":"นกแซว","นกกลิ้งโคลน":"นกเอื้องขี้โหล้",
"นกกลิ้งโคลนแกลบ":"นกจีแจ๊บ","นกกางเขน":"นกจีแจ๊บดาว","นกการะเวก":"นกการะวีก","นกกำกวม":"นกแลหลัว","นกแก้ว":"นกแล",
"นกขุนทอง":"นกเอื้องคำ","นกแขวก":"นกขวาก","นกค้อนทอง":"นกกาบ้า","นกค้อนหอย":"นกกดหอย","นกเค้าแมว":"นกเค้า",
"นกช่างเหล็ก":"นกเหล็ก","นกแซงแซว":"นกแซงหางค่าง","นกเงือก":"นกกก","นกดุเหว่า":"นกกะเวา","นกตะขาบ":"นกกะถาบ",
"นกตีทอง":"นกปก","นกทิ้งทูด":"นกขี้ทูด","นกทือทื้อ":"นกปู่ทิด","นกนางแอ่น":"นกแอ่นแหว้น","นกปรอทหัวโขน":"นกจิกจะลิว","นกเป็ดน้ำ":"นกเป็ดหงษ์",
"นกเป็ดผี":"นกเป็ดฮี้้","นกพิลาป":"นกกาแก","นกโพรดก":"นกโพรนโดก","นกยางกรอก":"นกยางขอก","นกกระงมไพร":"นกแซวหางด่าง",
"นกสาลิกา":"นกเอื้องแขก","นกแสก":"นกกองกอย","นกหก":"นกกก","นกหัวขวาน":"นกมะตะล้า","นกฮูก":"นกเค้า",
"นกทรี":"ต้นเล็บครุธหลวง","นกตำเลียง":"เนื้อมะต่อม","นกนาน":"เมินนาน","นกแมว":"นกงัว","นวด":"บีบ",
"นวดข้าว":"ตี๋ข้าว","นวดฟั้น":"บีบฟั้น","นวนฟั้น":"บีบฟั้น","นวลใหญ่":"ไม้หก","นอนเซา":"หลับดื้อ",
"นอนขี้เซา":"หลับดื้อ","นอนนิ่ง":"นอนดัก","นอนพังพาบ":"นอนเมิบ","นอนฟุบ":"นอนมูบ","นอนราบ":"นอนเหยียด",
"น้อย":"หน้อย","น้อยเนื้อต่ำใจ":"ต่ำค้อยน้อยใจ","น้อยหน่า":"บ่ะหน้อยแน้","น้อยโหน่ง":"บ่ะแหน้ดาก","นะ":"เน้อ",
"นักโทษ":"ขี้โส้","นักพนัน":"ขี้เหล้น","นักบุญ":"ตนบุญ","นักสิทธิ":"ตนบุญ","นักบวช":"หนพานใน",
"นักพรต":"หนพานใน","นักขัตร":"นักขัตฤกษ์","นั่งขัตสมาธิ":"นั่งขดสวาย","นั่งไขว่ห้าง":"นั่งขาก่ายง้อน","นั่งพับเพียบ":"นั่งป้อละแหม้",
"นั่งยองๆ":"นั่งหย่องเขาะ","นั่งร้าน":"พวน","นั่งทอดก้น":"นั่งเป้อละเหม้อ","นั่งเอกเขนก":"นั่งเติกเสิ้ง","นั่งหันหลังให้":"นั่งบิ่นหลังตำ",
"นั่น":"หั้น","นั่นแน่":"หั้้นลุ","นั่นยังไง":"หั้้นลุ","น่อง":"หน่อง","นอนก้น":"ข้อนก้น",
"นอนเวร":"นอนมื้อ","นันแล":"นั้นแหล่","นัยตา":"แก่นตา","นาสวน":"ไร่ข้าว","นาดำ":"นา",
"นาเมือง":"นา","นาเบา":"นาดอ","นาหนัก":"นาปี","น่า":"หน้า","น่าอัศจรรย์":"บู่นดีงืด",
"น่าเคือง":"น่าใคร่เคียด","น้า":"น้า","นางกราย":"เอื้องสาวนา","นางชี":"แม่ขาว","นางกวัก":"บัวควัก",
"นางนูน":"ผักสาม","นางแย้มป่า":"พิ่งขาว","นาคราช":"กีบม้าลม","นาค":"ลูกแก้ว","นางแย้ม":"พิ่งสมุทร์",
"นาน":"เมิน","นายจ้าง":"ป้อเลี้ยง","นายด่าน":"นายอ่าย","นำพา":"เอ่ยเฮ่ย","น้ำครำ":"น้ำหม่า",
"น้ำค้าง":"เหมือย","น้ำเคี่ยวผัก":"น้ำผัก","น้ำซาวข้าว":"น้ำข้าวหม่า","น้ำตก":"น้ำจอก","น้ำตาเทียน":"ขี้เตียน",
"น้ำเต้า":"บ่ะน้ำ","น้ำทรง":"น้ำยิ่ง","น้ำนมราชสีห์":"หญ้าน้ำหมึก","น้ำนอง":"ปลวกนอง","น้ำประสาร":"สารที",
"น้ำประสารทอง":"สารข้าวตอก","น้ำพริกเผา":"น้ำพริกดำ","น้ำพักน้ำแรง":"น้ำบ่าน้ำแรง","น้ำพุ":"น้ำปุ","น้ำมูก":"ขี้มูก",
"น่าย":"ไน่","น้ำเย็น":"น้ำจิง","น้ำท่า":"น้ำจิง","น้ำอ้อยงบ":"น้ำอ้อยแหว้น","นิครนถ์":"ชีเปลือย",
"นิ่ง":"ดัก","นิด":"หนิ้ว","นิดหน่อย":"หน้อยเดียว","นิทาน":"เจี้ย","นินทา":"เล่าขวัญ","นิยม":"เขือก",
"นิยาย":"เจี้ย","นิ่ว":"หนิ้ว","นิ่วดง":"ดงตำ","นี่":"หนี้","นี่นัน":"เดือดนัน",
"นึกถึง":"กึดเติง","นึ่ง":"หนึ้ง","นุ่น":"งิ้ว","นูน":"โถ","เนระพูสี":"ดีงูว้า",
"เนิน":"ม่อน","เนียม":"อ้ม","เนียมหูเสือ":"หอมด่วนหลวง","เนียมหููเสือ":"เนียมอ้ม","เนียมสวน":"เนียมอ้ม",
"เนื้อ":"จิ้น","เนื้อร้าย":"เนื้อกล้า","เนืองๆ":"ไจ้","เนือย":"ทุ่น","แน่นอน":"แต้",
"เเน่นิ่ง":"สะหยบ","แน่น":"แหน้น","แน่นหนา":"แน่นแฟ้น","แนม":"แอม","แนะ":"แน๋",
"แน่ะ":"แน่","โนน":"ม่อน","เนิน":"ม่อน","โน่น":"ปุ้น","โน้น":"ปุ้น",
"โน่นนิดนี้หน่อย":"ปุ้้นหน้อยเพ้หน้อย","โน้ม":"น้อม","โนรา":"สะเลา",


///////////////////////////////////////////////////////////////////////////////////////////////////// บ
"บ่": "บ่อ", "บ่อ": "บ่อ", "บ่อราง": "บ่หล้าง", "บกพร่อง": "ขาดตก", "บง": "เฮียะ",
"บงการ": "บ่งการ", "บ่น": "จ่ม", "บ่นถึง": "จ่าเถิง", "บ่นอุบ": "จ่มบุ้มๆ", "บ่นพึมพำ": "จ่มบุ้มๆ",
"บ่ม": "อุ็ก", "บรรจง": "ผจง", "บรรจบ": "สบ", "บรรจุ": "ใส่", "บรรดา": "ปะดา",
"บรรทัด": "ปะทัด", "บรรทัดฐาน": "ปทัฏฐาน", "บรรทุก": "ต่าง", "บรรเทา": "ทุเลา", "บรรพบุรุษ": "ปู่ย่า",
"บรรเลง": "อุ่ม", "บรรพชา": "ปัพพชา", "บรรพชิต": "ปัพพชิต", "บรรยาย": "เล่าไข", "บริโภค": "บอระโพก",
"บริบูรณ์": "บอระมวน", "บวงสรวง": "ขึ้น", "บ่วง": "บ้วง", "บวบขม": "บ่ะนอย", "บวบงู": "บ่ะนอยงู",
"บวบเหลี่ยม": "บ่ะบวบ", "บวบหอม": "บ่ะนอยอ้ม", "บอม": "สาระวีก", "บ่อน้ำ": "น้ำบ่อ", "บ้องไฟ": "บอกไฟ",
"บ้องแบ้ว": "ผ่างร้าย", "บอบ": "อิดอ่อน", "บอบช้ำ": "ชอกช้ำ", "บ่อย": "หมั่น", "บอระเพ็ด": "ชุ่งช้าลิง",
"บ๊ะ": "อะละ", "บัก": "บ่า", "บัง": "เกิ้ง", "บังคนเบา": "ย้ายเบา", "บังคนหนัก": "ย้ายหนัก",
"บังคับ": "จำ", "บังคับเคี่ยวเข็ญ": "ขนาบขับจำ", "บังแทรก": "เต่า", "บังสูรย์": "เกิ้ง", "บังหวน": "บังควัน",
"บังเหียน": "แค็ก", "บังเอิญ": "บังเอิน", "บัญชร": "เบงชร", "บัญชา": "สั่ง", "บัญชี": "เส้น",
"บัญญัติ": "ปันยัติ", "บัณฑิต": "ปัณฑิตะ", "บัดเดี๋ยว": "กำเดียว", "บัดนั้น": "กำำนั้น", "บัดนี้": "บ่ะเดี๋ยวนี้",
"บัดแมลง": "เมื่อแลง", "บัดกรี": "จอด", "บัดซบ": "บอดใบ้", "บัดสี": "ขึดจา", "บัตรสนเท่ห์": "ฎีกา",
"บัน": "จั่ว", "บันดาล": "บันดาน", "บันได": "คันได", "บันทึก": "จด", "บันลือ": "ผายเสียง",
"บ้า": "ผีบ้า", "บาง": "ปาง", "บ่า": "อี่บ่าง", "บ้าง": "พ่อง", "บ้างก็": "ลางพ่อง",
"บ้าจี้": "บ้าเดียม", "บ้าบ่น": "บ้าจ่ม", "บ้าบิ่น": "น้ำสองทองเกิ่ง", "บ้ายอ": "น้ำสุ่ย", "บากหน้า": "ตากหน้า",
"บัวบก": "ผักหนอก", "บัวเผื่อน": "บัวผัด", "บาดทะยัก": "ละอาก", "บาดหมาง": "หมางใจ", "บาดแผล": "ปากบาด",
"บานทะโรค": "ริดสีดวงกีบบ่ะเพื่อง", "บานเที่ยง": "ปอเส้ง", "บานไม่รู้โรย": "ต๋าหล้อม", "บานแผนก": "หน้าทับ", "บานเย็น": "จำยาม",
"บาปเคราะห์": "ปาปะเคราะห์", "บายศรี": "ขันศรี", "บ่าย": "ช้าย", "บ้าย": "แปด", "บารมี": "ปารมี",
"คนใช้": "บ่าว", "บำเพ็ญ": "พ่่ำเพ็ง", "บำเรอ": "พ่ำเริน", "บำบัด": "ปัดเป่า", "บิณฑบาต": "ปิณฑิบาต",
"บิด": "กิ้ว", "บิดขี้เกียจ": "บิดคร้าน", "บิดพริ้ว": "ปลิ้นแผ", "บิดหล่า": "เหล็กจีขะหลำหมู", "บิดา": "ป้อ",
"บิ่น": "บ้าง", "บีบคั้น": "เหนงหนีบ", "บีบบังคับ": "ข่มเหงเหนงหนีบ", "หนุ่ม": "บ่าว", "บึง": "ปึ๋ง",
"บึ้ง": "จ้าว", "บุกรุก": "ล่วงล้ำ", "บุคคล": "บุคคละ", "บุ่ง": "ปึ๋ง", "บุ้ง": "แมงบ้ง",
"บุญธรรม": "เลี้ยง", "บุญมาก": "บุญหนา", "บุญราศรี": "บุญรวายศี", "บุตรา": "บุตตา", "บุตรี": "บุตตี",
"บุบ": "บ้วม", "บุ๋ม": "ว๋ำ", "บุบสลาย": "บ้างผ่อย", "บุ้ย": "บื้ย", "บุบผาราม": "สวนดอก",
"บุหรี่พระราม": "ปังแป้", "เบือ": "เบื่อ", "เบื่อ": "ก่าย", "เบือหน่าย": "แหนงหน่าย", "เบื้อง": "ข้าง",
"เบื้องว่า": "ส่วนว่า", "เบือน": "เบ่น", "แบ่ง": "ปัน", "แบ่งครึ่ง": "ปันเกิ่ง", "แบ่งภาค": "ปันส่วน",
"แบ่งส่วน": "ปันต่า", "แบงก์": "แบ๊งก์", "แบน": "แพบ", "แบบบาง": "แพว", "แบบแผน": "แบ๊บเบ้า",
"แบบอย่าง": "ลายแซง", "แบมือ": "แบนมือ", "โบก": "วี", "โบกมือ": "กวั๊ก", "โบกปูน": "โบกสะทาย",
"โบกธง": "แกว่งธง", "โบตั๋น": "หว้านปู่ย่า", "โบย": "เขี้ยน", "โบราณคดี": "เรื่องบ่ะเก่า", "ใบ": "ใบ",
"ใบต่างดอก": "กะเบ้อ", "โบสถ์": "โบสด", "ใบ้": "เอ๋อ", "ใบเงิน": "สารเงิน", "ใบทอง": "สารคำ",
"บุราณ": "บ่ะเก่า", "โบราณ": "บ่ะเก่า", "บุรุษ": "จาย", "บุหรี่": "ปุรี", "บู้": "ปู้",
"บูชา": "ปูชา", "บูรพา": "บุพพา", "เบ้": "เป้", "เบญกานี": "ลูกบ่ะก่อ", "เบญจ": "ปัญจะ",
"เบญจา": "ปัญจา", "เบญจางคประดิษฐ์": "ทุีติดที่เท้าห้าแห้ง", "เบ็ญพาด": "เบงสะพาด", "เบ็ดเตล็ด": "จิกจ็อก", "เบ็ดเสร็จ": "รวมหมด",
"เบน": "บิ่น", "เบ้อเรอ": "เป่อเร่อ", "เบาเต็ง": "บ่ะลันตัน", "เบาบาง": "บกบาง", "เบาะเเส": "ฮ่องฮอย",
"เบิกโลง": "เปิดหล้อง", "เบิ่ง": "เหง้อ", "เบี้ยโบก": "บ่ะแก่ว", "เบียงบ่าย": "เบี่ยงบ่าย", "เบียด": "ยัด",
"เบียดเบียน": "ค่ำ", "เบียดเสียด": "ยัดยู้",


///////////////////////////////////////////////////////////////////////////////////////////////////// ป
"ปก" : "หน้ารับ", "ปฎิทิน" : "ปกะทืน", "ปฎิบัติรักษา" : "ปัดปัว", "ปด" : "จุ", "ปดโป้" : "จุ",
"ปน" : "สูน", "ป่น" : "บด", "ปรกติ" : "ปะกะติ", "ปรง" : "บ่ะป้าวเต่า", "ปรงป่า" : "กูดบก",
"ปรนนิบัติ" : "ปัดปัว", "ปรบมือ" : "ตบมือ", "ปรวด" : "สาร", "ปรวนแปร" : "ผวนแผ", "ปร๋อ" : "ปื๋อ",
"ปรองดอง" : "ออมชอม", "ปรอท" : "น้ำปะทา", "ปรอย" : "ซอย", "ประ" : "ผะ", "ประกวด" : "เเข่ง",
"ประกบ" : "กุบ", "ประคดอก" : "ผ้าฮัดอก", "ประคดเอว" : "ผ้าฮัดเเอว", "ประคบ" : "จู้", "ประคอง" : "ตุ้ม",
"ประคับประคอง" : "หอบหุ้มตุ้มพา", "ประคำ" : "ปัดคำ", "ประคำไก่" : "ตันยาแก้", "ประคำดีควาย" : "บ่ะคำดีควาย", "ประคำร้อย" : "ผีคำร้อย",
"ประเคน" : "เคน", "ประโคม" : "อุ่มงัน", "ประจญ" : "ผจญ", "ประจบ" : "แหละ", "ประจวบ" : "พวม",
"ประจ๋อประแจ๋" : "จ๋อแจ๋", "ประจักษ์" : "ประจักษ์", "ประจัญ" : "สู้", "ประจัน" : "ขั้น", "ประจาน" : "ซะหน้า",
"ประจำครั่ง" : "จ้ำครั่ง", "ประจำตรา" : "จ้ำถา", "ประเจิดประเจ้อ" : "เจิดเจ้อ", "ประเจียด" : "ผ้ายันต์", "ประแจ" : "ขะแจ",
"ประแจจีน" : "ขะแจจีน", "ประชด" : "หย้อ", "ประชัน" : "เตี่ยง", "ประชิด" : "ซิด", "ประชุม" : "ประสุม",
"ประณม" : "ผะหนม", "ประดง" : "หัด", "ประดัง" : "โหล่", "ประดา" : "ดา", "ประดาน้ำ" : "ดาน้ำ",
"ประดิดประดอย" : "แต่งแป๋ง", "ประดิษฐ" : "ตั้งไว้", "ประดิษฐ์ประดอย" : "แต่งแป๋ง", "ประดุจ" : "ดุจดั่ง", "ประดู่" : "ดู่",
"ประดู่ชิงชัน" : "สะแอน", "ประดู่ส้ม" : "เทิม", "ประเดิม" : "ตั้งเค้า", "ประเดี๋ยว" : "กำเดียว", "ประฎัก" : "แส้",
"ประทักษิณ" : "ผัดตาสิน", "ประทัง" : "ทุเลา", "ประทัด" : "บ่ะถบ", "ประทัดลม" : "บ่ะถบลม", "ประทับ" : "จ้ำ",
"ประท่า" : "หล่ายหน้า", "ประทับป่า" : "พาดบ่า", "ประทุน" : "กูบ", "ประทุษฐ์ร้าย" : "กะทำร้าย", "ประธาน" : "หัวหน้า",
"ประนีประนอม" : "ออมชอม", "ประปราย" : "เผาะแผะ", "ประเปรียว" : "ว่อง", "ประพฤติ" : "เยียะ", "ประพิมพ์ประพาย" : "คล้าย",
"ประเพณี" : "ปเวณี", "ประมง" : "พรานปลา", "ประมวล" : "ประมวน", "ประมาณ" : "ผะหมาน", "ประมาทหน้า" : "ดู่แควนใส่หน้า",
"ประมุข" : "เค้า", "ประยงค์" : "ไค้ยงค์", "ประโยชน์" : "ผะโยช", "ประลอง" : "ซ้อม", "ประเล้าประโลม" : "เล้าโลม",
"ประสก" : "อุบานสก", "ประสะ" : "ลุม", "ประสูติ" : "ผะสูด", "ประหนึ่ง" : "หย้่ง", "ประหม่า" : "ตกคะพ่า",
"ประหยัด" : "ฮอมหยับ", "ประหลาด" : "งืด", "ประหวั่น" : "หวั่น", "ประหวัด" : "กึดหลัง", "ปรักหักพัง" : "หลุพัง",
"ปรักปรำ" : "ยู้โทษ", "ปรัชญา" : "ผะหยา", "ปรับไหม" : "ปรับ", "ปรางค์" : "ผังคะ", "ปรับทุกข์" : "เล่าทุกข์",
"ปรับปรุง" : "ส้อมแซม", "ปรารถนา" : "ผากะนา", "ปราศรัย" : "ผาสะหรัย", "ปริ" : "ผิ", "ปริบ" : "หยิบ",
"ปริพพาชก" : "ปริพพาชกะ", "ปริศนา" : "เป็ดสะหนา", "ปรี่" : "เพี่ยม", "ปรึกษา" : "เปิ้กษา", "ปรือ" : "เหนิบ",
"ปรุงยา" : "สมยา", "ปรุงอาหาร" : "เยียะกิ๋น", "ปรู" : "ผู", "ปลก" : "กะหงก", "ปลงผม" : "ขูดหัว",
"ปลอก" : "ฝอก", "ปลอกหมอน" : "เสื้อหมอน", "ปล้อน" : "แบ้น", "ปลอบ" : "จุจอบ", "ปล่อยมือ" : "สัวะ",
"ปลัก" : "บวก", "เปลง" : "บวก", "ปลัง" : "ผักปัง", "ปลากราย" : "ป๋าตอง", "ปลากริม" : "ป๋าเข็ม",
"ปลากระดี๋" : "ป๋าสลาด", "ปลากระทิง" : "ป๋าหลด", "ปลากระเบ็น" : "ป๋าฝา", "ปลากระป๋อง" : "ป๋ากับ", "ปลากระพง" : "ป๋าพวน",
"ปลากระพล้อ" : "ป๋าพวน", "ปลากระแห" : "ป๋าตะเพียน", "ปลากระโห้" : "ป๋าคัง", "ปลากา" : "ป๋าเพียะ", "ปลาก้าง" : "ป๋ากัั้ง",
"ปลาแก้วช้ำ" : "ป๋าปก", "ปลาแขยง" : "ป๋าแกด", "ปลาเค็น" : "ป๋าบ้วง", "ปลาเกลือ" : "ป๋าบ้วง", "ปลาเงินปลาทอง" : "ป๋าคำ",
"ปลาช่อน" : "ป๋าหลิม", "ปลาช่อนใหญ่" : "ป๋าก่อ", "ปลาตะเพียนแดง" : "ป๋าปก", "ปลาตะเพียนเหลือง" : "ป๋ากะบี้", "ปลาตาเดียว" : "ป๋าตาเฟื้อง",
"ปลาเทโพ" : "ป๋าเทาะ", "ปลานวลจันทร์" : "ป๋าปอน", "ปลาเนื้ออ่อน" : "ป๋าหวาน", "ปลาบ้า" : "ป๋าค้าวว้อ", "ปลาบู่" : "ป๋ามูด",
"ปลาเบี้ยว" : "ป๋าหวาน", "ปลาปักเป้า" : "ป๋าเป้า", "ปลาย่าง" : "ป๋าแห้ง", "ปลาร้า" : "ฮ้า", "ปลาลิ้นหมา" : "ป๋าผาก",
"ปลาสลาด" : "ป๋าตอง", "ปลาสร้อย" : "ป๋าบอก", "ปลาสร้อยนกเขา" : "ป๋าบอกสร้อย", "ปลาสังกะวาด" : "ป๋าสวาด", "ปลาไส้ตัน" : "ป๋ากลม",
"ปลาหมอ" : "ป๋าเสด็จ", "ปลาหลด" : "ป๋าหลาด", "ปลาหางกิ่ว" : "ป๋าทู", "ปลาไหล" : "ป๋าเยี่ยน", "ปลาไหลเผือก" : "แฮพันชั้น",
"ปลาหมู" : "ป๋างวง", "ปลาบปลื้ม" : "สู้", "ปลายข้าว" : "ข้าวเบี่ยน", "ปล้ำ" : "เม็ก", "ปลิ้นปล้อน" : "วอก",
"ปลีก" : "ย่อย", "ปลื้ม" : "ชื่นสู้", "ปลุก" : "ฮ้อง", "ปลูกผี่" : "สับสุก", "ปวง" : "พวง","ป่วง":"หลุต้อง","ปวดท้องทุ่ง":"ใคร่ขี้","ปวดท้องขี้":"ใคร่ขี้","ปวดท้องหนัก":"ใคร่ขี้","ปวดท้องเยี่ยว":"ใคร่เยี่ยว",
"ปวดท้องเบา":"ใคร่เยี่ยว","ปวดปัสสาวะ":"ใคร่เยี่ยว","ป่วย":"ป่วย","ปอตูมฝ้าย":"ปอตูมหูช้าง","ปอขนุน":"ปอฟาน",
"ปอบ้าน":"ปอธง","ปอขาว":"ปอธง","ปอแตก":"ปอขี้แรต","ปอเปิด":"ปอมึ่น","ปอฝ้าย":"ปอแป้",
"ปอกะเจา":"ปอป่าน","ปอ":"กะบี้","ป้อยอ":"สุ่ย","ปอง":"พอง","ป้องกัน":"กั้งก่า",
"ปอน":"หมอง","ปอบ":"ผีกะ","ปะ":"หนาบ","ปะกัง":"โรคผีตาวัน","ตะกัง":"โรคผีตาวัน",
"ปะขาว":"ต๋าผ้าขาว","ปะดงเลือด":"หำฟาน","ปะติดประต่อ":"ต่อหน็อบต่อแหน็บ","ปะทะ":"ป๊ะ","ปะทะปะทัง":"สืบต่อไว้",
"ประทุ":"แตกตุบตับ","ปะรำ":"ปรำ","ปะแล่ม":"แจ่มแหล่ม","ปะเหลาะ":"เหลาะ","ปักษี":"ปักขี",
"ว่าวปักเป้า":"ว่าวอีหลุ้ม","ปัจจุบัน":"ปะจุบัน","ปัญญา":"ผะหยา","ปัดรังควาน":"ม้างขึด","ปัดๆ":"ปั๊บๆ",
"ปั้นปึ่ง":"วางยศ","ปั้นสีหน้า":"ตีหน้า","ปั้นลม":"กาแล","ปัทมราค":"แก้วคอ","ปั่นป่วน":"วุ่นวาย",
"ปั้นยศ":"ไว้ยศ","ปากควาย":"แพรกควาย","ปากจัด":"ปากนัก","ปากบอน":"ปากเป็น","ปากร้าย":"ปากเจ็บ",
"ปากหนัก":"ปากปึก","ปากเปราะ":"ปากผ่อย","ปากหวาน":"ปากม่วน","ปากน้ำ":"สบ","ปากกล้า":"ปากแข็ง",
"ปากตลาด":"คำเล่าลือ","ครีมปากนกแก้ว":"กีมนกเค้า","ปากเปล่า":"คำปาก","ปากเปียก":"ปากเปียะ","ปากโป้ง":"ปากม่อ",
"ปา":"คว่าง","ปาง":"ฮิม","ป่าช้า":"ป่าเฮี่ยว","ป่าทึบ":"ดงหนา","ปานนี้":"ปานอี้",
"ปานฉะนี้":"ปานอี้","ป่าละเมาะ":"ป่าแพะ","ป่าย":"เปี่ยง","ป้ำ":"ใหญ่","ปิด":"ตึด",
"ปิดเบา":"ขัดเบา","ปิดหนัก":"ขัดหนัก","ปิดหน้า":"อุ่มหน้า","ปีศาจ":"ผีวิศาจ","ปิ่นโต":"ถ้วยสาย",
"ปี่กลาย":"ปี่แล้ว","ปีก่อน":"ปี่ซึน","ปีถัดปีก่อนขึ้นไป":"ปีก่อนซึน","ปี่ชะวา":"แน","ปีน":"เปี่ยง",
"ปีป":"กาสะลอง","ปึกแผ่น":"อุกหนา","ปึ่งชา":"หน้าชะกว้าย","ปื้น":"เปิ้น","ปื้้อ":"คึรึ",
"ปึ๋อ":"คึรึ","ปืนใหญ่":"อะม็อก","ปืนคาบศิลา":"ปืนไฟ","ปืนลูกซอง":"ปืนเบอร์","ปืนดาวกระจาย":"ปืนลูกกำผาย",
"ปืนแก๊ป":"ปืนบ่ะแต็บ","ปุก":"พก","ปุด":"บ๊ด","ปุ่มฆ้อง":"หมงค้อง","ปูนา":"ปูนา",
"ปู่":"ป้ออุ๊ย","ตา":"ป้ออุ๊ย","ปู่ทวด":"ป้อหม่อน","ตาทวด":"ป้อหม่อน","ปูนสอ":"สะทาย",
"ปูนผิว":"ปูนหละ","ปูลู":"บ่ะลู","เป็น":"จ่าง","เป็นจริงเป็นจัง":"เป๋นแต้เป๋นว่า","เป็นมั่นเป็นเหมาะ":"เป๋นแม่นหมั้น",
"เป็นเด็ดขาด":"แต้ๆ","เป็นลม":"เป๋นปิ","เป็นไร":"เป๋นหยัง","เป็นอย่างไร":"เป๋นจะใด","เป็นอันมาก":"เป๋นหนักหนา",
"เป็นเอง":"เป๋นคนเดียว","เปยยาล":"เปยยาละ","เปร็ง":"ต้นไผ่แจ้","เปรต":"เผต","เปรย":"ลอย",
"เปราะ":"หว้านเผาะ","เปราะหอม":"หว้านแผ่นดินเย็น","เปรียบ":"เตะ","เปรี้ยง":"เผียะ","เปรียว":"แห",
"เปรี้ยว":"ส้ม","เปรี้ยวปาก":"ส้มปาก","เปรียะ":"เผียะ","เปล":"อู่","เปลวไฟ":"เปลียวไฟ",
"เปลว":"ปลิว","เปล่า":"อื๋อ","เปล่าๆ":"บ่ดาย","เปล่าเลย":"บ่แหล่","เปล้าเล็ก":"เป้าตองแตก",
"เปลาะ":"เปาะ","เปลี่ยน":"เปลี่ยน","เปลี่่ยว":"หงาน","เปลี่ยวดำ":"เกี่ยว","เปลื้อง":"หลัวะ",
"เปลือย":"จุ้น","เปลือยกาย":"แก้จุ้น","เป๋อเหลอ":"เหล้อๆเซอๆ","เปาะเหลาะ":"เหลาะ","เปิก":"เปิด",
"เปิง":"เปิ้ง","เปิงๆ":"โก๋ๆ","เปิงมาง":"กลองเต่งทิ่ง","เปิดเปิง":"เปิดเปิง","เปิน":"เย่",
"เปิบ":"ยุ่ม","เปียก":"เปียะ","เปียม":"เพี่ยม","เปือกตม":"เปอะ","เปื้อน":"เปื้อน",
"แป":"ฝา","แป้งเหล้า":"ส่าเหล้า","แปทู":"แปจ๋อง","แปบ":"แพบ","แปร":"แผ",
"แปรปรวน":"แผผวน","แปร่ง":"เพี้ยน","แปลก":"แผก","แปลกปลอม":"ปลอมตัว","แปลง":"พั่น",
"แปลงกล้า":"ตากล้า","แปลงผัก":"เติกผัก","แปลบ":"แวบ","แปลงผี":"เลี้ยงผี","แปลน":"แบบ",
"โป่งดิน":"ดินโป่ง","โป่งน้ำ":"น้ำโป่ง","โปน":"สวด","โปร่ง":"เปล่ง","โปรด":"โผด",
"โปรดปราน":"โผดผาย","โปรดสัตว์":"โผดสัตว์","โปรย":"ผุย","โปรยปราย":"ผุยผาย","ไป":"ไป",
"ไปไม่ถึง":"ไปบ่เถิง","ไปด้วยกัน":"ไปตวยกัน","ไปถึง":"ไปเถิง","ไปทำมาหากิน":"ไปฮิไปหา","ไปล่าสัตว์":"ไปไล่เหล่า",



///////////////////////////////////////////////////////////////////////////////////////////////////// ผ
"ผกากอง": "สามแร้ง", "ผงกหัว": "กะง็อกหัว", "ผงะ": "แหงะ", "ผงคลี": "ผงธุลี", "ผด": "ตุ่มเหื่อ",
"ผดุง": "ตุ้ม", "ผนึก": "หนึก", "ผม": "ผม", "ผล": "แก่น", "ผลานิสงส์": "ผละอานิสงส์",
"ผละ": "ผะ", "ผลัก": "ยู้", "ผลัวะ": "ผัวะ", "ผลา": "ผาลา", "ผลาญ": "ค่ำ",
"ผลิ": "งิ", "ผลีผลาม": "ฟั่งฟ่าว", "ผลุด": "ผุด", "ผลุนผลัน": "หุนหัน", "ผลุบผลับ": "ผุบผับ",
"ผลุบโผล่": "โม่งโล่ง", "ผลู": "ผู", "ผวา": "สะดุ้ง", "ผอง": "พวง", "ผ่อนปรน": "หย่อนยาน",
"ผวย": "ผ้าตวบ", "ผอบ": "แอ็บ", "ผักกาดน้ำ": "หญ้าเอนหยืด", "ผักกูดน้ำ": "ผักกูดพ้าว", "ผักกะสัง": "ผักรากกล้วย",
"ผักกาดปั่น": "ผักกาดเขียวปลี", "ผักกาดเขียว": "ผักกาดจ้อน", "ผักขมฟ้า": "ผักปังแป้", "ผักขวง": "ผักขี้ขวง", "ผักชี": "หอมป้อม",
"ผักชีฝรั่ง": "หอมป้อมกุลา", "ผักชีล้อม": "ผักชีเดือนห้า", "ผักชีโหรา": "ผักชีหูด", "ผักกูดดิน": "ผักกูดคึ", "ผักกูดป่า": "ผักกูด",
"ผักตบชวา": "บัวลอย", "ผักตังโอ๋": "ผักตังโอ", "ผักบุ้งฝรั่ง": "ผักบุ้งใต้", "ผักเป็ด": "ผักโหมขาว", "ผักเป็ดแดง": "ผักโหมแดง",
"ผักปราบ": "หญ้าหัวรากน้อย", "ผักคราด": "ผักเผ็ด", "ผักตำลึง": "ผักแคบ", "ผักเต่า": "ผักปอดน้ำ", "ผักบัวบก": "ผักหนอก",
"ผักแพว": "ผักเปี๋ยว", "ผักกะเฉด": "ผักหนอง", "ผักเลือด": "ผักปู่ย่า", "ผักบุ้งรวม": "ผักบุ้งปลิง", "ผักปราบ": "หญ้าหัวรากน้อย",
"ผักปราบนา": "กินกุ้งหลวง", "ผักเค็ด": "ผักหวานบ้าน", "ผักเคล็ด": "ผักหวานบ้าน", "ผักย่านาง": "ผักช้อยนาง", "ผักแพงพวยขาว": "ผักปอดขาว",
"ผักแพงพวยแดง": "ผักปอดแดง", "ผักชะอม": "ผักหละ", "ผักโหมดิน": "ผักโหม", "ผักเฟือยนก": "ผักพ่อค้าตีเมีย", "ผัด": "ขั้ว",
"ผันแปร": "ผวนแผ", "ผ่า": "โบะ", "ผ่าน": "ก๋าย", "ผ้ากราบ": "ผ้านบ", "ผ้าขาวม้า": "ผ้าต่อง",
"ผ้าขี้ริ้ว": "ผ้าหย็อก", "ผ้าเจียม": "ผ้าเจียน", "ผ้าดิบ": "ผ้าสิบพุ่น", "ผ้าไตร": "ผ้าเครื่อง", "ผ้าป่า": "ผ้าทอด",
"ผ้าปูที่นอน": "ผ้าหลบ", "ผ้าปูนอน": "ผ้าแหล็บ", "ผ้าปูอาสน์สงฆ์": "ผ้าเจีอแท่นสังฆ์", "ผ้าผวย": "ผ้าตวบ", "ผ้าพื้น": "ผ้าต้อย",
"ผ้าม่าน": "ผ้ากั้ง", "ผ้าลาย": "ผ้าต้อยแต้ม", "ผ้าเศษ": "ผ้าย่อย", "ผ้าหกคืบ": "ผ้าหกวา", "ผ้าโพกหัว": "ผ้าเคียนหัว",
"ผิง": "หิง", "ผิดเมีย": "ผิดด้วยเมีย", "ผิดสำแลง": "กินผิด", "ผิน": "เบ่น", "ผีกระสือ": "ผีสือ",
"ผีกะหัง": "ผีโพง", "เผือก": "เพิก", "เผื่อแผ่": "ผายแผ่", "ผีกองกอย": "ผีตองเหลือง", "ผีดุ": "ผีกั่น",
"ผีดง": "ผีปกกะโหล้ง", "ผีปอบ": "ผีกะ", "ผีผ่าย": "บ่ะมุ่น", "ผีสิง": "ผีสึง", "ผีห่า": "ผีฮ่า",
"ผีโขมด": "ผีพุ่งใต้", "ผีเสื้อ": "กะเบ้อ", "ผีเสื้อยักษ์": "กะเบ้อช้าง", "ผึ่ง": "บ่ะลู", "ผึง": "เผย",
"ผึ้ง": "เผิ้ง", "ผื่น": "หมืน", "ผุ": "พัวะ", "ผู้": "พู้", "ผู้ชาย": "ป้อจาย",
"ผู้หญิง": "แม่ยิง", "ผู้ใหญ่บ้าน": "ป้อหลวง", "ผูก": "มัด", "เผง": "เปียะ", "เผ่น": "ล่น",
"เผย": "เขย", "เผยอ": "เยอ", "เผลอ": "ลืม", "เผอเลอ": "ลาสา", "เผาะ": "ถอบ",
"เถาะ": "ถอบ", "แผง": "แถง", "แผดเสียง": "เอก", "แผ่น": "เถิบ", "แผลเป็น": "ป้าว",
"แผลพุพอง": "ตุ่มพัวะ", "แผน": "แถน", "แผ้วพาน": "พะพาน", "แผ้ว": "เผี้ยว", "โผน": "โดด",
"โผล่": "แมน", "ไผ่ตง": "ไม้หก", "ไผ่บ้าน": "ไผ่สีสุก", "ไผ่สีสุ": "ไผ่สีสุก", "ไผ่ป่า": "ไผ่",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฝ
"ฝนตกติดกันหลายวัน":"ฝนตกซึง","ฝนตกพรำๆ":"ฝนตกซอยๆ","ฝนแสนห่า":"เคลือเขาเหลี่ยม","ฝรั่ง":"บ่ะกล้วย","ฝอยทอง":"เครือเขาค่ำ",
"ฝักแค":"บ่ะผาบ","ฝักเพกา":"จะคี","ฝั่ง":"ต๋าฝัง","ฝังรกฝังราก":"ตั้งรกราก","ฝาน":"ปาด",
"ฝาผนัง":"ผังเอก","ฝ่าฝืน":"ขัดขิน","ฝาละมี":"ฝาควบ","ฝาสาน":"ฝาถึบ","ฝีกาฬ":"ตุ่มพิษ",
"ฝีคัณฑมาลา":"ฝีดอกบุก","ฝีดาษ":"ตุ่มสุก","ฝีประคำร้อย":"ม่ะเร็ง","ฝีปาก":"สีปาก","ฝีฝักบัว":"ฝีหึมไห",
"ฝีลามเสา":"ฝีลามเสา","ฝีอัคนีสัน":"ฝี","ฝีเท้า":"ฝีตี๋น","ฝีในต้อง":"ต้องฝี","ฝึก":"เฝิ้ก",
"ฝืดคอ":"แค้นคอ","ฝืน":"ขืน","เฝือ":"นักล้ำ","แฝง":"ลี้",


///////////////////////////////////////////////////////////////////////////////////////////////////// พ
"พกลม":"ขี้ลม","พญามือเหล็ก":"บ่ะคอมขม","พญาไม้":"ซางจิต","พญามุตติ":"หญ้าจามหลวง","พญาปล้องทอง":"ลิ้นเขียด",
"พญามูมิน":"หิ่งหาย","พญายา":"ต้นขะแชะ","พญารากดำ":"ดงดำ","พญาโจน":"เครือออน","พญาไร้ใบ":"เคียะเจียน",
"พญาสัตบรรณ":"ต้นตี๋นเป็ด","พ่น":"ผู่","พ้น":"ป้น","พนมสวรรค์":"ต้นพิ่ง","พนัง":"ฝาย",
"พบ":"ทาบ","พม่า":"ม่าน","พยนต์":"ยนต์","พยัก":"กะง็อก","พยัคฆ์":"เพียะฆา",
"พยับแดด":"แสงแดด","พยับเมฆ":"หนวดแมว","พยากรณ์":"ทำนวาย","พยาธิ":"พยาด","พยาน":"สักขี",
"พยาบาล":"ปัดปัว","พยุง":"เพือ","พรมคต":"ต้นผ้ำตายยาก","พรมมิ":"หญ้าพรมมิ","พรรณผัก":"เชื้อผัก",
"พรรดึก":"ขี้แข้น","พรรษา":"วัสสา","พรวดพราด":"อะลึงตึงตัง","พรวน":"บ่ะหิ่ง","พรวณดิน":"ซุยดิน",
"พร่อง":"หวิดขาด","พร้อมกัน":"พร้อมกั่น","พร้อมพรั่ง":"พร่ำพร้อม","พร้อมเพรียง":"พร้อมเพียง","พระ":"ตุ๊เจ้า",
"พระพาย":"ก้อมเกาะ","หนามพรม":"ก้อมเกาะ","พระสงฆ์":"สังฆะ","พระเจ้าอยู่หัว":"พระเจ้าเหนือหัว","พระพุทธเจ้า":"พระเจ้า",
"พระผู้เป็นเจ้า":"สาธุเจ้า","พระเครื่อง":"พระเคิ่ง","พระภูมิ":"เจ้าตี้","พระฮาม":"ฟ้าฮ่าม","พรั่นพรึง":"หย้านกลัว",
"พรั่ง":"พร่ำ","พร่า":"ฟ่า","พราก":"หลด","พราวแพรว":"แววาว","พรำ":"เซียะ",
"พร่ำเพรื่อ":"ซ้ำซอก","พริกไทย":"พริกน้อย","พริกขี้หนู":"พริกแต้","พริกอ่อน":"พริกหนุ่ม","พรุ":"หล่ม",
"พรุ่งนี้":"พรูก","พรุน":"โผ่ง","พรู":"โหล่","พฤกษเทวดา":"รุกขเทวดา","พลเมือง":"ไทยเมือง",
"พลบ":"หัวค่ำ","พลวง":"ไม้ทึง","พลอง":"ไม้ค้อน","พลอย":"ลุย","พรั้ง":"พั้ง",
"พลัดพราก":"ปัดพาก","พลัน":"พัน","พลับ":"บ่ะพลับ","พลับจีน":"บ่ะกล้วยห้อ","พลับพลึง":"ป่านเถื่อน",
"พลั่ว":"ชุ้น","พล่า":"ลาบ","พลาด":"พะแล็ด","พล่าน":"สุ่นบุ่น","พล่าม":"ลว่าม",
"พลาย":"พู้","พลิก":"ปิ้น","พลึง":"เหมือดควาย","พลุ":"บอกไฟดาว","พลุกพล่าน":"สะลว้าย",
"พลุ่ง":"ปุ่ง","พลูแก":"รางคาว","พลูแค":"ผักคาวทอง","พวงทองเครือ":"ระคนทอง","พวง":"พุก",
"พวงม่วง":"ฟองสมุทร","พวงมาลัย":"ขะพวงดอก","พ่วง":"ทาม","พวน":"เชือกพวน","พอ":"กุ้ม",
"พ่อ":"ป้อ","พ่อเกลอ":"ป้อเสี่ยว","พ่อตา":"ป้อเมีย","พ่อบ้าน":"ป้อเรือน","พ่อเลี้ยง":"ป้อน้า",
"พ่อหม้าย":"ป้อร้าง","พอดีพอร้าย":"ปอฮ้ายปอดี","พ้อ":"ท้อ","พอก":"ป้อ","พ้อง":"พรวม",
"พอดี":"ปอดี","พ้อม":"ปุ่ม","พอเหมาะ":"กำพอ","พะยอม":"คะยอม","พะยูง":"ต้นเกล็ด",
"พะอง":"เกิน","พะไล":"พะไล","พาโล":"เพไล","พะวา":"บ้อง","พัก":"ยั้ง",
"พังกา":"พังกา","พังพาบ":"เมิบจักเล้อ","พังเพย":"คำลอย","พัด":"วี","พัดโบก":"พัดพ้าว",
"พัน":"หวัน","พันจำ":"มะจำโรง","พันไฉน":"ปอเต่าไห้","พันทาง":"น้ำผ่า","พันงู":"หญ้าควยงู",
"พันงูเขียว":"หญ้าหนวดเสือ","พันงูตัวผู้":"สารข้าวตอก","พันงูขาว":"ควยงูขาว","พันงูแดง":"ควยงูแดง",
"พับ":"ทบ","พับเพียบ":"ม็อบแม็บ","พัสดี":"นายคำคอก","พาง":"พาง","พาดพิง":"พะพาน",
"พาน":"พ้าน","พาย":"ฟาย","พายเรือ":"ฟายเรือ","พาล":"พาโล","พาลมฤค":"พาลมิคา",
"พำลา":"ช้างขึด","พิกล":"งึด","พิกัน":"ต้นแก้วป่า","พิการ":"เสียองคะ","พิกุล":"ต้นแก้ว",
"พิกุลป่า":"ตะเคียนเผือก","พิง":"อิง","พิณ":"ซึง","พิณพาทย์":"พาทย์ค้อง","พิทยาธร":"ทิพยาธร",
"พิมพิสาร":"พิมสาร",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฟ
"ฟก":"ซ้ำ", "ฟกซ้ำ":"ซุซ้ำ", "ฟอง":"แก่น", "ฟ่อง":"โม่ง", "ฟ้อง":"ส่อ",
"ฟัก":"บ่ะฟัก", "ฟักเขียว":"บ่ะฟักหม่น", "ฟกทอง":"บ่ะฟักแก้ว", "ฟักเหลือง":"บ่ะฟักแก้ว", "ฟัน":"เขี้ยว",
"ฟั่น":"ฝั้น", "ฟั่นเทียน":"สีเทียน", "ฟั่นเฟือน":"หลงไหล", "ฟาก":"ฝั่ง", "ฟาง":"เฟื่อง",
"ฟ่าง":"ข้าวป้าง", "ฟุ่มเฟือย":"อ่วย", "ฟูก":"สะลี", "เฟะ":"เฟอะ", "เฟิน":"กูดบก",
"เฟินโพธิ์":"กูดฮุ้งคาว", "เฟือยนก":"ป้อค้าตีเมีย", "เฟือย":"เล้ย", "แฟบ":"แบน", "ไฟพะเนียง":"บอกไฟดอก",
"ไฟพุ่ม":"บอกไฟเทียน", "ไฟฟ้าเดินทาง":"โคมแก็ส", "ไฟลามทุ่ง":"มะเร็งลามทุ่ง", "เฟินเกล็ดหอย":"กูดเบี้ย", "เฟินตีนมังกร":"กูดเครือ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ภ
"ภมร":"ภิมร", "ภรรยา":"เมีย", "ภาพ":"ฮูป", "ภาย":"พาย", "ภิกษุ":"ตุ๊เจ้า",
"ภู่":"พู่", "ภูเขา":"ดอย", "โภชนาการ":"โภชนะอาหาร",


///////////////////////////////////////////////////////////////////////////////////////////////////// ม
"มคธ": "มคธะ", "มงกุฏ": "ขะโจม", "มงคล": "มังคละ", "มณฑา": "บุญทา", "มดเข็ม": "มดตะนอย",
"มดแดง": "มดส้ม", "มดตาลาน": "มดน้ำอ้อย", "มดน้ำพอง": "มดหัวเหล็ก", "มดรี่": "มดฮี่", "มดลูก": "ง้วนลูก",
"มดเล็ก": "มดแดงหน้อย", "มนตรี": "มนถี", "มรณภาพ": "อนิจจะ", "มรรค": "มัคคา", "มฤค": "มิคา",
"มฤคทายวัน": "มิคทายวัน", "มฤตยู": "มัจจุราช", "มวน": "เบ้า", "มวนบุหรี่": "พันปุรี", "ม้วน": "ลุน",
"มหรสพ": "มหรสะหรบ", "มหาบพิตร": "มหาราช", "มหาละลวย": "คาถาสาวหุม", "มหาหิงค์": "หินแดง", "มโหรทึก": "ค้องถบ",
"มองคร่อ": "โรคผอมแห้ง", "มอญ": "เมง", "ม่อต่อ": "เมาะเทาะ", "มอบภาระ": "ไว้หนัก", "มอมเหล้า": "ตึกเหล้า",
"มะกรูด": "บ่ะขูด", "มะกล่ำเครือ": "บ่ะกล่ำต๋าไก่", "มะกล่ำตาช้าง": "บ่ะกล่ำต๋าควาย", "มะกอกเลื่อม": "บ่ะเกิ้ม", "มะกอกฝรั่ง": "บ่ะกอกเทศ",
"มะกอกพราน": "บ่ะกอกฟาน", "มะกา": "กองแกบ", "มะกาเครือ": "หัสอับเครือ", "หัสคุณผี": "หัสอับเครือ", "มะเกลือเลือด": "เปือยปัง",
"มะขวิด": "มากวิด", "มะขามเทศ": "บ่ะขามโครง", "มะเขือขื่น": "บ่ะเขื่อแจ้", "มะเขือเครือ": "บ่ะแคว้นเครือ", "มะเขือเทศ": "บ่ะเขือส้ม",
"มะเขือนมนาง": "บ่ะเขือละโว้", "มะเขือนางพญา": "บ่ะเขือหำแพะ", "มะเขือเปราะ": "บ่ะเขือผ่อย", "มะเขือแพะ": "บ่ะเขือแจ้แพะ", "มะเขือพวง": "บ่ะแคว้งกุลา",
"มะเขือมอญ": "บ่ะเขือมื่น", "มะเขือยาว": "บ่ะเขือหำม้า", "มะเขือละไว้": "บ่ะเขือหำไก่", "มะค่าแต้": "บ่ะค่าหนาม", "มะค่าใหญ่": "บ่ะค่าหลวง",
"มะคำไก่": "ต้นยาแก้", "มะคำดีควาย": "บ่ะซัก", "มะงั่ว": "บ่ะงั่ว", "มะซ่าน": "บ่ะส้าน", "มะเดื่อชุมพร": "บ่ะเดื่อเกลี้ยง",
"มะเดื่อเถา": "บ่ะเดื่อทิน", "มะเดื่อดิน": "บ่ะเดื่อทิน", "มะเดื่อปล้อง": "บ่ะเดื่อปล่อง", "มะเดื่อปล้องหิน": "บ่ะหนอดน้ำ", "มะเดื่อหว้า": "บ่ะเดื่อวา",
"มะตาด": "บ่ะเหียง", "มะตูม": "บ่ะพิน", "มะนาวผี": "บ่ะลิว", "มะปราง": "บ่ะผาง", "มะปรางเปรี้ยว": "บ่ะผางส้ม",
"มะฝ่อ": "บ่ะปอบ", "มะพลับดง": "เฮือนกวาง", "มะพร้าว": "บ่ะป้าว", "มะพร้าวสีดา": "บ่ะป้าวเต่า", "มะพร้าวอ่อน": "บ่ะป้าวหนุ่ม",
"มะพลับ": "บ่ะโก", "มะพลับทอง": "บ่ะคับทอง", "มะไฝนกคุ้ม": "หญ้ารักนา", "มะม่วงกะล่อนเขียว": "บ่ะม่วงป้อม", "มะม่วงกะล่อนทอง": "บ่ะม่วงคะย้า",
"มะม่วงช้างเหยียบ": "บ่ะม่วงแพบ", "มะม่วงมัน": "บ่ะม่วงคุ", "มะม่วงสามเสน": "บ่ะม่วงเสน", "มะม่วงหิมพานต์": "บ่ะม่วนสิงโห", "มะยง": "บ่ะผางส้ม",
"มะระจีน": "บ่ะเหิด", "มะระไทย": "บ่ะห่อย", "มะริด": "บ่ะลิดไม้", "มะรึน": "วันฮือ", "มะรุม": "บ่ะค้อนก้อม",
"มะเรื่อง": "วันหนึ่ง", "มะละกอ": "บ่ะก๋วยเทศ", "มะลิป่า": "เสี้ยวตัน", "มะลืน": "บ่ะมื่น", "มะแว้ง": "บ่ะแคว้งขม",
"มะแว้งเครือ": "บ่ะแคว้งเครือ", "มะหวด": "บ่ะเท่า", "มะหาดน้ำ": "ปอแฮก", "มะอึก": "บ่ะปู่", "มะเหงก": "บ่ะกอก",
"มะ": "บ่ะ", "มักคั๊ก": "มึคึ", "มั่งคั่ง": "มั่งมี", "มัคนายก": "ศรัทธาเค้า", "มัคนายิกา": "ศรัทธาเค้า",
"มังกร": "ลวง", "มัด": "ผูก", "มันแกว": "มันแกวลาว", "มันขมิ้น": "บ่ะมู่", "มันเครือ": "บ่ะกิ้ง",
"มันเทศ": "มันแกว", "มันฝรั่ง": "มันอีลู้", "มันมือเสือ": "มันจิงอง", "มันสำปะหลัง": "ต้างแดง", "มันสำโรง": "ต้างขาว",
"มั่น": "หมั้น", "มั่ว": "หมั้ว", "มั่วสุม": "สุมหัว", "มาก": "นัก", "มากมาย": "นักหลาย",
"มาตรว่า": "แม้นว่า", "มาน": "มานอุง", "ม่าน": "ผ้ากั้ง", "ม่าย": "หม้าย", "มารดา": "แม่",
"ม้าล่อ": "ผ้าง", "มาลัย": "พวงดอก", "ม่าเหมี่ยว": "แมงใบ้", "มิอย่าเลย": "บ่อย่าชะแล", "มิจฉาทิฎฐิ": "มิฏฉาทิฏฐี",
"มิฉะนั้น": "บ่อั้น", "มิเป็นไร": "บ่เป๋นหยัง", "มิได้": "บ่ได้", "มิหนำ": "บ่แหนม", "มินหม้อ": "หมิ่นหม้อ",
"มีแก่ใจ": "มีน้ำใจ", "มีอันจะกิน": "ปอมีปอกิ๋น", "มีครรภ์": "มาน", "มีท้อง": "มาน", "มีระดู": "เป๋นตั๋วบ่ดี",
"มึง": "คิง", "มึนตา": "มื้นต๋า", "มือกาว": "มือยาว", "มือแป": "มืององ", "มือผี": "หว้านไก่ไห้",
"มื้อ": "คาบ", "มุทลุ": "ดุดัน", "มุ่งหมาย": "หมายใจ", "มุ้ง": "สุด", "มุ่น": "หมวด",
"มุม" : "แจ่ง", "มูรธาภิเษก" : "มุทธาภิกเสก", "มูล" : "ขี้", "เมตไตรย" : "เมตไตย", "เม่น" : "เหม้น",
"เม้มปาก" : "ม้ำปาก", "เมล็ด" : "เม็ด", "เม่า" : "ข้าวเหม่า", "เมาะ" : "มักว่า", "เมิน" : "เมิน",
"เมี่ยง" : "เหมี่ยง", "เมียพลาง" : "เมียห่อข้าว", "เมื่อครั้ง" : "เช่น", "เมื่อนั้น" : "ยามนั้น", "เมือง" : "เวียง",
"เมื่อย" : "อิด", "แม่น้ำ" : "น้ำแม่", "แม่แปรก" : "แม่โป่", "แม่หม้าย" : "แม่ร้าง", "แม่มือ" : "มือนิ้วโค้",
"แม่ย่านาง" : "นางไม้", "แม่ยาย" : "แม่เมีย", "แม่ย่าว" : "แม่เรือน", "แม่เลี้ยง" : "แม่น้า", "แม่โว้ย" : "แม่เฮ้ย",
"แม่เหล็ก" : "โพรงกินเหล็ก", "แม้" : "แม้นว่า", "แม้ว่า" : "แม้นว่า", "แมง" : "แมง", "แมลง" : "แมง",
"แมงช้าง" : "แมงขี้ช้าง", "ไม้พลอง" : "ไม้ค้อน", "ไม้วา" : "ไม้มอก", "ไม้วัด" : "ไม้มอก", "ไม้สอย" : "ไม้ส้าว",
"ไม้กวาด" : "ยู", "ไม้ตะบอง" : "ไม้ค้อน", "ไม้ตีพริก" : "แกนครก", "ไมยราพ" : "หญ้าจิยอบ", "ไม้เรียว" : "ไม้แส้",
"ไม้ขีดไฟ" : "กับไฟ", "ไม้ขีดไฟเบนชิน" : "ไฟแก็ส", "ไม้ตายยืนต้น" : "ไม้ตายขาน", "ไม้ลูกตั้ง" : "เสาฝา", "ไม้เลียบ" : "ผักเฮือด",


///////////////////////////////////////////////////////////////////////////////////////////////////// ย
"ยก" : "ยก", "ยกโทษ" : "อดโทษ", "ยกย่อง" : "ยกยอ", "ยกเรือน" : "ปลูกเรือน", "ยงโย่" : "หย่องเหยาะ",
"ย่น" : "หย้น", "ยมบาล" : "ยมภิบาล", "ยวดยาน" : "ยัวยาน", "ยวน" : "ยวน", "ยอ" : "สุ่ย",
"ย่อ" : "หย้อ", "ยอป่า" : "สะลักป่า", "ย่อหย่อน" : "ถดถอย", "ยอก" : "ขัด", "ย่อ" : "หย่อง",
"ย่องเบา" : "ลักหย่อง", "ยองๆ" : "หย่องเขาะ", "ยอดไม้เถา" : "แน้", "ย่อม" : "ย่อม", "ย้อย" : "เต่ย",
"ยกย้าย" : "คร้าย", "ยักย้าย" : "ยกย้าย", "ยัก" : "จัก", "ยังชั่ว" : "ยังเเควน", "ยั่งยืน" : "ยืนยาว",
"ยัด" : "น่ำ", "ยัน" : "ยัน", "ยั่น" : "หย้าน", "ยับ" : "ยับ", "ยั่ว" : "จุ",
"ยัวรยาตร" : "ยอริยาตร", "ยุรยาตร" : "ยอริยาตร", "ยาระบาย" : "ยารุ", "ยาสมุนไพร" : "ยารากไม้", "ยาแก้ท้องร่วง" : "ยาตุด",
"ยาบำรุงธาตุ" : "ยาธาตุ", "ย่า" : "แม่อุ๊ย", "ยาย" : "แม่อุ๊ย", "ย่าทวด" : "แม่หม่อน", "ยายทวด" : "แม่หม่อน",
"ย่านาง" : "เครือนาง", "ยางแดง" : "ยางพราย", "ยางน่อง" : "ยางหน้อง", "ยางโอน" : "ยางพราย", "ย่าง" : "หย้าง",
"ย่างเท้า" : "ยกย่าง", "ย่างทราย" : "เขายางทราย", "ยาตรา" : "ยาดตะหรา", "ยาน" : "เต่ย", "ยาพิษ" : "ง้วนสาร",
"ย่าม" : "ถง", "ยามตูดชาย" : "ยามตูดช้าย", "ย้าย" : "คร้าย", "ย่าหยา" : "ผักกูดเน่า", "ยาวรี" : "เถี่ยว",
"ยำเหนื้อ" : "ยำชิ้น", "ย่ำ" : "ซอก", "ย่ำค่ำ" : "แลง", "ย้ำ" : "ซ้ำ", "ย้ำรุ่ง" : "ใกล้แจ้ง",
"ยิ่ง" : "ซ้ำ", "ยิงฟัน" : "ยี่เขี้ยว", "ยิ่งยวด" : "ล้ำยิ่ง", "ยิ้ม" : "ยว้าย", "ยิ้มเเฉ่ง" : "ยว้ายสี่แจ่ง",
"ยิ้มแย้ม" : "ยว้ายแย้ม", "ยิ้มหัว" : "ใคร่หัว", "ยี่เข่ง" : "ต้นยี่เข่ง", "ยี่โถ" : "อินโถ", "ยี่สง" : "บ่ะถั่วดิน",
"ยี่สุ่น" : "ยี่สุ่น", "ยี่หร่า" : "อีหร่า", "ยี่หุบ" : "จีหุบ", "ยี่โถปี่นัง" : "ง้วนตากหงาย", "ยิบๆ" : "หยับๆ",
"ยึด" : "จับ", "ยี่โถฝรั่ง" : "แซะศาลา", "ยืด" : "หยืด", "ยืนคำศีร์ษะ" : "ยืนงำหัว", "ยุ" : "จุ",
"ยุคนธร" : "ยุคันธร", "ยุ่ง" : "หยุ้ง", "ยุ่งยิ่" : "หยุ้งหยิ้ง", "ยุงปัด" : "หญ้าขัด", "ยุ้งข้าว" : "หลองข้าว",
"ยุด" : "จ่อง", "ยุ่ย" : "พุ่ย", "เย้" : "เส้", "เย็น" : "แลง", "เยซู" : "พระเยซู",
"เย็บ" : "หยิบ", "เย้ย" : "เพี้ยก", "เยอะแยะ" : "เป่อเลอะ", "เย่อหยิ่ง" : "จองหอง", "เย้า" : "ย้าว",
"เยาะเย้ย" : "เยาะไย", "เยียใด" : "จะใด", "เยี่ยงอย่าง" : "แซง", "เยี่ยมเยือน" : "ไช", "เยี่ยม" : "หยื้อ",
"เยื่อ" : "เจื้อ", "เยื้อน" : "เอื้อน", "แยง" : "ส็วก", "แย่ง" : "ลู่", "แย้ม" : "ยว้าย",
"แย้มพราย" : "ขยาย", "แยแส" : "อ้อนหา", "แยะ" : "เป่อเลอะ", "โย" : "โยเย", "โยกตัว" : "สว่ายตั๋ว",
"โยกย้าย" : "ขดคร้าย", "โยกเย้" : "เสิ้ง", "โย่งเย่ง" : "โหย้งเหย้ง", "โย่งโย่" : "โย่งโหยะ", "โยชน์" : "โยชนะ",
"โยทะกา" : "เค็ดเค้า", "โยน" : "โจ้ง", "โยมบวชผู้ชาย" : "พ่อออก", "โยมบวชผู้หญิง" : "แม่ออก", "โยมผู้ชาย" : "โยมพ่อ",
"โยมผู้หญิง" : "โยมแม่", "โยมอุปฐาก" : "พ่อออกแม่ออก", "โยมสงฆ์" : "พ่อวัดแม่วัด", "ไย" : "จะได", "ไยดี" : "เอ่ยเฮ่ย",
"โยนทิ้ง" : "โย่งคว่าง",


///////////////////////////////////////////////////////////////////////////////////////////////////// ร
"รจนา": "ริดจะหนา", "รด": "หด", "รถจักรยาน": "รถถีบ", "รถจักรยานชาย": "รถปู้", "รถจักรยานหญิง": "รถแม่",
"รดน้ำ": "หดน้ำ", "ร่น": "ขด", "รบกวน": "กวนคุย", "ร่ม": "จ้อง", "รวด": "ฮวด",
"รวง": "งวง", "ร่วง": "หลัวะ", "ร่วงโรย": "ฮ่วงโฮย", "ร่วงหล่น": "หลัวะหล่น", "รวดเร็ว": "เร็วปัน",
"รวน": "ขั้ว", "ร่วน": "พุ่ย", "รวบรวม": "ฮอม", "รวมกัน": "เปาะกัน", "รโหฐาน": "สะแวก",
"รอ": "ลอ", "รอคอย": "ถ้า", "รอหน้า": "สู้หน้า", "รองช้ำ": "ขี้โม้", "รองเท้า": "เกิบ",
"รองเท้านารี": "เอื้องคางกบ", "ร่อง": "ช่อง", "ร้องเรียน": "สู่ชู", "ร้องเพลง": "ฮ้องเพลง", "ร้องเรียก": "ฮ้อง",
"ร้องไห้": "ไห้", "รอนๆ": "เหลือๆ", "รอด": "ฮอด", "ร่อน": "เหิง", "ร่อนทอง": "หว้านร่อนทอง",
"รอม": "หง้อม", "รอมชอม": "ออมชอม", "รอย": "ฮอย", "ร่อย": "ฮ่อย", "ร้อย": "ฮ้อย",
"ร่อยหลอ": "หมด", "ระกา": "ปี่เล้า", "ระกำ": "ไม้ฮองแฮง", "ระคาง": "ตุ้มระคาง", "ระคาย": "ค่าย",
"ระแคะระคาย": "เค้าเงื่อน", "ระฆัง": "ระกัง", "ระงม": "รม", "ระงับ": "ฮ่ำงับ", "ระเดียง": "สายระเบียง",
"ระทม": "หม่นไหม้", "ระนาว": "นาว", "ระเนียด": "ลำทับ", "ระแนง": "ก้านฝ้า", "ระบบ": "แบบเบ้า",
"ระบมบาตร": "รมบาตร", "ระบม": "ช้ำ", "ระบัด": "สะบัด", "ระบาด": "แพร่", "ระบำ": "ฟ้อนระบำ",
"ระบือ": "ลือ", "ระบุ": "บ่ง", "ระย่อม": "หน้าหย่อมตี๋นหมา", "ระยับ": "ยิบยับ", "ระยะทาง": "คราวทาง",
"ระยาบ": "ยาบ", "ระเร": "ระเว", "ระลึก": "ระนึก", "ระเหระหน": "ระเวเหหน", "ระหง": "โขง",
"ระหว่าง": "หว่าง", "ระหองระแหง": "หองแหง", "ระหาย": "ขะหาย", "ระเหย": "เหย", "ระแหง": "แตกขาบ",
"รัก": "ฮัก", "รักซ้อน": "ฮักซ้อน", "รักหมู": "ฮักพู้", "รักแร้": "เก๊าแฮ้", "รั้งไว้": "ฮั้งไว้",
"รังเกียจ": "กิเหลียด", "รังแก": "ค่ำ", "รัดประคดอก": "ผ้ารัดคอ", "รัดประคดเอว": "ผ้ารัดเอว", "รัดประคน": "สายระคน",
"รั้น": "ดื้อด้าน", "รัว": "ซ่ำ", "รา": "ฮา", "ร้า": "ฮ้า", "ราคา": "ค่า",
"ราง": "หล้าง", "ร้าง": "ห่าง", "ร่างกาย": "ฮ่ายก๋าย", "รางจืด": "เครือเขาเขียว", "รางแดง": "เครือค้องแกบ",
"ราน้ำ": "หะน้ำ", "ราปีก": "วาปีก", "รามือ": "ลามือ", "ราไฟ": "ถะไฟ", "ร่าเริง": "ม่วนงัน",
"ราเริด": "เลิกลา", "ราชคฤห์": "ราชคหะ", "ราชดัด": "บ่ะดีควาย", "ราชพฤกษ์": "กัลปพฤกษ์", "ราชินี": "จอมเทวี",
"ร่าน": "ห่าน", "ราบ": "เปียง", "ร่าย": "คำจ่ม", "รายทาง": "ยายทาง", "ร่าวๆ": "ด่าวๆ",
"ร้าว": "แหง", "ราวกับ": "เหมือนดั่ง", "ราศี": "ราศี", "รำ": "ฟ้อนรำ", "รำพัน": "จ่ม",
"รำแพน": "ฟ้อน", "รำพึง": "ร่ำเพิง", "รำลึก": "ระนึก", "ริ": "จ่าน", "ริเริ่ม": "ก่อเก๊า",
"ริษยา": "อิสสา", "รีๆขวางๆ": "หนๆขวางๆ", "รีด": "นีด", "รีบ": "ฟั่ง", "รีบรุด": "ฟั่งฟ้าว",
"รื่นเริง": "ม่วนงัน", "รื้อ": "เท", "รุ": "ถุ", "รุงรัง": "ซุกซัง", "รุ้ง": "อี่ฮุ้ง",
"รุ่งเรือง": "ก้านกุ่ง", "รุด": "ฟั่ง", "รุน": "ยู้", "รุ่น": "แถ่ว", "รุ่นตะกอ": "ขึ้นแถ่ว",
"รุ่นราว": "ค้าวเค้ว", "รุบรู่": "ฮุบฮู่", "รู้คิด": "ฮู้กึด", "รู้ตัว": "ฮู้คิง", "รู้ที": "ฮู้ตัน",
"รูปี": "เงินแถบ", "รู้สึก": "ฮู้สึก", "เร่": "สอด", "เร่ร่อน": "นอนแรมแกมมื้อ", "เรไร": "แมงใย",
"เร็ว": "โวย", "เร่ว": "เหร้ว", "เรอ": "เออะ", "เร่อร่า": "เหล้อๆเซอๆ", "เรา": "เฮา",
"เร้า": "รบ", "เริด": "เลิดลา", "เริ่ม": "ตั้งเก๊า", "เรียก": "ฮ้อง", "เรื้อรัง": "เฮื้อฮัง",
"เรือนจำ": "คอก", "เรียกว่า": "ฮ้องว่า", "เรียง": "เฮียง", "เรี่ยราด": "เฮี่ยเบล๋อ", "เรียว": "เถียว",
"เรือยนต์": "สะเพา", "เรืออีโปง": "เฮือกาบปลี", "เรื้อน": "ทูด", "เรื้อนกวาง": "ตับเต่าต้น", "เรื่อย": "ติก",
"แร่": "หล่อ", "แรกนาขวัญ": "แรกนา", "แรง": "แฮง", "แร้นแค้น": "เปียะฮำ", "โร": "อุ้งพุ้ง",
"โรค": "โรค", "โรคกระสัย": "โรคมโหก", "โรคตาลขโมย": "ด้อย", "โรคไส้ติ่ง": "โรคไส้ตัน", "โรคออหิวาตก์": "โรคฮ่า",
"โรงนา": "ห้างนา", "โรงพยาบาล": "โฮงยา", "โรมรัน": "ต่อสู้", "โรย": "ฮุย", "โรคอยู่ไฟไม่ได้": "ผิดเดือน",
"โรงธาร": "หอคำ", "ไร่หลวง": "ไร่ภาษี", "โรง": "โฮง",


///////////////////////////////////////////////////////////////////////////////////////////////////// ล
"ลงกา": "ลังกา", "ลงท้อง": "หลุต๊อง", "ลงพุง": "ปูมหลวง", "ลงรัก": "ทารัก", "ลงราก": "ฮากเลือด",
"ลงแขก": "เอาเเรง", "ลงแดง": "หลุเลือด", "ล่ม": "หล้ม", "ล้ม": "ท่าว", "ลมบ้าหมู": "ลมกิดกิ๋ว",
"ล้มแผ่": "ท่าวหงาย", "ลมเพลมพัด": "โป่งยำ", "ล่วงขื่อ": "ลวงขื่อ", "ล่วงแป": "ลวงแป", "ล้วง": "จก",
"ลวดลาย": "ดอก", "ล้วน": "ล้อน", "ล่อ": "หล้อ", "ล้อ": "แหว่น", "ลอก": "ลืบ",
"ลอกเลน": "รื้อเปอะ", "ลอง": "ลอง", "ล่อง": "ร่อง", "ล่องชาด": "ทาหาง", "ล่องถุน": "พื้นเรือน",
"ล่องหน": "หายตั๋ว", "ลองไน": "แมงไย", "ล่อน": "หล้อน", "ล้อกวางต้ง": "อี่กลิ้ง", "ลอบ": "ไซลอบ",
"ล้อมปรวด": "ต้นล้อมแรต", "ลอมพอก": "ขะโจก", "ลอยกระทง": "ลอยประทีป", "ลอยชาย": "เตะเตี่ยว", "ละบอง": "ตุ่มเหงื่อ",
"ละบองไฟ": "ตุ่มไฟ", "ละม้าย": "คล้าย", "ละมุด": "บ่ะมุด", "ละเมอ": "กั๊ง", "ละเมาะ": "ลอม",
"ละเมิด": "เกินเหลือ", "ละโมภ": "อาโภค", "ละลอก": "บ่ะเฮ็งไข่ป๋า", "ละลาบละล้วง": "ล่วงเกิน", "ละลาย": "แทว",
"ละล้าละลัง": "หนๆคืนๆ", "ละล่ำละลัก": "กุกๆกักๆ", "ละเลง": "ทา", "ละเลย": "ลาสา", "ละว้า": "ลัวะ",
"ละหาน": "หาน", "ละหุ่ง": "บ่ะหุ่ง", "ละเหี่ย": "อิดอ่อน", "ละเอียดละออ": "ถี่ถ้วน", "ลักจั่น": "บอกน้ำ",
"ลักปิดลักเปิด": "เลือดออกเขี้ยว", "ลักยิ้ม": "แก้มบ่อง", "ลัง": "หีบ", "ลังคี": "ละแม้", "ลังถึง": "ไหซึง",
"ลันไต": "สาด", "ลั่นทม": "จำปาลาว", "ลับมีด": "ฝนมีด", "ลับแล": "หับแฮ", "ล่า": "หล้า",
"ล่าง": "ลุ่ม", "ล้าง": "ซ่วย", "ล้างผลาญ": "ค่ำงำ", "ลาด": "ลวาด", "ลาดเขา": "เถิ้มดอย",
"ลาดชัน": "หลิ่ง", "ลาดผ้า": "เจือผ้า", "ลาน": "ข่วง", "ลานตา": "ลานตา", "ลาพอน": "หละพอน",
"ลามก": "ลามกกะ", "ลายแทง": "บัตถา", "ล่าสัตว์": "ไล่เหล่า", "ลำเจียก": "เกียง", "ลำดวน": "หอมนวล",
"ลำดับนั้น": "ถัดนั้น", "ลำปิด": "ไค้มด", "ลำพอง": "อืน", "ลำพัง": "เดียว", "ลำพู": "ต้างหลวง",
"ลำแพน": "สาดเติ้ม", "ลำโพง": "ลำโพง", "ลำมะลอก": "ไม้หกดำ", "ลำใย": "บ่ะลำใย", "ลำเอียง": "เข้าข้าง",
"ลิง": "วอก", "ลิ่นต้น": "หญ้าสองปล้อง", "ลิ้นกระบือ": "เอื้องนางฮุ้ง", "ลิ้นมังกร": "ลิ้นจะเข้", "ลิ่ม": "หลิ้ม",
"ลึก": "เลิ้ก", "ลึน": "มื่น", "ลื่นพลาด": "พะเลิด", "ลืมตา": "มืยต๋า", "ลื่อ": "หลือ",
"ลุกลน": "หลุกหลิก", "ลุ่น": "หุ้น", "ลุ่ม": "ล้อง", "ลุ่มๆดอนๆ": "สูงๆต่ำๆ", "ลุ่มหลง": "หลงไหล",
"ลุ่ย": "หลุ้ย", "ลู่": "หลู้", "ลูก": "ลูก", "ลูกกก": "ลูกเค้า", "ลูกกรอก": "ลูกกอก",
"ลูกกระเดือก": "คอหอย", "ลูกกระดุม": "บ่ะต่อม", "ลูกกระสุน": "ลูกกง", "ลูกกัลปพฤกษ์": "ลูกกาละพฤกษ์", "ลูกขุน": "ตะลาการ",
"ลูกเขย": "ลูกชาย", "ลูกครอก": "คนโฮง", "ลูกครึ่ง": "น้ำผ่า", "ลูกคลัด": "ไม้แขว้ง", "ลูกคลื่น": "ฟองน้ำ",
"ลูกคั่น": "คันนา", "ลูกเคล้า": "หญ้า", "ลูกช่วง": "ลูกน้อง", "ลูกช้าง": "เหลนน้อย", "ลูกชิด": "ลูกตาว",
"ลูกโซ่": "ลูกโส้", "ลูกดิ่ง": "บ่ะกุ๊น", "ลูกโดด": "ลูกโทน", "ลูกตุ้ม": "ทอย", "ลูกเต๋า": "บ่ะแก่ว",
"ลูกใต้ใบ": "ขางจำไพ", "ลูกน้อง": "ลูกน้องปล้องปลาย", "ลูกน้ำ": "หนอนน้ำ", "ลูกนิมิต": "บ่ะหินสีมา", "ลูกบาศก์": "บ่ะแก่ว",
"ลูกบุญธรรม": "ลูกเลี้ยง", "ลูกประคำ": "บ่ะคำ", "ลูกปัทม์": "ลูกปัดคำ", "ลูกปราย": "ลูกกำผาย", "ลูกพรวนเล็ก": "บ่ะหิ่ง",
"ลูกพรวนใหญ่": "บ่ะขะโหล้ง", "ลูกระมาศ": "บ่ะแข่น", "ลูกรัง": "แฮ่", "ลูกรุ่ย": "แก้วระย้า", "ลูกล่า": "ลูกหล้า",
"ลูกเล็กเด็กแดง": "ลูกหน้อยห้อยบ่า", "ลูกแล่ง": "ลูกน้อย", "ลูกสมุน": "ลูกน้อง", "ลูกสะบ้า": "บ่ะบ้าหัวเข่า", "ลูกสะไภ้": "ลูกยิง",
"ลูกธนู":"ลูกธนู", "ลูกเห็บ":"บ่ะเห็บ", "ลูกอม":"ยันต์อม", "ลูกอัณฑะ":"ขะหลำ", "ลูกโม่":"ลูกโหม้",
"เล็ก":"หน้อย", "เล็กน้อย":"หนิดหน้อย", "เล็กมาก":"หนิ้ว", "เล็ง":"แน", "เลน":"เปอะ",
"เล่น":"เหล้น", "เล่นการพนัน":"เหล้นพะนัน", "เล่นกาฟักไข่":"เหล้นขี้เต่า", "เล่งช่วงชัย":"เหล้นไข่โจ้น", "เล่นชักคะเย่อ":"เหล้นชักส้าว",
"เล่นซ่อนหา":"เหล้นอุ่มลี้", "เล่นต้องเต":"เหล้นโดล่า", "เล่นปิดตาตีปิป":"เหล้นผีบ้าหมาว้อ", "เล่นเสือกินวัว":"เหล้นแสงสี่", "เล่นเสือข้ามห้วย":"เหล้นวัดแค่ง",
"เล่นเสือตกถัง":"เหล้นแสงตาวัน", "เล่นหมากแยก":"เหล้นแสงแปด", "เล่นเอาเถิด":"แหล้นแนด", "เล็บมือนาง":"ช้ามั่ง", "เล็บเหยี่ยว":"บ่ะตันขอ",
"เล่ม":"เหล้ม", "เลย":"ลวด", "เลว":"ต่ำช้า", "เลหลัง":"เลหลั่ง", "เล่อล่า":"เหล้อๆเชอๆ",
"เลอะเทอะ":"เพอะ", "เละ":"แหลว", "เล้า":"คอก", "เลินเล่อ":"ลาสา", "เลี่ยง":"หลบ",
"เลี้ยง":"เลี้ยง", "เลียงผา":"เยียงผา", "เลียน":"เฮียบ", "เลียนแบบ":"เฮียบ", "เลี่ยน":"เอียน",
"เลียบ":"เหียบ", "เลี่ยม":"เคี่ยม", "เลืองลือ":"ลือซา", "เลื่อน":"ค้าย", "เลื่อม":"เหลื้อม",
"เลื่อย":"เลื่อย", "เลื้อย":"เล้ย", "แล":"ผ่อ", "แล่":"เถือ", "แลง":"แมง",
"แล่ง":"แหล้ง", "แล่น":"ล่น", "แลบ":"แมบ", "โล้":"สิก", "โลกบาล":"โลกบาล",
"โลง":"หล้อง", "โลด":"เหเหมดควาย", "โลน":"หยาบ", "โล้น":"หมด", "โลภ":"โลภ",
"ไล่เลี่ย":"ลำไล",


///////////////////////////////////////////////////////////////////////////////////////////////////// ว
"วง":"กวง", "วรรณยุต":"เหยาะ", "วอ":"คายหาม", "วอกแวก":"หล็อกแหล็ก", "ว่องไว":"ว่อง",
"วอน":"สะออน", "ว่อน":"ยาบ", "วะ":"ว่า", "วะว่อน":"ยะยาบ", "วัง":"คุ้ม",
"วังเวง":"ระเวง", "วัณโรค":"ท้องฝี", "วัณโรคภายใน":"พราย", "วัด":"วัด", "วันพระ":"วันศิล",
"วันพรุ่งนี้":"วันพูก", "วันเพ็ญ":"วันเพ็ง", "วันมหาสงกรานต์":"วันสังขานต์ล่อง", "วันมะรือ":"วันฮือ", "วันมะเลื่อง":"วันนึ่ง",
"วันยังค่ำ":"วันค่ำ", "วันวาน":"วันวา", "วันสุกดิบ":"วันดา", "วันหลัง":"วันหน้า", "วันเนาว์":"วันเน่า",
"วันเฉลิงศก":"วันพระยาวัน", "วัว":"งัง", "วาง":"ยอง", "วาน":"วันวา", "วานซืน":"วันซืน",
"ว่าน":"หว้าน", "ว่านกีบม้า":"กีบม้าลม", "ว่านจรเข้":"หว้านดับไฟ", "ว่านธรณีสาร":"บ่ะขามป้อมดิน", "ว่านน้ำ":"รางคาวบ้าน",
"ว่านน้ำต้น":"ขางขาว", "ว่านพระฉิม":"จีดอยด้วน", "ว่านเพชรหึง":"ตั๊บตาน", "ว่านแม่ยับ":"ดอกหางช้าง", "ว่านรางคำ":"เข้าหมิ้นขึ้น",
"ว่านลิ้นเหี่ย":"หว้านจะเข้", "ว่านเศรษฐี":"หว้านนกขุ้ม", "ว่านสากเหล็ก":"กูดพ้าว", "ว่านหอยแดง":"หว้านหมาก", "ว่านหางช้าง":"เคียะหางช้าง",
"วาย":"หล้ง", "ว่าย":"หว้าย", "วิกลจริต":"เสียจิต", "วิงเวียน":"เมา", "วิ่ง":"ล่น",
"วิดน้ำ":"หะน้ำ", "วิ่น":"หวิ้น", "วิบาก":"วิบาก", "วีวรณ์":"วิวรัย", "วุ้ง":"โค้ง",
"วุ้น":"งุ้น", "เวชยันต์":"เวไชยนต์", "เวทมนต์":"คาถาอาคม", "เวร":"มื้อ", "เวลากลางวัน":"เมื่อตอน",
"เวลาเข้าใต้เข้าไฟ":"เวลามืดซุ้มซิ้ม", "เวลาเช้า":"เมื่อก่อนงาย", "เวลาบ่าย":"ตาวันช้าย", "เวลาเย็น":"เมื่อแลง", "เวลาสาย":"เมื่อขวาย",
"เวสสันดร":"เวสสันตะ", "เวียนหัว":"เมาหัว", "แว่น":"แหว้น", "แววมยุรา":"เอื้องคำน้อย", "แวะ":"แว่",
"โว":"ขี้อู้", "โว้ย":"หา", "ไว":"โวย",


///////////////////////////////////////////////////////////////////////////////////////////////////// ศ
"ศรมณะ":"สรมมานะ", "ศรี":"สะหรี", "ศักราช":"สักกราช", "ศักดิ์สิทธิ์":"สักสวาด", "ศัตรู":"สัตถู",
"ศากยะ":"สาเกี๊ยะ", "ศาล":"หอผี", "ศาสดา":"สวาสดา", "ศาตรา":"ศัตถา", "ศาสนา":"สาสนา",
"ศิลปะ":"สิปปะ", "ศิษย์วัด":"ขะโยม", "เศรษฐี":"เสฏฐี", "เศษ":"เสส", "เศษเหลือ":"เสสะเหลือ",


///////////////////////////////////////////////////////////////////////////////////////////////////// ษ
"ขอโทษ":"สุมา", "ษมา":"ขะมา", "ษะมา":"ขะมา",


///////////////////////////////////////////////////////////////////////////////////////////////////// ส
"สกปรก":"เหี้ย", "สกัด":"เกิ้ด", "สกัดน้ำมัน":"ทุบน้ำมัน", "สกุล":"ขะกุล", "สง":"สะ",
"สงกรานต์":"สังขานต์", "สงกา":"สังกา", "สงเคราะห์":"สังคหะ", "สงฆ์":"สังฆะ", "สงบ":"ดักเย็น",
"สงบเสงี่ยม":"เหนียมหนิม", "สงวน":"รักษาไว้", "สงสัย":"สังกา", "สงสาร":"อิ่นดู", "สงสารวัฏ":"วัฏฏสงสาร",
"สงัด":"ดัก", "สง่า":"ครึ", "ส่งเสริม":"ช่วยค้ำ", "ส่งเสียง":"เอกเอ๋ว", "สด":"ดิบ",
"สะดับ":"สระดับ", "สดุดี":"สดุดี", "สตรี":"อิตถี", "สติสัมปชัญะ":"สะหรม", "สตูป":"กู่",
"สถานการณ์":"เหตุการณ์", "สถาปนา":"ฐะปันนา", "สถาปนิก":"สล่า", "สถาปัตยกรรม":"การก่อสร้าง", "สถาพร":"ถาวระ",
"สน":"เคียะ", "สนทนา":"อู้", "สนเท่ห์":"สลั้ง", "สนสองใบ":"เคียะเปลือกคำ", "สนเขา":"เคียะเปลือกคำ",
"สนสามใบ":"เคียะเปลือกแดง", "สนหมวก":"ส้มป่อยใต้", "สนหางกระรอก":"จวงผา", "สนอินเดีย":"สะเพาหล้ม", "สนหางสิงห์":"จันทน์ดี",
"สนม":"นางนาฏสนม", "สนับสนุน":"หนุน", "สนาม":"ข่วง", "สนามบิน":"ข่วงเฮือบิน", "สนามหญ้า":"ข่วงหญ้า",
"สนิทสนม":"คุ้นเคย", "สนิม":"ขี้เหมี้ยง", "สนุก":"ม่วน", "สนุน":"ไคร้นุ่น", "สบประมาท":"ดูแควน",
"สภาพ":"สภาวะ", "สมจร":"หื่น", "สมจริง":"สมแท้", "สมทบ":"เปาะ", "สมประกอบ":"สมองคะ",
"สมรู้":"เป๋นใจ๋", "ส้มกับ":"ส้มสังกา", "ส้มเกลี้ยง":"บ่ะเกลี้ยง", "ส้มเขียวหวาน":"บ่ะบาง", "ส้มจีน":"บ่ะจุก",
"ส้มจินดา":"ส้มบ่ะแง่ง", "ส้มเช้า":"เคียะลินหมา", "ส้มซ่า":"บ่ะขุน", "ส้มตำ":"ต๋ำส้ม", "ส้มมะแป้น":"บ่ะแง",
"ส้มมือ":"บ่ะนาวริพล", "ส้มลิ้ม":"บ่ะม่วงแผ่น", "ส้มเสี้ยว":"ผักเสี้ยว", "ส้มโอ":"บ่ะโอ", "สมณะ":"สะหรมมะณะ",
"สมบัติ":"สมบัติ", "สมเพช":"สังเวช", "สมภาร":"ตุ๊หลวง", "สมมติว่า":"จาว่า", "สมเสร็จ":"หลึ่ง",
"สมอง":"ผยา", "สมอเครือ":"บ่ะนะเครือ", "สมอไทย":"มานะ", "สมอภิเภก":"บ่ะแหนต้น", "สมัน":"ฟาน",
"สมัยเก่า":"บ่ะเก่า", "สมัยใหม่":"บ่ะใหม่", "สมา":"สมมา", "สมาน":"ต่อ", "สมิง":"เสือเย็น",
"สมี":"สะเพาลม", "สมุก":"มุก", "สมุกข้าว":"กล่องข้าว", "สมุด":"ปึ๊ง", "สมุดไทย":"พับสา",
"สมุทรโคโดม":"ข้าวป้างหางช้าง", "สมุน":"ลูกน้อง", "สมุนไพร":"ยาฮากไม้", "สมุลแว้ง":"สะมุลเเว้ง", "สยดสยอง":"สะยดสะหยอง",
"สยอง":"พ่าน", "สยิ้ว":"หยิ้ว", "สรง":"สะหรง", "สรรพคุณ":"สัพพคุณ", "สรรเพ็ชญ์":"สัพพัญญู",
"สรรเสริญ":"สักเสิน", "สรวลเส":"ใคร่หัว", "สร้อยทอง":"ลคร", "สระ":"สะหระ", "สร่าง":"สว่าง",
"สร้าง":"ส้าง", "สลด":"เส้า", "สลอด":"บ่ะขัง", "สลอดน้้ำ":"หนอดน้ำ", "สลบ":"สยบ",
"สลอน":"ซอนลอน", "สลัก":"จลัก", "สลัด":"ผักกาดยี", "สกัดใด":"สบัด", "สลับ":"สสับ",
"สลัว":"มัวมืด", "สลากภัต":"ข้าวสาก", "สล้าง":"ส่างล่าง", "สลิดป่า":"สลิดคาเลา", "สวด":"สูด",
"สวดพุทธาภิเษก":"สูดเบิก", "สวน":"ก๋าย", "ส่วน":"พุ่น", "สวบ":"สาด", "สวม":"สุบ",
"ส้วม":"วิด", "สวมรอย":"ซ้ำฮอย", "สวย":"งาม", "สวอง":"ตีนนก", "สวะ":"ขี้โข่",
"สว่าง":"แจ้ง", "สวัสดี":"สาหวั๊ดดี", "สวาด":"บ่ะขี้แรต", "สว่าน":"เหล็กจี", "สว้าน":"สะว้าน",
"สวาปาม":"ยว่าม", "สวาหุม":"สัวหุม", "สวาหะ":"สัวหะ", "สวิง":"หิง", "สวิงสวาย":"ปั่นเมา",
"สหชาติ":"เสี่ยว", "สองเกลอ":"กุ้ม", "สองจิตสองใจ":"สองใจสองคอ", "สองฤดู":"บานใบ", "ส่อง":"แยง",
"ส่อน":"ตาเหล้อ", "สอพอ":"สนส่อ", "สอย":"สิ", "ส่อเสียด":"สับส่อ", "สะกดรอย":"ตวยฮอย",
"สะกิด": "จิ", "สะแก": "แพ่ง", "สะแกวัลย์": "แหนเครือ", "สะแกแสง": "เนา", "สะคร้อ": "บ่ะเคาะ",
"สะค้าน": "จะค่าน", "สะดวก": "ดูต๊าง", "สะดุด": "ข้อง", "สะเด็ด": "หยัด", "สะเดา": "สะเลียม",
"สะเดาอินเดีย": "คินิน", "สะตุ": "ขั้ว", "สะทกสะท้าน": "สะท้านหย้านกลัว", "สะท้อน": "สะต๋อน", "สะเทิน": "สะเติน",
"สะเทือน": "สนั่น", "สะเทื้อน": "สนั่น", "สะบัด": "สะวัด", "สะบัดมีด": "ปัดมีด", "สะบัดร้อนสะบัดหนาว": "บึดฮ้อนบึดหนาว",
"สะบั้น": "เป๋นบั้น", "สะบ้า": "บ่ะบ้าวอ", "สะบ้าลิง": "บ่ะบ้าววอก", "สะบ้าหัวเข่า": "บ่ะบ้าหัวเข่า", "สะบู่แดง": "บ่ะหุ่งแดง",
"สะบู่เลือด": "เป๋าเลือดเครือ", "สะพรั่งสะพรู่": "สะพรู่", "สะพัก": "ผ้าสะไบ", "สะพั้น": "ลมสะว้าน", "สะพาน": "ขัว",
"สะพานหนู": "ขัวหย้าน", "สะพายแล่ง": "สะพายแหล้้ง", "สะเพร่า": "มักง่าย", "สะเภา": "สะเพา", "สะไภ้": "ไพ้",
"สะระแหน่": "พอมด่วน", "สะแล": "สะแลยาว", "สะอาด": "สระอาด", "สะอิ้ง": "สะเอ้ง", "สะอิดสะเอียน": "ขี้เหลียด",
"สะอืก": "สะอื้น", "สะอึก": "ผักไหม", "สะเอว": "แอว", "สะโอดสะโอง": "ฮ่างแค่วแอวกลม", "สัก": "จลัก",
"สักที": "สักเตื่อ", "สักนิด": "สักหน้อย", "สักว่า": "สักแต่ว่า", "สังกรณี": "หญ้าหัวนาค", "สังกะตัง": "เป๋นตังเป๋นเหนียว",
"สังกะสี": "เหียก", "สังกัด": "สังกัด", "สังข์": "หอยสังข์", "สังฆภัต": "ข้าวสังฆ์", "สังฆาฏิ": "ผ้าพาด",
"สั่งสม": "ส้างสม", "สังวัธยาย": "สวาธยาย", "สังเวย": "เลี้ยง", "สังเวียน": "เสวียน", "สัญจรโรค": "มดตะขึด",
"สัด": "หื่น", "สัตบรรณ": "ต้้นตีนเป็ด", "สัตบุรุษ": "สัปปุริยะ", "สัตย์": "สัจจะ", "สัตว์": "สัตต์",
"สัตว์โลค": "สัตตโลก", "สั่น": "สว่าย", "สั้น": "ก้อม", "สันตะวา": "ผักควบ", "สันทัด": "แกว่น",
"สันนิษฐาน": "ต่อง", "สันปลาช่อน": "ซ้อ", "สันพร้านางแอ": "นางแอ", "สันพร้ามอญ": "เกียงภายาว", "สันสกฤต": "สากะตะ",
"สันหลังยาว": "ขี้คร้าน", "สัปคับ": "แหย่งช้าง", "สัปงก": "เหงางก", "สัปดน": "พาโล", "สัปรด": "บ่ะขนัด",
"สัปรดเทศ": "บ่ะขนัดช้าง", "สัปลับ": "สับปะหลี้", "สัปลี้": "สับปะหลี้", "สัพยอก": "หยอก", "สันผัสนอก": "คับนอก",
"สัมผัสใน": "คับใน", "สัมภาษณ์": "สืบคำ", "สัมฤทธิ": "สมริด", "สา": "สม", "สากกระบือ": "สากครก",
"สาเก": "ตังนี", "สาด": "หด", "สาโท": "น้้ำขาว", "สาธก": "สาธกะ", "สาธุ": "สาตุ้",
"สาธยาย": "สวาธยาย", "ส้านนา": "ส้านน้อย", "สาบ": "สาบ", "สาบแร้งสาบกา": "หญ้าสาปแร้ง", "สาบเสือ": "หญ้าเมืองวาย",
"สาบาน": "สะบาน", "สาป": "แช่ง", "สามวันดีสี่วันร้าย": "สิบวันหนาซาววันไข้", "สามเณร": "พระหน้อย", "สาขสิบ": "จวงเครือ",
"สามหาว": "สะหาว", "สามัญ": "สามาน", "สามารถ": "สมัตถา", "สามี": "สามิกา", "สาย": "ขวาย",
"สายบัว": "ดอกพ้าน", "สายมรกฎ": "เอื้องพูเลย", "สายสามสี": "เอื้องนางฟ่อน", "สายโยค": "สายสนุกบาตร", "สายสร้อย": "สายคล้องคอ",
"สายสิญจน์": "ฝ้ายมงคล", "สายหยุด": "สะบันงาเครือ", "ส่าย": "สว่าย", "สารบาญ": "หน้าทับ", "สารพัตร": "สัพพะ",
"สารภาพ": "ฮับผิด", "สารภี": "สารปี", "สารเลว": "ชั่วช้า", "สารส้ม": "หิงส้ม", "สาวก": "สาวกะ",
"สาระวน": "หยุ้ง", "สาวค้าง": "สาวเคิ้น", "สาวแก่": "สาวเถ้า", "สาวเทื้้อ": "สาวเถ้า", "สาวท้าว": "ก้าวตี๋น",
"สาวรุ่น": "สาวจี", "สาหร่าย": "เทา", "สาหร่ายทะเล": "เทาสมุทร", "สาแหลก": "แสรก", "สาหัส": "สาหส",
"ส่าเหล้า": "ต้นสา", "สำคัญ": "ทะหระ", "สำทับ": "ซ้ำซุย", "สำนอง": "ส้ายคืน", "สำนัก": "ที่อยู่",
"สำเนา": "ตัวฮ่าย", "สำบัดสำนวน": "เล่นโวหาร", "สำเภา": "สะเพา", "สำมโนครัว": "เส้น", "สำรวม": "สังรวม",
"สำรวย": "ขี้หย้อง", "สำรอกสี": "ฟอกสี", "สำรอง": "ฮอง", "สำรับ": "สะโตก", "สำเร็จเสร็จ": "สมเร็จเสร็จ",
"สำเรา": "เลา",
"สำลัก": "สะมัก", "สำลี": "ฝ้ายกอก", "สำเนียก": "จื่อจำ", "สำออย": "ออด", "สำอาง": "เครื่องไล้ลา",
"สิ": "ก่า", "สิง": "สึง", "สิ่งของ": "ครัว", "สิงหบัญชร": "สิงหเบงชอน", "สิงห์หงส์": "เปิ้มผา",
"สิทธิการิยะ": "สิทธิการ", "สินบน": "สินบน", "สิ้น": "เสี้ยง", "สิ้นเนื้อประดาตัว": "หมดเนื้อหมดตั๋ว", "สิเนรุ": "เขาสิเนรู",
"สี้": "ซี่", "ชี่": "ซี่", "สีกา": "แม่ออก", "สีข้าง": "ขี้ข้าง", "สีเขียวใบไม้": "ขี้ข้าง",
"สีด": "สึ", "สีน้ำเงิน": "สีหม้อห้อม", "สีน้ำตาลอ่อน": "สีตุ่น", "สีบานเย็น": "สีอ่อน", "สีหมากสุก": "สีสุก",
"สีฟ้า": "สีคราม", "สีมา": "สิม", "สี๋แยก": "คองไขว่", "สี๋มุม": "สี่เเจ่ง", "สึก": "สิก",
"สึกหรอ": "หิ้น", "สืบสันดาน": "สืบเชื้ัอ", "สืบเสาะ": "เซาะไซ้", "สุ": "ชุ", "สุกงอม": "เตียะ",
"สุคนรส": "ถั่วรส", "สุด": "ตึ๊ก", "สุดคิด": "เสี้ยงกำกึด", "สุพรรณบัฏ": "สุวรรณปัฏ", "สุภาพ": "สภาวะ",
"สุมทุม": "คุ่มไม้", "สุ่มสี่สุ่มห้า": "ตำผึงตำผัง", "สุรุ่ยสุร่าย": "อ่วย", "สูด": "หูบ", "เส": "เส",
"เสกสรร": "ย้อมแปลง", "เสงี่ยม": "เหนี่ยม", "เสด็จ": "เสด็จ", "เสน่ห์": "เสเนหา", "เสนอ": "สู่ชู",
"เสน่า": "เสน้า", "เสนาะ": "เหนาะ", "เส้นรุ้ง": "ลวงกว้าง", "เส้นแแวง": "ลวงยาว", "เสนียด": "ขึด",
"เสบียงกรัง": "ข้าวไท่ข้าวถง", "เสเพล": "ถ่อย", "เสม็ดชน": "ไคร้ต้น", "เสม็ดทุ่ง": "เนื้อเหนียว", "เสมอภาค": "เสมอหน้า",
"เสมา": "เคียะหางช้างฃ", "เสมหะ": "ขี้เต่อ", "เสร็จ": "แล้ว", "เสริม": "เติม", "เสลี่ยง": "คานหาม",
"เสรสรวล": "ใคร่หัว", "เสลา": "เปือยสะแอน", "เสลาตำ": "เส้าดำ", "เส้า": "ส้าว", "เสาะ": "หย้าน",
"เสียจริต": "เสียจิต", "เสียที": "เสียท่า", "เสียเหลี่ยม": "เสียเชิง", "เสี่ยง": "ห่วง", "เสียด": "เสียบ",
"เสียดสี": "หย้อ", "เสี้ยม": "เหลี้ยม", "เสื่อ": "สาด", "เสื้อ": "เสื้อ", "เสื่อม": "ถอย",
"เสือก": "เจือก", "เสื้้อแขนสั้น": "เสื้อแขนก้อม", "เสื้อชั้นนอก": "เสื้อนอก", "เสื้อชั้นใน": "เสื้อก้อม", "เสื้อยืด": "เสื้อหยืด",
"เสือสมิง": "เสือเย็น", "แสดง": "สำแดง", "แสนงอน": "ใจหน้อย", "แสมสาร": "ขี้เหล็กแพะ", "แสยะ": "ยี่",
"แสลงใจ": "เค้าแหลง", "แสลงมัน": "ปอเจียน", "โสก": "ส้มสุก", "โสกโดก": "พาโล", "โสน": "ฮองแฮง",
"โสเภณี": "สำเพ็ง", "โสม": "จวงเครือ", "ไส": "เสือก", "ไสกบ": "เต่า", "ไส้ตัน": "ไส้เหลือ",
"ไส้ติ่ง": "ไส้เหลือ", "ไสยศาสตร์": "สิปปคุณ", "โสนหมอก": "ไคร้",



///////////////////////////////////////////////////////////////////////////////////////////////////// ห
"หก": "ฝะ", "หกคะเมน": "ปิกกระดิก", "หกล้ม": "ต้าว", "หงอนไก่": "ดอกด้ายหงอนไก่", "หงอนไก่ฝรั่ง": "ดอกด้ายสร้อย",
"หงำ": "แก่", "หญ้าเกล็ดหอย": "หญ้าตาลทราย", "หญ้าขวาก": "หญ้าหูขวาก", "หญ้าข้าวก่ำ": "เอื้องงก", "หญ้าเจ้าชู้": "หญ้าก่อน",
"หญ้าชันอากาศ": "แขมมัน", "หญ้าน้ำดับไฟ": "ผักพา", "หญ้านามราชสีห์": "หญ้าน้ำหมึก", "หญ้าพันงูขาว": "หญ้างูขาว", "หญ้าพันงูแดง": "หญ้างูแดง",
"หญ้ายองไฝ": "ขี้ขะย้องข่า", "หญิง": "ยิง", "หนวก": "หลึ่ง", "หนวกหู": "เหมินหู", "หน่วง": "หน่อง",
"หน่วงเหนี๋ยว": "ชักจ่อง", "หนอ": "เห่อ", "หนอนตายยาก": "หญ้าหนอนตาย", "หน่อย": "หน้อย", "หน็อยแน่": "กำ",
"หนักใจ": "กึดยาก", "หนักอก": "หนักใจ๋", "หนังหน้าไฟ": "ก้อนเส้าไฟ", "หนา": "หึก", "หน้าจึด": "หน้าจาง",
"หน้าต่าง": "ประตูปล่อง", "หน้าเกรียม": "หน้าแห้ม", "หนามคาใบ": "หนามคือไก่", "หน้าไม้": "ด้ามไม้", "หน่าย": "ค่าย",
"หนำ": "แหนม", "หนึ่ง": "นึ่ง", "หนู": "หน้อย", "ห่ม": "ตุ้ม", "หมกมุ่น": "มัวเมา",
"หมด": "เสี้ยง", "หมดจด": "หมดใส", "หมดหวัง": "หมดจ้อย", "หมวก": "กุบ", "หมวด": "หมวด",
"หมอ": "หมอ", "หมอก": "เหมือย", "หมอดู": "หมอเมื่อ", "หมอนวด": "ช่างบีบ", "หมอน้อย": "หวดหม่อน",
"หม้อน้ำ": "น้ำหม้อ", "หมอบ": "มอบ", "หม่อมฉัน": "ข้าเจ้า", "หมัด": "ลูกกุย", "หมั่นไส้": "ชังสริต",
"หมากกระทันช้าง": "บ่ะตันขอ", "ตะครอง": "บ่ะตันขอ", "หมากผู้": "หมากพู้", "หมากลิง": "หมากหวาย", "หมาด่าง": "หมาโก้ง",
"หมาดุ": "หมาสวก", "หมาบ้า": "หมาว้อ", "หมามุ้ย": "บ่ะเหนียง", "หมามุ้ยใหญ่": "บ่ะบ้าลาย", "หมาร่า": "แมงใบ้",
"หมาลาย": "หมาเลน", "หมาเหมี่ยว": "หานไก่", "หมิ่นประมาท": "ดูแคน", "หมีเหม็น": "บ่ะยวย", "หมื่นเหม่": "หมิ่นแชม",
"หมุ่ย": "หมุ้ย", "หยด": "หยาด", "หยอก": "เล่น", "หย็อกหยอย": "บ่งาม", "หย่อง": "หย่องเขาะ",
"หย่อน": "หย่อนหย้าน", "หยักรั้ง": "คิ้วม่าม", "หยัดกาย": "บิดคร้าน", "หยากเยื่อ": "หยากเยื้อ", "หยาบคาย": "หยาบ",
"หยิก": "หงิก", "หยิ่ง": "จองหอง", "หยิบหย่ง": "เยียะปุ๊นเยียะเพ้", "หยิบๆ": "ซอยๆ", "หยี": "จิ",
"หยุด": "ยั้ง", "หยูมหยิบ": "จุกจิก", "หยูกยา": "หยุกยา", "หรอ": "ลุ่น", "หรอมแหรม": "หยอมแหยม",
"หรือ": "ก๋าว่า", "หรุบหรู่": "หุบหู่", "หรู": "ครึ", "หฤทัย": "ดวงทัย", "หล่ม": "หล่ม",
"หลวง": "หลวง", "ใหญ่": "หลวง", "หลวงตา": "ตุ้ปู่", "หลวงพี่": "ตุ้พี่", "หลวงน้า": "ตุ้น้า",
"หลวงอา": "ตุ้น้า", "หลวงลุง": "ตุ้ลุง", "หลวม": "หลม", "หลอกลวง": "จุล่าย", "หล่อน": "สู",
"หละหลวม": "หละหลม", "หลักแหลม": "หล็วกแหลม", "หลัง": "ลุน", "หลังบ้าน": "ก้นตู", "หลีก": "เว้น",
"หลุบหลู่": "ซุมซู่", "หลุม": "ขุม", "หวง": "ขาง", "ห่วง": "อ่วง", "หวด": "ไห",
"หวน": "ปิก", "ห้วน": "ด้วน", "หวอ": "หว้อ", "หวั่น": "หย้าน", "หวั่นหวาด": "หย้านกลั๋ว",
"หัวเราะ": "ใคร่หัว", "หวา": "ว่า", "หว้า": "ห้า", "หวาก": "โหวก", "หว่าง": "หว่าง",
"หวายตะค้า": "หวายหอม", "หวายตะมอย": "หวายตะมอย", "หวายตะมอยเขียว": "เอื้องตี๋นเป็ด", "หวำ": "ว้ำ", "หวี่": "แมงหมี่",
"หอกลอง": "โรงกลอง", "หอไตร": "หอธรรม", "ห้องน้ำ": "ต้อมน้ำ", "หอบ": "เส่า", "ห่อผ้า": "พกผ้า",
"หอม": "หอม", "หอมยับ": "ฮอมยับ", "หอมจันทน์": "ผักไผ่", "หักร้าง": "บุกเบิก", "หัน": "ปิ่น",
"หั่น": "ซอย", "หันกลับ": "งว้าย", "หัว": "หัว", "หัวกระเดน": "หัวน้ำ", "หัวขะโมย": "ขี้ลัก",
"หัวขโมย": "ขี้ลัก", "หัวแข็ง": "ดื้อด้าน", "หัวคิด": "กำกึด", "หัวจุก": "หัวจ็อก", "หัวโจก": "โป่",
"หัวนอน" : "บนหัว", "หัวประจบ" : "มักส่อ", "หัวมุม" : "แจ่ง", "หัวแม่มือ" : "หัวนิ้วโค่", "หัวยาข้าวเย็น" : "หนาดดำ",
"หัวระแหง" : "ดินแตกขาบ", "หัวลิง" : "กูดหมาก", "หัวโล้น" : "หัวล้าน", "หัวหน้า" : "นายฮ้อย", "หัวแหวน" : "ส้มปี",
"หัวไหล่" : "หัวแหล่", "หัสคุณ" : "หัสคืน", "ห่า" : "ฮ่า", "ห่ากิน" : "ฮ่าลง", "หาไม่" : "บ่",
"หางกระเบน" : "หางเตี่ยว", "หางกระรอก" : "ไหมพรม", "หางกระลวยไก่" : "หางก้อม", "หางขมวด" : "หางขอด", "หางช้าง" : "ไล่บง",
"หางนกยูงไทย" : "ส้มภอ", "หางนกยูงฝรั่ง" : "ส้มภอเทศ", "หางนาคบาท" : "กูดน้ำขาว", "หางยาม" : "คันตั้ง", "หางไหลแดง" : "เครือเชาพู้",
"หางไหลเถา" : "พิ้เครือ", "หาด" : "บ่ะหาด", "หามรอก" : "หำวอก", "หามรุ้งหามค่ำ" : "หามวันหามคืน", "ห่าม" : "เหิ่ม",
"หายาก" : "เขียม", "หาวนอน" : "เหงาหลับ", "หิงหาย" : "หิ่งเหม้น", "หิมะ" : "เหเหมย", "หิรัญบัฏ" : "ปัฏเงิน",
"หิ้ว" : "ติ้ว", "หีบ" : "หีด", "หีบเสียง" : "หีดเสียง", "หีบอ้อย" : "อีดอ้อย", "หึง" : "ขาง",
"หืด" : "คู่", "หืน" : "เอียด", "หือไม่ขึ้น" : "หือไม่ขึ้น", "หื้อ" : "อื้อ", "หุบเขา" : "เงิ้มผา",
"หุบผา" : "เงิบผา", "หูควาย" : "ตองเต๊า", "หูปลาช่อน" : "ผักบั้ง", "หูเสือ" : "อี่หลึ่ง", "หูหนาตาเล่ย" : "โรคเรื้อน",
"เหง่ง" : "เหง้ง", "เหงา" : "ง่อม", "หงอยเหงา" : "ง่อมเหงา", "เหงื่อ" : "เหื่อ", "เห็ดเถอะ" : "เห็ดถอบ",
"เห็ดหูหนู" : "เห็ดหูหลัวะ", "เห็ดลม" : "เห็ดแค้น", "เห็น" : "หัน", "เหน็ดเหนื่อย" : "อิดอ่อน", "เหน็บ" : "เหน็ด",
"เหน็บชา" : "เหน็ดสึง", "เหน่อ" : "เยื้อน", "เหนาะๆ" : "เหมาะๆ", "เหนียง" : "เหนี่ยง", "เหนียว" : "ข่าม",
"เหนียวแน่น" : "จิ๊", "เหนื่อย" : "อิด", "เหม่" : "ป๊า", "เหน่ง" : "เหม้ง", "เหม็นเขียว" : "เอียน",
"เหม่อ" : "เหง้อ", "เหมี่ยวเหมี่ยว" : "แหม้วแหม้ว", "เหย" : "เย่", "เย้า" : "เย่า", "เหยียด" : "ตือ",
"เหยียบ" : "หง่ำ", "เหยี่ยว" : "แหลว", "เหยื่อ" : "เหยิ้อ", "เหล่" : "เหล้", "เหล็กไน" : "ไม",
"เหลว" : "แหลว", "เหลวแหลก" : "เหลือกแหลว", "เหลวไหล" : "ขี้้จุ", "เหลอ" : "ตุ่น", "เหล้ารัฐบาล" : "เหล้าภาษี",
"เหลียน" : "ขอเคียว", "เหลี่ยม" : "เลี่ยม", "เหลี่ยมคู" : "เชิง", "เหลือเกิน" : "ล้ำไป", "เหลือเฟือ" : "เปอะเลอะ",
"เหลือเหล่" : "เหลือหลาย", "เหลื่อม" : "แพ็ด", "เหว่" : "ง่อม", "เหวง" : "หยอง", "เหวย" : "เว้ย",
"เห่อ" : "เมา", "เห่อเหิม" : "มัวเมา", "เหาะ" : "ซาน", "เหิม" : "กล้า", "เหี้ย" : "แลน",
"เหียน" : "เอียน", "เหี้ยน" : "หิ้น", "เหี้ยมโหด" : "ใจ๋ดำ", "แหก" : "ตี่", "แหง" : "แหง้ง",
"แหง่" : "ควายน้อย", "แหง่ง" : "แหง้ง", "แหน" : "กาแหน", "แห้น" : "แหง้น", "แหนม" : "จิ้นส้ม",
"แหนบ" : "แหลบ", "แหมดูซิ" : "ผ่อลุ", "แหย" : "แห้ง", "แหย่" : "จิ", "แหล่" : "กาพย์",
"แหลก" : "เหลือก", "แหลม" : "แหลม", "แหละ" : "แล้ว", "แห้ว" : "บ่ะเหนี้ยว", "แหวก" : "แหก",
"แห้วหมู" : "บ่ะเหนี้ยวหมู", "แหะ" : "แฮ่", "โหนก" : "ง็อก", "โหน่ง" : "โหม้ง", "โหมโรง" : "อุ่มโรง",
"โหร" : "โหรา", "โหระพา" : "ช้าคอมค่อ", "โหระพาช้าง" : "เนียม", "โหราผักกูด" : "กูดยี", "กูดผี" : "กูดยี",
"ให้" : "หื้อ", "ไหปลาร้า" : "หลุมคอ", "ใหญ่" : "หลวง", "ไหม" : "บ๋อ", "ไหล่" : "แหล่",
"ใหม่ถอดด้าม" : "ใหม่หม้า",


///////////////////////////////////////////////////////////////////////////////////////////////////// อ
"อกไก่":"แปจอง","อกเลา":"ดูกงู","องค์":"ตน","อด":"กลั้น","อดอยาก":"กลั้นหยาก",
"อธิปดี":"อธิปติ","อนาคต":"อนาคตะ","อนิจจา":"พุทโธ","อนึ่ง":"อันนึ่ง","อโนดาต":"อโนตัดตะ",
"อนุวาต":"วาต","อนุสาวรีย์":"กู่","อบเชย":"รางแคง","อบเชยเถา":"กู๊ดิน","อพยพ":"ขดค้าย",
"อภิรุม":"ฉัตร","อภิเสก":"อภิเสก","อมเปรี้ยวอมหวาน":"ส้มๆหวานๆ","อมหนอง":"ขงหนอง","อย่า":"จะไป",
"อยาก":"อยาก","อยากอาเจียร":"ใคร่ฮาก","อย่าง":"เยี่ยง","อย่างนั้นหรือ":"จะอั้นก๋า","อย่างไร":"จะใด",
"อย่างไรก็ดี":"จะใดก่ดี","อย่างไรก็ตาม":"จะใดก่แล้ว","อยู่คง":"ข่ามคง","อยู่ไฟ":"อยู่เดือน","อยู่เวร":"เฝ้ามื้อ",
"อรชร":"ออนชอน","อรหันต์":"อรหันตา","อร่อย":"ลำ","อรัญญวาสี":"หนป่า","อร่าม":"ฮ่าม",
"อรุ่ม":"อุ่มฮุ่ม","อลเวง":"วุ่นวาย","อลักเอลื่อ":"อึกอัก","อจน":"อวน","อ้วน":"ตุ้ย",
"อ้วนท้วน":"ตุ้ยพี","อวัยวะ":"องคะ","อสรพิษ":"อสุรพิษ","อหังการ":"โอหัง","อ้อ":"เอ่อ",
"ออก":"ล้ำ","ออกดอก":"เป๋นดอก","ออกท่า":"เต่ะเชิง","ออกทาง":"เต่ะเชิง","ออกฝี":"ลาย",
"ออกไฝ":"เป็นไฝ","อ็อด":"อี่ฮวก","ลูกไก่":"อี่ฮวก","อ่อนเพลีย":"อิดอ่อน","อ่อน":"หนุ่ม",
"อ่อนไท้":"ออกไต้","อ่อย":"อ่อย","อ้อยควั่น":"อ้อยคั่น","อ้อยช้าง":"หวีด","อ้อยส้อย":"อ้อยซ้อย",
"อ้อยอิง":"ออเซาะ","อะไร":"อะหยัง","อะลุ่มอะล่วย":"อดออม","อักษร":"อักขระ","อักเสบ":"หม",
"อังกา":"มันไก่","อังกาบหนู":"มันไก่","อัญชัน":"เองชัน","อัญชันป่า":"เองชันป่า","อัณฑะ":"ขะหลำ",
"อัดแอ":"ยัดยู้","อัธยาศัย":"อัชฌาศัย","อั๋น":"ล่ำ","อันตราย":"อนตราย","อับ":"เอิบ",
"อับจน":"เปียะฮำ","อับเฉา":"เหี่ยวแห้ง","อับโชค":"แกน","อับอาย":"เผิดละอาย","อัปปมงคล":"จังไร",
"อับปาง":"หล้ม","อัประมาณ":"ผะหมาณ","อัมพาต":"ตายผาก","อัยเรศ":"เอื้องพวงหางฮอก","อัศจรรย์":"งืด",
"อา":"อาว","อาเขย":"อาวชาย","น้าเขย":"น้าชาย","อาตมา":"เฮา","อาตมภาพ":"เฮา",
"อาน":"ฝน","อ่าน":"เล่า","อ้าย":"บ่า","อ้ายหนู":"ไอ้หน้อง","อายัด":"อั้บ",
"อาราธนา":"ราธนา","อาศัย":"อาสะหรัย","อาศรม":"อาสะหรม","อาสน์สงฆ์":"แท่นสงฆ์","อาสนะ":"อาสะหนา",
"อาสะไภ้":"น้ายิง","น้าสะไพ้":"น้ายิง","อำมะหิด":"ใจ๋ดำ","อำมาตย์":"อมาตย์","อิง":"เติก",
"อิฐ":"ดินกี่","อิดหนาระอาใจ":"อิ่มหน่ายค่ายชัง","อิดออด":"ถุกถิก","อิดโรย":"อิดอ่อน","อินทนิล":"หูกวางป่า",
"อินทผลัม":"ปุ่มแป้ง","อิศวร":"อินศวร","อี":"อี่","อีก":"แหม","อีกา":"กา",
"อีเก้ง":"ฟาน","อีจู้":"ตุ้้มปลาเอี่ยน","อีสุกอีใส":"ตุ่มใส","อุตพิด":"บอนแบ้ว","อุทลุม":"นอกคอก",
"อุทยาน":"สวนอุยยาน","อุทิศ":"อุทิสสะ","อุบาทว์":"อุปัททวะ","อุบาสก":"อุปาสกะ","อุบาสิกา":"อุปาสิกา",
"อุปสมบท":"เพ็ก","อุปัชฌายะ":"อุปัชซาย","อุโลก":"ส้ม","อู":"โชง","เอกฉันท์":"เอกฉันทะ",
"เอกเขมก":"เติกเสิ้ง","เอ็ง":"คิง","เอ็ด":"เอ็ด","เอ็ดตะโร":"เดือดนัน","อีหลุกขลุกขลัก":"อะหลุกขุกขัก",
"อี่หลุกขลุกขลุ่ย":"กะหลุกกะหลุ่ย","อีหลุยฉุยแฉก":"หุยหี้หุยหาย","อีเห็น":"เห็น","อีเหนียว":"หญ้าตืดแมว",
"อีหลี่":"ดีหลี","อึกทึก":"เดือดนัน","อึงมี่":"อึงอัง","อืด":"ไค่","อื้น":"เอิ้น",
"อื้อฉาว":"อึงนัน","อุ้ง":"อ้ง","อุด":"ตึด","อุดจาด":"ผ่างร้าย","อุดหนุน":"ค้ำชู",
"เอน":"เนิ้ง","เอนดู":"อิ่นดู","เอย":"เฮย","เอ่ย":"เห่อ","เอร็ดอร่อย":"ลำแต้ๆ",
"เอ็ว":"แอว","เออ":"เอ้อ","เอ่อ":"ยิ่ง","เออออห่อหมก":"เอ้อๆเออๆ","เอะอะ":"อึงนัน",
"เอิกเกริก":"ม่วนงัน","เอียง":"เหงี่ยง","เอื้องกุหลาบกระเป๋าเปิด":"เอื้องปากเป็ด","เอื้องกุหลาบ":"เอื้องฟ้ามุ่ย",
"เอื้องเขาแกะ":"เอื้องขี้หมา","เอื้องเขาแกะใหญ่":"เอื้องไข่เหลือง","เอื้องคำขอน":"เอื้องคำปล้อง","เอื้องเงินหลวง":"เอื้องตาเหิน",
"เอื้องจำปา":"คำสาย","เอื้องดิน":"เอื้องหมายนา","เอื้องนกพิลาป":"เอื้องอินทจักร","เอื้องเพ็ดม้า":"ผักไผ่น้ำ",
"ผักเอื้อง":"ผักไผ่น้ำ","เอื้องม้าลายเนื้อ":"เอื้องจะเข็บ","เอื้องแม่นา":"ดอกตาเหิน","หางหงส์":"ดอกตาเหิน",
"เอื้องโมก":"เอื้องเทียน","เอื้องสารภี":"เอื้องเจ็ดปอย","เอื้องหงอนไก่":"หว้านไก่แดง","เอื้องอัยเรศ":"เอื้องเป็ดน้ำ",
"เอือม":"หน่าย","เอื้อม":"หยื้อ","เอื้อย":"เอ้ย","แอกน้อย":"แอกก้อ","แอ่น":"แง้น",
"แอบ":"ลี้","แอบดู":"ผกผ่อ","แอบฟัง":"ผกฟัง","แอ่วลาว":"เซิ้้งลาว","โอ":"โอ้",
"โอดครวญ":"ฮ่ำไฮ่","โอย":"อะล่ะ","โอหนอ":"โอยหนอ","โอ้อวด":"อวดอู้","ไอศวรรย์":"ไอสวร",
"เอ๋ย":"เฮย",


///////////////////////////////////////////////////////////////////////////////////////////////////// ฮ
"ฮด" : "หด", "ฮ่อ" : "ห้อ", "ฮูก" : "นกเค้า", "เฮโล" : "โหล่", "โฮกฮือ" : "แกงโฮะ","แปร๋ม":"จักรวาล",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับครอบครัว
"เด็กทารก" : "น้องแอ", "ตา" : "ป้ออุ๊ย", "ทวด" : "หม่อน", "น้องเขย" : "น้องจาย", "น้องชาย" : "น้องบ่าว",
"น้องผัว" : "น้องผัว", "น้องเมีย" : "น้องเมีย", "น้องสะใภ้" : "น้องไป๊", "น้องสาว" : "น้องสาว", "น้า" : "น้า",
"น้าเขย" : "น้าจาย", "น้าสะใภ้" : "น้าไป๊", "ป้า" : "ป้า", "ป้าสะใภ้" : "ป้าไป๊", "ปู่" : "ป้ออุ๊ย",
"พ่อ" : "ป้อ", "พ่อตา" : "ป้อเมีย", "พ่อผัว" : "ป้อผัว", "พ่อเลี้ยง" : "ป้อน้า", "พี่เขย" : "อ้ายเขย",
"พี่ชาย" : "อ้าย", "พี่เมีย" : "ปี้เมีย", "พี่สะใภ้" : "ปี้ไป๊", "พี่สามี" : "ปี้ผัว", "พี่สาว" : "ปี้",
"เพื่อน" : "เปื่อน", "ภรรยา" : "เมีย", "แม่" : "อิแม่", "แม่ผัว" : "แม่ผัว", "แม่ยาย" : "แม่เมีย",
"แม่เลี้ยง" : "แม่น้า", "ย่า" : "แม่อุ๊ย", "ยาย" : "แม่อุ๊ย", "เด็ก" : "ละอ่อน", "ลุง" : "ลุง",
"ลุงเขย" : "ลุงเขย", "ลูกเขย" : "ลูกจาย", "ลูกคนกลาง" : "ลูกคนก๋าง", "ลูกคนเดียว" : "ลูกโตน, ลูกคนเดียว", "ลูกคนโต" : "ลูกคนเก๊า",
"ลูกคนสุดท้อง" : "ลูกหล้า", "ลูกชาย" : "ลูกบ่าว", "ลูกบุญธรรม" : "ลูกเก๋บ", "ลูกเลี้ยง" : "ลูกเลี้ยง", "ลูกสาว" : "ลูกสาว",
"สามี" : "ผัว", "หลาน" : "หลาน", "หลานเขย" : "หลานเขย", "หลานสะใภ้" : "หลานไป๊", "เหลน" : "เหลน",
"อา" : "อา", "อาเขย" : "อาเขย",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับอวัยวะ
"ก้น" : "ก้น", "กระดอง" : "ดอง", "กระดูก" : "กระดูก", "กระดูกเชิงกราน" : "ดูกดะด้าม", "กระดูกซี่โครง" : "กระดูกขี้ข้าง",
"กระดูกสันหลัง" : "กระดูกหลัง", "กระดูกไหปลาร้า" : "กระดูกห้า", "กระเพาะ" : "กะเพ่าะ", "กระหม่อม" : "ขม่อม", "กราม" : "กาง",
"กล้าม" : "ก้าม", "กะโหลกศีรษะ" : "กะโหล้งหัว", "ก้าง" : "ก้าง", "ก้านคอ" : "ก้านคอ", "ก้าม" : "ก้าม",
"กีบ" : "กีบ", "เกล็ด" : "เก๋ด", "แก้ม" : "แก้ม", "แก้วหู" : "แก้วหู", "ขน" : "ขน",
"ขนคิ้ว" : "ขนกิ๊ว", "ขนจมูก" : "ขนฮูดัง", "ขนตา" : "ขนต๋า", "ขมับ" : "หงีบ", "ข้อเท้า" : "ข้อตี๋น",
"ข้อนิ้ว" : "ข้อนิ้ว", "ข้อพับ" : "ข้อพั่บ", "ข้อพับที่น่อง" : "กะหล็อกน่อง", "ข้อมือ" : "ข้อมือ", "ข้อศอก" : "ต๋าศอก",
"ขา" : "ขา", "ขากรรไกร" : "ต๋งกาง", "ขาหนีบ" : "ขาหนีบ", "รักแร้" : "ขี้แฮ้", "เข่า" : "เข่า",
"แข้ง" : "แข้ง", "แขน" : "แขน", "คราบ" : "คาบ", "ครีบ" : "คีบ", "คอ" : "คอ",
"คาง" : "กาง", "คิ้ว" : "กิ้ว", "เครา" : "หนวด", "เครื่องใน" : "คัวใน", "งวง" : "งวง",
"งา" : "งา", "เงี่ยง" : "เงี่ยง", "จมูก" : "ฮูดัง", "จะงอยก้น" : "ก้นจุ้น", "ซอกขาพับ" : "กะล๋อกน่อง",
"เดือย" : "เดือย", "ต้นขา" : "เก๊าขา", "ต้นแขน" : "เก๊าแขน", "ต่อม" : "ด่อม", "โหนก" : "ตะพอง",
"ตับ" : "ดั๋บ", "ตา" : "ต๋า", "ตาขาว" : "ต๋าขาว", "ตาดำ" : "ตาดำ", "ตาตุ่ม" : "ต๋าตีน",
"ติ่งหู" : "ติ่งหู", "ตูด" : "ฮูขี้", "ไต" : "ไต", "ถุงน้ำดี" : "ดี", "ท้อง" : "ต๊อง",
"ท้องขา" : "ต๊องขา", "ท้องแขน" : "ต๊องแขน", "ท้องน้อย" : "ต๊องน้อย", "ท้ายทอย" : "ง่อน", "เท้า" : "ตี๋น",
"นม" : "นม", "นอ" : "นอ", "น่อง" : "น่อง", "นิ้วกลาง" : "นิ้วก๋าง", "นิ้วก้อย" : "นิ้วก้อย",
"นิ้วชี้" : "นิ้วจี้", "นิ้วเท้า" : "นิ้วตี๋น", "นิ้วนาง" : "นิ้วนาง", "นิ้วโป้ง" : "นิ้วโป้,นิ้วโข้", "นิ้วมือ" : "นิ้วมือ",
"นิ้วหัวแม่มือ" : "นื้วโข้", "เบ้าตา" : "เบ้าต๋า", "ปอด" : "ปอด", "ปาก" : "ปาก", "ปีก" : "ปีก",
"ปุ่มเหงือก" : "ปุ่มเหงือก", "ผม" : "ผม", "ผ้าขี้ริ้ว" : "ญ่อ", "ผิว" : "ผิว", "ฝ่าเท้า" : "ฝ่าตี๋น",
"ฝ่ามือ" : "อ้งมือ", "พุง" : "ขี้ปุ๋ม", "พุงปลา" : "ปื๊นต๊อง", "เพดานปาก" : "เพดานปาก", "ฟัน" : "เขี้ยว",
"ฟันกราม" : "เขี้ยวเก๋า", "ฟันน้ำนม" : "เขี้ยวน้ำนม", "มดลูก" : "ม่ดลูก", "มันสมอง" : "อ่องออ", "ม้าม" : "ม้าม",
"มือ" : "มือ", "ริมฝีปาก" : "ฮิมปาก", "ลายมือ" : "ลายมือ", "ลำไส้" : "ไส้", "ลิ้น" : "ลิ้น",
"ลิ้นไก่" : "ลิ้นไก่", "ลิ้นปี่" : "ลิ้นปี่", "ลูกกระเดือก" : "แก๋นคอ", "ลูกตา" : "แก่นต๋า", "ลูกนัยน์ตา" : "แก่นต๋า",
"ลูกอัณฑะ" : "ขะหล๋ำ", "เล็บเท้า" : "เล่บตี๋น", "เล็บมือ" : "เล่บมือ", "สะดือ" : "สะดือ", "สะโพก" : "ตะก้าม",
"สีข้าง" : "ขี้ข้าง", "เส้นผม" : "เส้นผม", "เส้นเอ็น" : "เส้นเอ็น", "ไส้ตัน" : "ไส้ตั๋น", "ไส้อ่อน" : "ไส้หวาน",
"หงอน" : "หงอน", "หนวด" : "หนวด", "หนอก" : "หนอก", "หนัง" : "หนัง", "หน้า" : "หน้า",
"หน้าแข็ง" : "หน้าแข็ง", "หน้าท้อง" : "หน้าต๊อง", "หน้าผาก" : "หน้าผาก", "หน้าอก" : "หน้าอ๋ก", "หลอดลม" : "หลอดลม",
"หลังเท้า" : "หลังตี๋น", "หลังมือ" : "หลังมือ", "หัว" : "หัว", "หัวเข่า" : "หัวเข่า", "หัวใจ" : "หัวใจ๋",
"หัวเหน่า" : "หัวเหน่า", "หัวโหนก" : "หัวโหนก", "หัวไหล่" : "หัวไหล่", "หาง" : "หาง", "หู" : "หู",
"เหงือก" : "เหงือก", "เหนียง" : "เหนียง", "เหล็กใน" : "เหล๋กใน", "โหนก" : "หนอก", "ไหล่" : "บ่า",
"องคชาติ" : "ไอ่จ้วย", "อวัยวะเพศหญิง" : "จิ๋ม", "อัณฑะ" : "ขะหลำ", "เอ็น" : "เอ็น", "เอว" : "แอว",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับส่วนต่างๆของพืช
"กะลา" : "กะโหล้ง", "ก้าน" : "ก้าน", "กาบ" : "กาบ", "กิ่ง" : "กิ่ง", "เกสร" : "เก๋สร",  
"แขนง" : "แขนง", "ข้อ" : "ข้อ", "ขั้ว" : "ขวั้น", "ค่าคบ" : "ง่าไม้", "เครือ" : "เคือ",  
"โคนต้น" : "ตางเก๊า", "แง่ง" : "แง่ง", "จั่น" : "จั่น", "จาว" : "จ๋าว", "ซังข้าวโพด" : "แก๋นใน",  
"ต้น" : "เก๊า", "ตอ" : "ต๋อ", "ตาไม้" : "ต๋าไม้", "ทางมะพร้าว" : "ก้าน", "ใบ" : "ใบ",  
"ปล้อง" : "ป้อง", "ปลี" : "ปี๋", "เปลือก" : "เปือก", "ฝัก" : "ฟั๋ก", "เมล็ด" : "แก่น",  
"ยวง" : "ญวง", "ยอด" : "ญอด", "ราก" : "ฮาก", "ผล" : "หน่วย", "หน่อ" : "หน่อ",  
"หยวก" : "หยวก", "หัว" : "หัว", "เหง้า" : "เหง้า", "กะลา" : "กะโหล้ง", "ก้าน" : "ก้าน",  
"กาบ" : "กาบ", "กิ่ง" : "กิ่ง", "เกสร" : "เก๋สร", "แขนง" : "แขนง", "ข้อ" : "ข้อ",  
"ขั้ว" : "ขวั้น", "ค่าคบ" : "ง่าไม้", "เครือ" : "เคือ", "โคนต้น" : "ตางเก๊า", "แง่ง" : "แง่ง",  
"จั่น" : "จั่น", "จาว" : "จ๋าว", "ซังข้าวโพด" : "แก๋นใน", "ต้น" : "เก๊า", "ตอ" : "ต๋อ",  
"ตาไม้" : "ต๋าไม้", "ทางมะพร้าว" : "ก้าน", "ใบ" : "ใบ", "ปล้อง" : "ป้อง", "ปลี" : "ปี๋",  
"เปลือก" : "เปือก", "ฝัก" : "ฟั๋ก", "เมล็ด" : "แก่น", "ยวง" : "ญวง", "ยอด" : "ญอด",  
"ราก" : "ฮาก", "ผล" : "หน่วย", "หน่อ" : "หน่อ", "หยวก" : "หยวก", "หัว" : "หัว",  
"เหง้า" : "เหง้า", "กะลา" : "กะโหล้ง", "ก้าน" : "ก้าน", "กาบ" : "กาบ", "กิ่ง" : "กิ่ง",  
"เกสร" : "เก๋สร", "แขนง" : "แขนง", "ข้อ" : "ข้อ", "ขั้ว" : "ขวั้น", "ค่าคบ" : "ง่าไม้",  
"เครือ" : "เคือ", "โคนต้น" : "ตางเก๊า", "แง่ง" : "แง่ง", "จั่น" : "จั่น", "จาว" : "จ๋าว",  
"ซังข้าวโพด" : "แก๋นใน", "ต้น" : "เก๊า", "ตอ" : "ต๋อ", "ตาไม้" : "ต๋าไม้", "ทางมะพร้าว" : "ก้าน",  
"ใบ" : "ใบ", "ปล้อง" : "ป้อง", "ปลี" : "ปี๋", "เปลือก" : "เปือก", "ฝัก" : "ฟั๋ก",  
"เมล็ด" : "แก่น", "ยวง" : "ญวง", "ยอด" : "ญอด", "ราก" : "ฮาก", "ผล" : "หน่วย",  
"หน่อ" : "หน่อ", "หยวก" : "หยวก", "หัว" : "หัว", "เหง้า" : "เหง้า",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับสิ่งของเครื่องใช้
"กรรไกร": "มีดยับ", "ช้อน": "จ้อน", "ทัพพี": "ป้าก", "ไม้จิ้มฟัน": "ไม้จิ้มเขี้ยว", "ถังน้ำ": "น้ำคุ",
"จอบ": "ขอบก", "เก้าอี้ตัวเล็ก": "ก้อม", "หนังสือ": "หนังสือ", "ไฟแช๊ค": "ก้ับไฟ", "ร่ม": "จ้อง",
"ขันน้ำ": "ก๋อก", "ขันเงิน": "สลุ๋ง", "กุญแจ": "ขะแจ๋", "ตระกร้า": "ซ้า", "ที่นอน": "สลี",
"เสื่อ": "สาด", "กงดีดฝ้าย": "ก๋งดีดฝ้าย", "กรวยดอกไม้": "สวยดอกไม้", "กระจกส่องหน้า": "แว่น", "กระด้ง": "ด้ง",
"กระต่ายขูดมะพร้าว": "แมวขูดบะพร้าว", "กระทะ": "หม้อขาง", "กระบวย": "น้ำบวย", "กระบุง": "ซ้า", "กระป๋องน้ำ": "น้ำคุ่",
"กระโถน": "กะโถน", "กระสอบ": "กะสอบ", "กล่อง": "ก่อง", "กล่องข้าว": "ก่องเข้า", "กับดักสัตว์": "แคบ",
"กา": "ก๋า", "ตาชั่ง": "ต๋าจั้ง", "แก้วน้ำ": "แก้วน้ำ, ก๋อก", "เก้าอี้": "เก้าอี้", "ขวด": "ขวด",
"ขวาน": "มุย", "ข้อง": "ข้อง", "ขันเงิน": "สะหลุงเงิน", "ขันน้ำ": "ก๋อกน้ำ", "เข็ม": "เข็ม",
"เข็มซ่อนปลาย": "เข็มกะลั๋ด", "เขียง": "เขียง", "คนโท": "น้ำต้น", "ครก": "ค่ก", "ครกกระเตื่อง": "ค่กมอง",
"คราดไม้": "ไม้ตาบตา", "คีม": "กีม", "คีมปากนกแก้ว": "กีมน่กเก๊า", "เคียว": "เกียว", "จวัก": "ป้าก",
"จอก": "ก๋อก", "จอบ": "ขอบ๋ก", "จั่นดักปลา": "กะต้ำ", "จั่นห้าว": "จั่นห้าว", "จาน": "จาน",
"จุก": "จุ๋ก", "ช้อน": "จ๊อน", "เชี่ยนหมาก": "แอ๋บมาก", "เชือก": "เจื๊อก", "ส้อม": "ซ่อม",
"ไซ": "ไซ", "โซ่": "โส้", "ด้าย": "ฝ้าย", "ดินสอ": "ดินสอ", "ตลับ": "แอ๋บ",
"ตอก": "ตอก", "ตะกร้า": "ซ้า", "ตะแกรง": "เหิง", "ตะเกียง": "โกม", "ตะเกียบ": "ตะเกียบ",
"โต๊ะ": "ตั่ง", "ตู้": "ตู้", "ตู้เสื้อผ้า": "ตู้เสื้อผ้า", "ตู้เย็น": "ตู้เย็น", "เตียง": "เตียง",
"เตาไฟ": "เต๋าอังโล่", "โต๊ะ": "โต้ะ", "ขันโตก": "ขันโตก", "ถ้วย": "ถ้วย", "ถังน้ำ": "น้ำคุ่",
"ถาด": "ถาด", "ถุง": "ถง", "ถุงย่าม": "ถงญ่าม", "ไถ": "ไถ", "ทัพพี": "ป้าก",
"ที่นอน": "สะลี", "เบ็ด": "เบ๋ด", "เบาะรองนั่ง": "ผ้าก้อบ", "ปลอกหมอน": "เสื้อหมอน", "ปากกา": "ปากก๋า",
"แปรงสีฟัน": "แปงสีเขี้ยว", "ผ้าเช็ดตัว": "ผ้าตุ๋ม", "ผ้าเช็ดหน้า": "ผ้าเจ้ดหน้า", "ผ้าแพร": "ผ้าแพร", "ผ้านวม": "ผ้าด้วบ",
"ผ้าปูโต๊ะ": "ผ้าปู๋โต๊ะ", "ผ้าปูที่นอน": "ผ้าหล๋บ", "ผ้าม่าน": "ผ้าหม้าน", "ผ้าอ้อม": "ผ้าอ้อม", "ฝาชี": "ฝาจี",
"ฝาหม้อ": "ฝาหม้อ", "พร้า": "มีดโต้", "พัดลม": "พัดลม", "พัด": "วี", "พานดอกไม้": "ขันดอก",
"โพง": "น้ำถ้ง", "ฟืม": "ฟืม", "ไฟฉาย": "ไฟฉาย", "มีดพก": "มีดซุย", "มีด": "มีด",
"มีดบาง": "มีดบาง", "มุ้ง": "สุ๋ด", "ไม้กลัด": "ไม้กะลั๋ด", "ไม้กระบอง": "ไม้ค้อน", "ไม้กวาด": "ไม้ยู",
"ไม้ขีดไฟ": "กั๋บไฟ", "ไม้ถ่อ": "ไม้ถ่อ", "ไม้เท้า": "ไม้เต๊า", "ไม้บรรทัด": "ไม้บรรทั่ด", "ไม้พาย": "ไม้ฟาย",
"ไม้ส้าว": "ไม้ส้าว", "ไม้เสียบพริก": "ไม้เสียบพิ่ก", "ไม้เรียว": "ไม้แส้", "ยอ": "จ๋ำ", "ยางลบ": "ยางล่บ",
"ราง": "ฮาง", "แร้ว": "แฮ้ว", "ลังถึง": "ซึ้ง", "วงเวียน": "วงเวียน", "แว่นตา": "แว่นต๋า",
"สมุด": "สมุ๋ด", "สว่าน": "เหล๋กจี", "สวิง": "หิง", "สาก": "แก๋นค่ก", "สายตะพาย": "สายดัง",
"สายไฟ": "สายไฟ", "สุ่ม": "สุ่ม", "เสียม": "เสียม", "หนังสติ๊ก": "ก๋ง", "หม้อแกง": "หม้อแก๋ง",
"หม้อน้ำ": "น้ำหม้อ", "หลอดไฟ": "หลอดไฟ", "หวี": "หวี", "หิ้งพระ": "หิ้งพ่ะเจ้า", "หิ้ง": "ข่า",
"หีบ": "หีด", "หูก": "หูก", "แห": "แห", "ไหสำหรับนึ่งข้าว": "ไหข้าว", "ไห": "ไห",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับเครื่องนุ่งห่มและเครื่องประดับ
"แว่นตา":"แว่นต๋า", "กำไล":"ว้องแขน", "ยกทรง":"เสื้อใน", "กางเกง":"เต่ว", "กางเกงใน":"เต่วใน", 
"ผ้าถุง":"ซิ่น", "ถุงเท้า":"ถุงตี๋น", "เข็มขัด":"สายฮ้าง", "รองเท้า":"เกิบ", "รองเท้าบูท":"เกือกอ๊ก", 
"กระดุมบีบ":"มะต่อมแต๋บ", "กระดุม":"บะต่อม", "กระเป๋านักเรียน":"กะเป๋านักเรียน", "กระเป๋าถือ":"กะเลิ้บ", "กระเป๋า":"กะเป๋า", 
"กางเกงชั้นใน":"เตี่ยวใน", "กางเกงขาสั้น":"เตี่ยวก้อม", "กางเกงขายาว":"เตี่ยวหลั่ง", "กางเกงขาก๊วย":"เตี่ยวสะดอ", "กางเกง":"เตี่ยว", 
"กำไล":"ก๋ำไล", "เครื่องนุ่งห่ม":"เคื่องนุ่งคัวใบ", "ตุ้มหู":"จี้หู", "ถุงมือ":"ถุงมือ", "ปิ่น":"ปิ่น", 
"ผ้าข้าวม้า":"ผ้าต่อง", "ผ้าคลุม":"ผ้าตุ๊ม", "ผ้าถุง":"ผ้าสิ้น", "ผ้านุ่ง":"ผ้าต้อย", "ผ้าโจงกระเบน":"ผ้าต้อย", 
"ผ้าพันคอ":"ผ้าปันคอ", "ผ้าโพกหัว":"ผ้าเคียนหัว", "ผ้าห่มเฉียงบ่า":"ผ้าสะหว้ายแหล้ง", "ผ้าไหม":"ผ้าไหม", "พวงดอกไม้":"ดอกไม้ไหว", 
"รองเท้าแตะ":"เกือกแต๋ะ", "รองเท้า":"เกิบ", "สร้อยข้อมือ":"สายแขน", "สร้อยคอ":"ส้อย", "เสื้อชั้นใน":"เสื้อก้อม", 
"เสื้อผ้า":"คัวนุ่ง", "เสื้อเเขนสั้น":"เสื้อเเขนสั้น", "เสื้อเเขนยาว":"เสื้อเเขนญาว", "เสื้อคอกระเช้า":"เสื้อบ่าห้อย", "เสื้อกันหนาว":"เสื้อหนาว", 
"เสื้อกล้าม":"เสื้อก้อม", "เสื้อ":"เสื้อ", "โสร่ง":"โสล่ง", "แหวน":"แหวน",


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับเครื่องนุ่งห่มและของใช้ของพระสงฆ์
"กลด": "ก๋ด", "ผ้าเหลือง": "ผ้าเหลือง", "จีวร": "ผ้าลังก๋า", "ธรรมมาส": "ธรรมมาส", "ตาลปัตร": "ต๋าละปั๋ด",  
"บาตร": "บาตร", "ผ้ารัดประคด": "ผ้ามั่ดอ๋ก", "ผ้าสังฆาฏิ": "ผ้าป้าด", "ผ้าอังสะ": "ผ้าอังส๋ะ", "ผ้าอาบน้ำ": "ผ้าอาบ",  
"พัดยศ": "พั่ดญ่ด", "สบง": "สบง", "หีบใส่คัมภีร์": "หีดธรรม", "อาสนะ": "อาสน่ะ",

//////////////////////////////////////////////	คำศัพท์เกี่ยวกับธรรมชาติ
"กรวด":"มะแฮ่", "แก่ง":"แก่ง", "เกาะ":"เก๋าะ", "ข้างขึ้น":"เดือนออก", "ข้างแรม":"เดือนแฮม",  
"คุ้งน้ำ":"น้ำโก๊ง", "ขี้เถ้า":"ขี้เต้า", "จันทรคราส":"ก๋บกิ๋นเดือน", "ชะง่อนผา":"ผาเงิบ", "เชิงเขา":"ตี๋ยดอย",  
"ดวงจันทร์":"เดือน", "ดวงอาทิตย์":"ต๋าวัน", "ดาวลูกไก่":"ดาววี", "ดาวประจำเมือง":"ดาวหมูกอง", "ดาวประกายพฤกษ์":"ดาวผะก๋าย",  
"ดาวไถ":"ดาวง้อนไถ", "ดาว":"ดาว", "ดินดาน":"ดินดาก", "ดินเหนียว":"ดินเหนียว", "ดิน":"ดิน",  
"แดด":"แดด", "เดือนเพ็ญ":"เดือนเป็ง", "เดือนหงาย":"เดือนเเจ้ง", "ตลิ่ง":"ต๋าฝั่ง", "ตาน้ำ":"ต๋าน้ำ",  
"ถ้ำ":"ถ้ำ", "ทราย":"ซาย", "ทะเล":"ทะเล", "ท่าน้ำ":"น้ำต้า", "น้ำค้าง":"เหมย",  
"น้ำค้างแข็ง":"เหมยขาบ", "น้ำเชี่ยว":"น้ำเจี้ยว", "น้ำซับ":"น้ำจำ", "น้ำดื่ม":"น้ำกิ๋น", "น้ำตก":"น้ำต๋ก",  
"น้ำท่วม":"น้ำนอง", "น้ำนิ่ง":"น้ำตุ้น", "น้ำวน":"น้ำพั่ดต๋าไก่", "น้ำพุร้อน":"โป่งน้ำฮ้อน", "ปลัก":"บวก",  
"ป่าละเมาะ":"แพ่ะ", "ป่า":"ป่า", "โป่ง":"ป่ง", "ผง":"ผง", "ผีพุ่งใต้":"ผีปุ้งส้าว",  
"ฝน":"ฝน", "ฝุ่น":"ฝุ่น", "พยับแดด":"แดดบ๋ด", "พายุ":"ลมหลวง", "โพรงใต้ต้นไม้":"ก๋วง",  
"ภูเขาเตี้ยๆ":"ม่อน", "ภูเขา":"ดอย", "เมฆ":"เมฆ", "แม่น้ำ":"น้ำแม่", "รุ้งกินน้ำ":"ฮุ้งกิ๋นน้ำ",  
"ฤดู":"หน้า", "ลมที่พัดเป็นวงขึ้นไป":"ลมกิ๋ดกิ๋ว", "ลม":"ลม", "ลำคลอง":"ลำเหมือง", "ลำธาร":"ลำห้วย",  
"ลูกเห็บ":"บ่าเห๋บ", "สันเขา":"แป๋ดอย", "หนองน้ำ":"น้ำเหมือง", "หน้าผา":"หน้าผา", "หมอก":"หมอก",  
"ห้วงน้ำ":"วังน้ำ", "เหว":"เหว", "อากาศ":"อากาศ", "ไอน้ำ":"ไอน้ำ",  


//////////////////////////////////////////////	คำศัพท์ที่เกี่ยวกับสิ่งปลูกสร้างและอุปกรณ์ในการก่อสร้าง
"กระเบื้องไม้มุงหลังคา":"แป้นเก๋ด","กระเบื้องดินเผามุงหลังคา":"แป้นดินขอ","กระเบื้อง":"กะเบื้อง","กระท่อม":"ตูบ","กลอน":"ก๋อน",  
"กบไสไม้":"เต่า","กุฎิ":"กุฏิ๋","กุญแจ":"ขะแจ๋","ขวาน":"มุย","ขั้นบันได":"ตี๋นคันได",  
"ขื่อ":"ขื่อ","ค้อน":"ค้อน","คุ้ม":"คุ้ม","โครงบันได":"แม่คันได","เจดีย์":"ธาตุ",  
"เจดีย์บรรจุกระดูก":"กู่","จั่ว":"จั่ว","ชาน":"จาน","ชายคา":"จายคา","ด้านหลังของบ้าน":"ก้นตู",  
"ตะปู":"เหล๋กกน","โถงหน้าห้องนอน":"เติ๋น","ธรณีประตู":"แม่ปะตู๋","บันได":"คันได","ปะรำ":"ผาม",  
"ปั้นลม":"ป้านลม","ประตู":"ปะตู๋","ปูนขาว":"ปู๋นขาว","แป":"แป๋","โบสถ์":"โบสถ์",  
"ฝาไม้กระดาน":"ฝาแป้น","ฝาไม้ไฝ่สาน":"ฝาถึม","ฝา":"ฝา","พร้า":"พ้า","เพดาน":"ค่วน",  
"ฟาก":"ฟาก","ไม้กระดาน":"ไม้แป้น","ไม้เมตร":"ไม้เมตร","ไม้ระแนง":"ไม้ก้านฝ้า","ยุ้งข้าว":"หลองเข้า",  
"รอด":"แวง","รั้ว":"ฮั้ว","ราว":"ฮาว","ร้าน":"ฮ้าน","เรือน":"เฮือน",  
"โรงเรียน":"โฮงเฮียน","โรงพัก":"โฮงพั่ก","โรงพยาบาล":"โฮงยา","โรงนา":"เถียงนา","โรงครัว":"โฮงคัว",  
"โรง":"โฮง","เลื่อย":"เลื่อย","โลงศพ":"หล้อง","วัด":"วั่ด","วิหาร":"วิหาร",  
"ศาลา":"ศาลา","สลัก":"แซ่ว","สะพาน":"ขัว","สว่าน":"เหล๋กจี","สิ่ว":"สิ่ว",  
"เสาเอก":"เสามงกน","เสาตอท่อ":"เสาป๋อก","เสา":"เสา","ส้วมพระ":"ฐาน","หน้ามุข":"หน้ามุข",  
"หน้าต่าง":"ป่อง","หลังคา":"หลังคา","หอ":"หอ","ห้องครัว":"คัวไฟ","ห้องนอน":"ห้องนอน",  
"ห้องส้วม":"ส้วม","ห้องอาบน้ำ":"ต๊อมน้ำ","ห้าง":"ห้าง","อิฐ":"ดินกี่"  ,


//////////////////////////////////////////////	คำศัพท์ที่เกี่ยวกับผลไม้คำศัพท์ที่เกี่ยวกับอาหารและเครื่องปรุงอาหาร
"กระชาย":"ละแอน","กระเทียม":"หอมเตียม","กะทิ":"กะทิ","กะปิ":"กะปิ๋","กับข้าวสำเร็จรูป":"ของกิ๋นสุ๋ก",  
"กับข้าว":"กั๋บเข้า","กานพลู":"ดอกจั๋น","กำจัด":"มะแขว่น","เกลือ":"เกื๋อ","แกงจืด":"ต้มจืด",  
"แกง":"แก๋ง","ขนมจีน":"ขนมหนมเส้น","ขนมเทียน":"เข้าหนมจ๋อก","ขนมนางเล็ด":"เข้าแต๋น","ขมิ้น":"เข้าหมิ้น",  
"ข่า":"ข่า","ข้าวเหนียวดำ":"เข้าก่ำ","ข้าวเหนียวสังขยา":"เข้ามัน","ข้าวเหนียว":"เข้าหนึ้ง","ข้าวหลาม":"เข้าหลาม",  
"ข้าวสาร":"เข้าสาร","ข้าวสวย":"เข้าจ้าว","ข้าวเม่า":"เข้าเหม้า","ข้าวหมาก":"เข้าหมาก","ข้าวมื้อเย็น":"เข้าแลง",  
"ข้าวมื้อเที่ยง":"เข้าตอน","ข้าวมื้อเช้า":"เข้าเจ๊า","ข้าวเปลือก":"เข้าเปลือก","ข้าวมัน":"เข้ามัน","ข้าวต้มมัด":"เข้าต้มกะทิ่",  
"ข้าวต้ม":"เข้าต้ม","ข้าวเจ้า":"เข้าจ้าว","ข้าวเกรียบว่าว":"เข้าควบ","ขิง":"ขิง","งบ":"ห่อแอ๋บ",  
"งา":"งา","ตะไคร้":"จั๋กไค","น้ำจิ้ม":"น้ำจิ้ม","น้ำตาล":"น้ำต๋าน","น้ำปลา":"น้ำป๋า",  
"น้ำพริก":"น้ำพิ่ก","น้ำมัน":"น้ำมัน","น้ำส้ม":"น้ำส้ม","น้ำอ้อย":"น้ำอ้อย","เนื้อเค็ม":"จิ๊นเกื๋อ",  
"เนื้อ":"จิ๊น","บุหรี่":"บุลี","ปลากรอบ":"ป๋าแห้ง","ปลากระป๋อง":"ป๋ากั๋บ","ปลาเค็ม":"ป๋าบ๋วง",  
"ปลาร้า":"ป๋าฮ้า","ปลาแห้ง":"ป๋าบ้วง","พริกขี้หนู":"พิ่กแต้","พริกสด":"พิ่กหนุ่ม","พริกแห้ง":"พิ่กแห้ง",  
"มะกรูด":"บ่ะขูด","มะนาว":"บ่ะนาว","ยี่หร่า":"เตียนแถบ","ลูกชิด":"มะต๋าว","วุ้นเส้น":"งุ้นเส้น",  
"วุ้น":"งุ้น","ส้มฟัก":"ป๋าส้ม","หมาก":"หมาก","หมูทอด":"จิ๊นทอด","ห่อหมก":"ห่อหนึ้ง",  
"หัวหอม":"หอมบั่ว","เหมี้ยง":"เหมี้ยง","แหนม":"จี๊นส้ม"  ,


//////////////////////////////////////////////	คำศัพท์เกี่ยวกับชื่อผัก
"ผักตำลึง":"ผักแคบ","ชะพลู":"ผักแค","คื่นช่าย":"ผักกะพืน/กำปึน","พริกขี้หนู":"พริกแด้","กระเทียม":"หอมเทียม",
"ข้าวโพด":"ข้าวสาลี","มะรุม":"บะค้อนก้อม","กระเจี๊ยบเขียว":"บะเขือมั่น","ใบบัวบก":"ผักหนอก","ผักชี":"ผักป้อม",
"ผักชีฝรั่ง":"ผักป้อมเป้อ","มะเขือขื่น":"บะเขือฮึน","ใบแมงลัก":"ก๊อมก่อขาว","ถั่วแปป":"บะแปป","ผักกะเฉด":"ผักหนองน้้ำ",
"เพกะ":"บะลิ้นไม้","ผักแพว":"ผักไผ่","สะระแหน่":"ผักด่วน","หัวหอม":"หอมแดง","ชะอม":"ผักหละ",
"กระเจี๊ยบแดง":"ส้มปู๋","กะหล่ำปลี":"ผักกะหล่ำ","ถั่วลันเตา":"ถั่วหน้อย","ผักโขม":"ผักหม","กระชาย":"หัวระแอน",
"กุยช่าย":"ผักแป้น","ไมยราบ":"หญ้าจิ๊หย่อบ","กะเพรา":"กะเพรา","โหระพา":"ผักก๊อมก้อ","พริกสด":"พริกหนุ่ม",
"กระบก":"บ่ะมื่น","กะเพรา":"กะเพรา","กระถิน":"กะถิน","กลอย":"ก๋อย","กะหล่ำดอก":"กะหล่ำดอก",
"กะหล่ำปลี":"กะหล่ำปี๋","กะทกรก":"ผั่กแคบฝลั่ง","ไข่น้ำ":"ผำ","ขึ้นฉ่าย":"ผั่กก๋ำปืน","ตูน":"ตูน",
"ชะพลู":"ผั่กแค","ชะอม":"ผั่กล๋ะ","ดอกแค":"ดอกแก","ดอกขจร":"ดอกสลิ๋ด","ต้นหอม":"ผั่กหอม",
"แตงกวา":"บ่ะแต๋ง","แตงไทย":"บ่ะแต๋งลาย","แตงโม":"บ่ะเต้า","ถั่วงอก":"ถั่วงอก","ถั่วฝักยาว":"บ่ะถั่ว",
"ถั่วพู":"ถั่วปู","ถั่วลันเตา":"ถั่วน้อย","ถั่วลิสง":"ถั่วดิน","น้ำเต้า":"บ่ะน้ำ","บวบ":"บ่ะนอย",
"บอน":"บอน","บุก":"บุ๋ก","ใบกาหลง":"ผั่กเสี้ยว","ใบบัวบก":"ผั่กหนอก","ผักกระเฉด":"ผั่กหนอง",
"ผักกะเสิม":"ผั่กไผ่","ผักกาดหอม":"ผั่กกาดญี","ผักกาดเขียว":"ผั่กกาดจ้อน","ผักกาด":"ผั่กกาด","ผักกูด":"ผั่กกูด",
"ผักโขม":"ผั่กหม","ผักขวง":"ผั่กขี้ขวง","ผักคราด":"ผั่กเผ๋ด","ผักคะน้า":"ผั่กคะน้า","ผักชะเลือด":"ผั่กปู่ญ่า",
"ผักชีล้อม":"ผั่กจี","ผักชีฝรั่ง":"หอมป้อมเป้อ","ผักชี":"หอมป้อม","ผักตำลึง":"ผั่กแคบ","ผักบุ้ง":"ผั่กบุ้ง",
"ผักปอด":"ผั่กกุ่มป่า","ผักปลัง":"ผักปั๋ง","ผักแว่น":"ผั่กแว่น","ผักเสี้ยน":"ผั่กส้มเสี้ยน","ผักหวาน":"ผั่กหวาน",
"พลู":"ปู","เพกา":"มะลิ่ดไม้","ไพล":"ปูเลย","เผือก":"เผือก","ฟักเขียว":"บ่ะฟั่กหม่น",
"ฟักทอง":"ฟั่กแก้ว","มะเขือขื่น":"บ่ะเขือแจ้","มะเขือเทศ":"บ่ะเขือส้ม","มะเขือเปราะ":"บ่ะเขือผ่อย","มะเขือพวง":"บ่ะแคว้ง",
"มะเขือยาว":"บ่ะเขือญาว","มะระขี้นก":"บ่ะไห่","มะระ":"บ่ะล่ะ","มะรุม":"บ่ะค้อนก้อม","มะแว้ง":"บ่ะแคว้งขม",
"มะอึก":"บ่ะเขือปู่","มันแกว":"มันแก๋วลาว","มันเทศ":"มันแก๋ว","มันสำปะหลัง":"มันต้าง","มันฝรั่ง":"มันอะลู",
"แมงลัก":"ก้อมก้อ","ลำโพง":"บ่ะเขือบ้า","สะเดา":"สะเลียม","หอมแป้น":"ผั่กแป้น","เห็ดฟาง":"เห๋ดเฟือง",
"เห็ดหูหนู":"เห๋ดหูแมว","หัวไชเท้า":"หัวผั่กกาด","โหระพา":"โหละพา",


//////////////////////////////////////////////	คำศัพท์ที่เกี่ยวกับผลไม้                      
"กล้วยไข่":"ก้วยไข่","กล้วยน้ำว้า":"ก้วยใต้","กล้วยหอม":"ก้วยค้าว","กล้วยหักมุก":"ก้วยส้ม","กะท้อน":"บ่ะตื๋น",
"ขนุน":"บ่ะหนุน","เงาะ":"เง่าะ","ชมพู่":"บ่ะซมปู","ตะขบ":"บ่ะเกว๋น","แตงโม":"บ่ะเต้า",
"แตงไทย":"บ่ะแต๋งลาย","ทับทิม":"บ่ะก๊อ","ทุเรียน":"ทุ่เลียน","น้อยหน่า":"บ่ะหน้อเเหน้","ฝรั่ง":"บ่ะก้วย",
"พุทรา":"บ่ะตัน","มะกอก":"บ่ะกอก","มะขามป้อม":"บ่ะขามป้อม","มะขามเทศ":"บ่ะขามข้อง","มะขาม":"บ่ะขาม",
"มะดัน":"บ่ะดัน","มะเดื่อ":"บ่ะเดื่อ","มะตูม":"บ่ะปิน","มะปราง":"บ่ะผ่าง","มะพร้าวอ่อน":"บ่ะป๊าวหนุ่ม",
"มะพร้าว":"บ่ะป๊าว","มะไฟ":"บ่ะไฟ","มะม่วง":"บ่ะม่วง","มะยม":"บ่ะญม","มะละกอ":"บ่ะก้วยเต้ด",
"มังคุด":"มังคุ่ด","ลองกอง":"ลองกอง","ละมุด":"บ่ะมุ่ด","ลางสาด":"ลางสาด","ลำไย":"ลำไญ",
"ลิ้นจี่ป่า":"บ่ะคอแลน","ลิ้นจี่":"ลั้นจี่","ลูกพลับ":"บ่ะกั๋บตอง","สมอ":"บ่ะน่ะ","ส้มเกลี้ยง":"ส้มเกี้ยง",
"ส้มเขียวหวาน":"ส้มเขียวหวาน","ส้มโอ":"บ่ะโอ","สับปะรด":"บ่ะขะหนั๋ด"


,		//////////////////		คำศัพท์ที่เกี่ยวกับดอกไม้
"กล้วยไม้":"ดอกเอื้อง","ดอกกระเจียว":"ดอกอาว","ดอกกระดัง":"ดอกสะบันงา","ดอกกระถินเทศ":"ดอกคำใต้","ดอกกุหลาบ":"ดอกกุหลาบ",
"ดอกแก้ว":"ดอกแก้ว","ดอกขจร":"ดอกสลิ๋ด","ดอกเข็ม":"ดอกเข็ม","ดอกคัดเค้า":"ดอกเก๋ดเก๊า","ดอกคูน":"ดอกลมแล้ง",
"ดอกจำปา":"ดอกจ๋ำป๋า","ดอกจำปี":"ดอกจำปี๋","ดอกชบา":"ดอกใหม่","ดอกซ่อนกลิ่น":"ดอกหอมไก๋","ดอกดาวเรือง":"ดอกคำปู้จู้",
"ดอกทองกวาว":"ดอกกว๋าว","ดอกทานตะวันป่า":"ดอกบัวตอง","ดอกทานตะวัน":"ดอกบัวผั่ด","ดอกเทียน":"ดอกเตียน","ดอกบัวเผื่อน":"ดอกป๊าน",
"ดอกบัว":"ดอกบัว","ดอกบานชื่น":"ดอกบานจื้น","ดอกบานไม่รู้โรย":"ดอกตะหล้อม","ดอกบานเย็น":"ดอกจ๋ำญาม","ดอกบุนนาค":"ดอกกำก่อ",
"ดอกปีบ":"ดอกก๋าสะลอง","ดอกพวงประดิษฐ์":"ดอกเคือออน","ดอกพิกุล":"ดอกแก้ว","ดอกพุดตาล":"ดอกสามสี","ดอกพุดช้อน":"ดอกเก๋ดถะหวา",
"ดอกพุด":"ดอกปุด","ดอกพุทธรักษา":"ดอกบัวละวง","ดอกพู่ระหง":"ดอกใหม่ส้อย","ดอกเฟื่องฟ้า":"ดอกเฟื่องฟ้า","ดอกมหาหงส์":"ดอกต๋าเหิน",
"ดอกมะลิวัลล์":"ดอกแซ่ว","ดอกมะลิ":"ดอกมะลิ่","ดอกยี่หุบ":"ดอกจี๋หุ๋บ","ดอกรัก":"ดอกป๋านเถื่อน","ดอกลั่มทม":"ดอกจ๋ำป๋าลาว",
"ดอกลำเจียก":"ดอกเกี๋ยง","ดอกลำดวน":"ดอกหอมวน","ดอกโศก":"ดอกส้มสุ๋ก","ดอกสารภี":"ดอกสาละปี","ดอกหงอนไก่":"ดอกด้าย"


,		//////////////////		คำศัพท์ที่เกี่ยกับชื่อไม้ยืนต้นและพืชล้มลุก
"กระสัง":"ฮากล้วย","ก้ามปู":"สำสา","ข่อย":"ข่อย","ขี้เหล็ก":"ขี้เหล๋ก","คราม":"ห้อม",
"งิ้ว":"งิ้ว","ชงโค":"เสี้ยว","ดอกดิน":"หญ้าเข้าก่ำ","เดือย":"เดือย","ต้อยติ่ง":"ผั่กดีด",
"ต้นโพธิ์":"เก๊าสะหลี","ต้นข้าว":"ต้นเข้า","ตาล":"ต๋าน","เตย":"เตย","ตำแย":"หานไก่",
"เต็ง":"ไม้แง่ะ","ไทร":"ไฮ","นุ่น":"งิ้ว","พลวง":"ไม้ตึง","พลับพลึง":"ลีลัว",
"พะยอม":"ขะญอม","ไพล":"ปูเลย","ฝอยทอง":"เคือเขาคำ","ฟาง":"เฟือง","บอระเพ็ด":"จุ้งจาลิง",
"มะกล่ำตาหนู":"มะก่ำต๋าไก่","ประคำดีควาย":"บ่ะซั่ก","ไมยราบ":"หญ้าจิ๋ญอบ","ไม้รวก":"ไม้ฮวก","ไม้ไร่":"ไม้ไฮ่",
"ไม้เลียบ":"ผั่กเฮือด","รัง":"ไม้เปา","ละหุ่ง":"บ่ะหุ่ง","ลาน":"ลาน","สลอด":"บ่ะข่าง",
"สาบเสือ":"หญ้าแมงวาย","สีเสียด":"สีเสียด","หญ้าเจ้าชู้":"หญ้าก่อน","หญ้า":"หญ้า","หนาด":"หนาด",
"หมามุ่ย":"บ่ะเหนียง","หมากผู้":"หมากปู๊","หมาก":"หมาก","หางนกยูง":"ซอมพอ"


,		//////////////////		คำศัพท์ที่เกียวกับชื่อปลาและสัตว์น้ำ
"ปลากด":"ป๋าก๋ด","ปลากระเบน":"ป๋าไม","ปลากระดี่":"ป๋าสะลาก","ปลากราย":"ป๋าต๋อง","ปลากา":"ป๋าก๋า",
"ปลาเข็ม":"ป๋าเข็ม","ปลาแขยง":"ป๋าแก้ด","ปลาช่อน":"ป๋าหลิม","ปลาชะโด":"ป๋าชะโด","ปลาดุก":"ป๋าดุ๋ก",
"ปลาตะเพียน":"ป๋าขาว","ปลาเทโพ":"ป๋าเต้าะ","ปลาทู":"ป๋าทู","ปลานิล":"ป๋านิล","ปลาเนื้ออ่อน":"ป๋าหวาน",
"ปลาบึก":"ป๋าบึ๋ก","ปลาสลิด":"ป๋าสะลิ๋ด","ปลาสร้อย":"ป๋าบอก","ปลาสวาย":"ป๋าสวาย","ปลาหมอ":"ป๋าสะเด๋ด",
"ปลาหมึก":"ป๋าหมึ๋ก","ปลาหมู":"ป๋าหมู","ปลาหลด":"ป๋าล๋ด","ปลาไหล":"ป๋าเหยี่ยน","ตัวนาก":"บ้วน"


,		//////////////////		คำศัพท์ทีเกี่ยวกับนกและสัตว์ปีก
"ไก่อู":"ไก่จง","ไก่ต่อ":"ไกตั้ง","ไก่ชน":"ไก่จน","ไก่แจ้":"ไก่แจ้","ไก่":"ไก่",
"ค้างคาว":"ฮุ้งคาว","นกกระจาบ":"น่กจาบ","นกกระจิบ":"น่กจิ๋บ","นกกระทา":"น่กกะทา","นกกระทุง":"น่กตุ่งตุง",
"นกกระปูด":"น่กก้นปู้ด","นกกระเรียน":"น่กเขียน","นกกระสา":"น่กคองู","นกกวัก":"น่กกวั๋ก","นกกระเต็น":"น่กกะเต็น",
"นกกางเขน":"น่กจี๋แจ้บ","นกกาเหว่า":"น่กก๋าเหว่า","นกกินปลี":"น่กกิ๋นปี๋","นกแก้ว":"น่กแล","นกขมิ้น":"น่กเข้าหมิ้น",
"นกขุนทอง":"น่กเอี้ยงคำ","นกเขา":"น่กเขา","นกแขวก":"น่กขวาก","นกเค้าแมว":"น่กเก๊า","นกเงือก":"น่กก๋ก",
"นกถึดทือ":"น่กปู่ติ้ด","นกนางแอ่น":"น่กแอ่น","นกปรอด":"น่กปิ๋ดจะลิว","นกพิราบ":"น่กก๋าแก๋","นกโพระดก":"น่กป๋ก",
"นกยาง":"น่กญาง","นกยูง":"น่กญง","นกแสก":"น่กเก๊าจ๊าง","เพลี้ย":"เพี้ย","มดคันไฟ":"ม่ดแดงไฟ",
"มดง่าม":"ม่ดง่าม","มดแดง":"ม่ดส้ม","มวนลำไย":"มวนลำไญ","มอด":"มอด","มิ้ม":"มิ้น",
"แมงกะชอน":"แมงจอน","แมงคาเรือง":"แมงคา","แมงป่องช้าง":"แมงเวา","แมงป่อง":"แมป่อง","แมงมุม":"ก๋ำปุ๊ง",
"แมลงตด":"แมงขี้ต๋ด","แมงปอ":"ก๋ำบี้","แมลงทับ":"แมงตั้บ","แมลงวัน":"แมงงน","แมลงภู่":"แมงปู้",
"แมลงสาบ":"แมงสาบ","แมลงหวี่":"แมงหวี่","ยุง":"ญุง","เรือด":"เฮือด","ริ้น":"ฮิ้น",
"ไร":"ไฮ","ลองไน":"แมงว้าง","ลูกน้ำ":"แมงง้องแง้ง","ไส้เดือน":"ไส้เดือน","หนอนผีเสื้อ":"แมงบ้ง",
"หนอน":"หนอน","เหนี่ยง":"เหนี่ยง","หมาร่า":"แมงใบ้","หมัด":"หมั๋ด","หิ่งห้อย":"หิ่งห้อย",
"เห็บ":"เห๋บ","เหา":"เหา"


,		//////////////////		คำศัพท์เกี่ยวกับสัตว์บก
"กระจง":"ไก้","กระต่าย":"กระต่าย","กระจ้อน":"ไหน่","กระทิง":"กะติง","กระรอก":"ฮอก",
"กวาง":"กว๋าง","เก้ง":"ฟาน","ควาย":"ควาย","ค่าง":"ก้าง","ชะนี":"อี่ฮุย",
"ชะมด":"เห็นอ้ม","ช้าง":"จ๊าง","ตุ่น":"ตุ่น","พังพอน":"ปังปอน","แมว":"แมว",
"ละมั่ง":"ละโว้","ลิง":"วอก","แรด":"แฮด","เสือ":"เสือ","หนู":"หนู",
"หมา":"หมา","หมี":"หมี","หมูป่า":"หมูป่า","หมู":"หมู","อ้น":"อ้น"


,		//////////////////		คำศัพท์เกี่ยวกับชื่อสัตว์เลื้อยคลานและสัตว์ครึ่งบกครึ่งน้ำ
"กบ":"ก๋บ","กิ้งก่า":"จั๊กก่า","เขียด":"เขียด","คางคก":"คางคาก","งูเขียว":"งูเขียว",
"งูจงอาง":"งูจ๋งละอาง","งูไซ":"งูไซ","งูสิง":"งูสิง","งูเห่า":"งูเห่า","จระเข้":"จระเข้",
"จิ้งจก":"จั๋กกิ้ม","จิ้งเหลน":"จั๋กกะเล้อ","ตะกวด":"แลน","ตะขาบ":"จั๋กเค๋บ","ตะเข็บ":"จั๋กเค๋บ",
"ตุ๊กแก":"ต๋กโต","แย้":"แญ้"


,		//////////////////		คำศัพท์เกี่ยวกับโรคภัยไข้เจ็บและอาการเจ็บป่วย
"กุ้งยิง":"ต๋าเป๋นต๋อน","ขี้แมลงวัน":"ขี้แมงงุน","ขี้เรื้อน":"ขี้เฮื้อน","คอพอก":"คอเอิม",
"คัน":"คัน","คางทูม":"ฮ่าวอก","เจ็บไข้ได้ป่วย":"เป๋นผะญาด","ต้อ":"ต้อ","ตาเข":"ต๋าเข",
"ตาส่อน":"ต๋าส่อน","ตาเหล่":"ต๋าเหล้","ตานขโมย":"ซาง","ตุ่ม":"ตุ่ม","ท้องเสีย":"หลุ๋ต๊อง",
"ท้องอืด":"กิ๋ั๋ดต๊อง","บ้า":"บ้า","ปวดขา":"เจ๋บขา","ปวดแขน":"เจ๋บแขน","ปวดตา":"เจ๋บต๋า",
"ปวดท้อง":"เจ๋บต๊อง","ปวดฟัน":"เจ๋บเขี้ยว","ปวดหลัง":"เจ๋บหลัง","ปวดหัว":"เจ๋บหัว",
"ปวดเอว":"เจ๋บแอว","เป็นไข้":"เป๋นไข้","เป็นลม":"เป๋นลม","แผลในปาก":"ขาง","ฝี":"ฝี",
"พยาธิ":"ตัวตืด","พิษสุนัขบ้า":"ว้อ","แพ้ยา":"แป๊ยา","แพ้อาหาร":"กิ๋นผิด","แพ้อากาศ":"แป๊อากาศ",
"ฟันหลอ":"เขี้ยวเว่า","มะเร็ง":"บ่ะเฮ็ง","ริดสีดวง":"บะโหกก้นปู้ด","เรื้อน":"ขี้ตูด",
"โรคกระษัย":"มะโหก","ลมบ้าหมู":"ลมจั้ก","ลมพิษ":"หมึน","วัณโรค":"ฝีในต๊อง","เวียนหัว":"เมาหัว",
"หอบ":"หอบ","ออกหัด":"ออกหั๋ด","อีสุกอีไส":"ตุ่มไส"


,		//////////////////		คำศัพท์เกี่ยวกับยานพาหนะและส่วนประกอบของพาหนะ
"กง":"ก๋ง","กำ":"ก๋ำ","เกวียน":"ล้องัว","คานหาม":"กานหาม","ซี่ล้อรถ":"สี้",
"โซ่":"โส้","ดุม":"ดุม","แตร":"แก","พวงมาลัย":"พวงมาลัย","แพ":"แป",
"เพลา":"เพา","ยางรถ":"ล้อ","รถเก๋ง":"ล่ดเก๋ง","รถจักรยาน":"ล่ดถีบ","รถมอเตอร์ไซค์":"ล่ดเคื่อง",
"รถดับเพลิง":"ล่ดเหวอ","รถตู้":"ล่ดตู้","รถบรรทุก":"ล่ดบันทุ่ก","รถไฟ":"ล่ดไฟ","รถม้า":"ล่ดม้า",
"รถยนต์":"ล่ดยนต์","รถสองแถว":"ล่ดสี่ล้อ","รถสามล้อ":"สามล้อถีบ","เรือ":"เฮือ","เรือสำเภา":"เฮือสะเปา",
"เสลี่ยง":"เสลี่ยง"



,		//////////////////		คำศัพท์เกี่ยวกับศาสนา วัฒนธรรม และประเพณี
"กรวยดอกไม้":"สวย","เข้าพรรษา":"เข้าพันสา","คัมภีร์":"กำปี","เครื่องไทยทาน":"คัวตาน","โคมลอย":"โกมลอย",
"งานฉลอง":"งานปอย","เจ้าอาวาส":"ตุ๊หลวง","ดอกไม้ไฟ":"บอกไฟ","เทศน์":"เต้ด","เทียน":"เตียด",
"ธงล้านนา":"ตุง","ธูป":"ธูป","น้ำมนต์":"น้ำมนต์","น้ำที่ใช้กรวดน้ำ":"น้ำหยาด","บวชเณร":"บวชลูกแก้ว",
"บวชพระ":"บวชเป้ก","ประตูป่า":"ปะตู๋ป่า","พระสงฆ์":"ตุ้เจ้า","พระผู้ใหญ่":"คูบา","พ่อซื้อแม่ซื้อ":"ป้อเกิดแม่เกิด",
"ระฆัง":"เด็ง","ลอยประทง":"ญี่เป็ง","วันขึ้น 15 ค่ำ":"วันเดือนเป็ง","วันเถลิงศก":"วันพะญาวัน","วันพระ":"วันศีล",
"วันมหาสงกรานต์":"วันสังขารล่อง","วันแรม 15 ค่ำ":"วันเดือนดั๋บ","วันสุกดิบ":"วันดา","สลากภัตร":"ก๋วยสลาก","สงกรานต์":"ปี๋ใหม่",
"สัปทน":"จ้องหลวง","ออกพรรษา":"ออกพันสา"


,		//////////////////		คำศัพท์เกี่ยวกับเครื่องดนตรี การแสดง การละเล่น และของเล่น
"กลองเพล":"ก๋องปู่จา","กลองยาว":"แอว","กลอง":"ก๋อง","ขลุ่ย":"ขุ่ย","ขายของ":"ขายคัว",
"ฆ้อง":"ก๊อง","ฉาบ":"สว่า","ฉิ่ง":"สิ่ง","ซ่อนหา":"ลั่บลี้","ตั้งเต":"บ้าต๋าแสง",
"ประทัด":"บ่ะถ๋บ","ปี่":"ปี่","แตรปี่":"แน","แตรวง":"แกวง","เพลงพื้นบ้าน":"ซอ",
"ระนาด":"ละนาด","รำ":"ฟ้อน","ลูกข่าง":"บ่ะข่าง","เล่นชิงช้า":"สิ๋กจุ้งจา","ว่าว":"ว่าว",
"หนังสติ๊ก":"ก๋ง"


,		//////////////////		คำศัพท์เกี่ยวกับอาชีพและสถานภาพของบุคคล
"กำนัน":"ป้อแคว่น","ข้าราชการ":"ข้าลาดสะก๋าน","คนขับเพลงพื้นบ้าน":"จ้างซอ","คนใช้":"คนใจ๊","คนฟ้อนรำ":"จ้างฟ้อน",
"ครู":"คู","คหบดีผู้ชาย":"ป้อเลี้ยง","คหบดีผู้หญิง":"แม่เลี้ยง","ช่างไม้":"จ้างไม้","ช่างทอผ้า":"จ้างตอผ้า",
"ช่าง":"จ้าง","ตำรวจ":"ต๋ำหนวด","ทหาร":"ตะหาร","นักร้อง":"นักฮ้อง","นายอำเภอ":"นายอำเภอ",
"ปลัด":"ปะลั๋ด","ผู้ชายที่หย่ากับภรรยา":"ป้อฮ้าง","ผู้ทำพิธีทางศาสนา":"อาจ๋าน","ผู้หญิงที่หย่ากับสามี":"แม่ฮ้าง","ผู้ใหญ่บ้าน":"ป้อหลวง",
"พยาบาล":"หมอ","พ่อค้า":"ป้อก๊า","พ่อหม้าย":"ป้อหม้าย","แม่ค้า":"แม่ก๊า","แม่หม้าย":"แม่หม้าย",
"ลูกจ้าง":"ลูกจ้าง","สัปเสร่อ":"สั่บปะเหล่อ","หมอผี":"หมอผี","หมอนวด":"หมอนวด","หมอดู":"หมอเมื่อ",
"หมอ":"หมอ","อาจารย์":"อาจ๋าน","อุบาสก":"ป้อออก","อุบาสิกา":"แม่ออก"


,		//////////////////		คำลักษณนาม
"กระบอก":"บอก","กลีบ":"กีบ","กอ":"ก๋อ","กอง":"ปุ้น","กำ":"ก๋ำ",
"ขั้น":"ขั้น","ข้าง":"ขอน","คน":"คน","ครั้ง":"เตื่อ","คัน":"กัน",
"คำ":"กำ","คืบ":"คืบ","คู่":"กู้","เครือ":"เคือ","ช่อ":"จ้อ",
"ชิ้นเล็กๆ":"ติ่น","ชั้น":"จั๊น","ซอง":"ซอง","ซี่":"สี้","ซึก":"โขบ",
"ดวง":"ดวง","ตน":"ต๋น","ต้น":"เก๊า","ตับ":"ไพ","ตัว":"ตั๋ว",
"ถุง":"ถง","แถว":"แถว","ท่อน":"ต้อน","ทะนาน":"ลิ่ตร","ทะลาย":"ปี๋",
"แปลง":"ปั้น","ผืน":"ผืน","แผ่น":"แผ่น","ฝัก":"ฝั๋ก","พวง":"ปุ้ก",
"พวก":"หมู่","พับ":"แหลบ","มวน":"เบ้า","มัด":"มั่ด","มื้อ":"มื้อ",
"ยวง":"ญวง","รูป":"ต๋น","ลูก":"แก่น","เล่ม":"เหล้ม","เล่ม":"เถี่ยน",
"วง":"บ้วง","วา":"วา","แว่น":"แหว้น","สาย":"สาย","เส้น":"เส้น",
"หลอด":"หลอด","หลัง":"หลัง","ห่อ":"ห่อ","หาบ":"หาบ","อย่าง":"อย่าง",
"อัน":"อัน"


,		//////////////////		คำกริยาเกี่ยวกับการปรุงอาหาร
"กวน":"ก๋วน","ก่อไฟ":"ดังไฟ","แกะ":"แก๋ะ","แกง":"แก๋ง","ขอด":"เถ๋าะ",
"ขยำ":"ฟั้น","ขูด":"ขูด","โขลก":"ต๋ำ","คน":"กน","คลุก":"คุ่ก",
"คั้น":"กั๊น","คั่ว":"ขั้ว","จี่":"จี่","จุ่ม":"จุ่ม","เจียว":"เจียว",
"เฉาะ":"เบ๋าะ","ชำแหละ":"คัว","แช่":"แจ่","ซอย":"ซอย","ซาวข้าว":"หวดเข้า",
"ดอง":"ดอง","เด็ด":"ไซ้","ตัก":"ตั๋ก","ต้ม":"ต้ม","ตำ":"ต๋ำ",
"เติม":"เตื่อม","ทอด":"ทอด","ทำอาหาร":"ญ่ะกิ๋น","ทุบ":"ตุ้บ","เท":"ถอก",
"นวด":"นวด","นึ่ง":"หนึ้ง","บด":"บ๋ด","บั้ง":"บั้ง","บีบ":"บีบ",
"ปอก":"ปอก","ปั่น":"ปั่น","ปั้น":"ปั้น","ปาด":"ปาด","ปิ้ง":"ปิ้ง",
"ผัด":"ผั๋ด","ผ่า":"โบ๋ะ","ผิง":"ผิง","เผา":"เผา","ฝัด":"ฟั๋ด",
"พลิก":"ปิ้น","มวน":"มวน","ม้วน":"ม้วน","มัด":"มั่ด","โม่":"โหม้",
"ยก":"ญ่ก","ยัด":"ป๋ด","ย่าง":"ญั่ด","ยำ":"หย้าง","ยี":"ส้า",
"ร่อน":"ญี","รูด":"ฮ่อน","ลวก":"ฮูด","ลอก":"ลวก","เลาะ":"ลอก",
"แล่":"เล่าะ","สะเด็ด":"แล่","สุก":"สะเด๋ด","สับ":"สุ๋ก","เสียบ":"ลาบ",
"ห่อ":"เสียบ","หั่น":"ห่อ","หุง":"ก๋ก","หมก":"หุง","หมัก":"หม๋ก",
"หลาม":"หลาม","อบ":"อบ"


,		//////////////////		คำกริยาที่เกี่ยวกับการกินเเละการดื่ม
"กลืน":"ลืน","กัด":"ข๋ม","กิน":"กิ๋น","เคี้ยว":"เกี๊ยว","งับ":"งั่บ",
"จิบ":"จิ๋บ","จิ้ม":"จิ้ม","ฉัน":"สัน","ชิม":"จิม","ซด":"หีบ",
"ดื่ม":"กิ๋น","ดูด":"ดูด","แทะ":"แหง้น","บ้วน":"บ้วน","ป้อน":"ป้อน",
"มอม":"มอม","รับประทาน":"กิ๋น","เลีย":"เลีย","อม":"อม"


,		//////////////////		คำกริยาเกี่ยวกับการแต่งตัว
"เกล้าผม":"มัดผม","โกนผม":"โก๋นผม","เขียนคิ้ว":"เขียนกิ้ว","คาด":"เคียด","คาด":"ฮั่ด",
"ดัดผม":"ดั๋ดผม","ทา":"ทา","ทำผม":"แป๋งผม","นุ่ง":"นุ่ง","แปรงผม":"แปงผม",
"ทาแป้ง":"ทาแป้ง","ม้วนผม":"ม้วนผม","ย้อมผม":"ญ้อมผม","ยีผม":"ญีผม","ไว้ผม":"ไว้ผม",
"ส่องกระจก":"แญงแว่น","สระผม":"สระหัว","สวมหมวก":"สุ๋บ","สวม":"ใส่","สางผม":"สางผม",
"ห่ม":"ห่ม","หวีผม":"หวีหัว"


,		//////////////////		คำกริยาที่เกี่ยวกับการพูดและการเปล่งเสียง คำกริยาเกี่ยวกับการพูดและการเปล่งเสียง
"กรน":"ขน","กระซิบ":"ซุ่บซาบ","กรีดร้อง":"เอ๋ก","กู่":"กู่","โกหก":"จุ๋",
"ขัน":"ขัน","คราง":"คาง","คุย":"อู้","คู":"ฮ้อง","จู้จี้":"ญ่อย",
"ด่า":"ด่า","ตอบ":"ตอบ","ตะโกน":"เอิ้น","ตะคอก":"เอ๋ก","ติดอ่าง":"ปากกั้ก",
"ถาม":"ถาม","เถียง":"เถียง","ทะเลาะ":"ผิ๋ดกั๋น","นินทา":"เล่าขวัญ","บ่น":"จ่ม",
"บอก":"บอก","ประกาศ":"ป่าว","ผิวปาก":"ผิวปาก","พูด":"อู้","เพ้อ":"เพ้อ",
"ร้องเรียก":"เอิ้น","ร้อง":"ฮ้อง","วาจาสิทธิ์":"ปากปิ้ด","เล่า":"เล่า","เสก":"เสก",
"หอน":"หอน","เห่า":"เห่า","หัวเราะเสียงดัง":"เหิด","โห่":"โห่"


,		//////////////////		คำกริยาที่เกี่ยวกับความรู้สึก
"กลัว":"กั๋ว","กล้า":"ก้า","โกรธ":"โขด","ขยะแขยง":"ขี้จ้ะ","คิดถึง":"กึ้ดเติงหา",
"แค้น":"แค้น","เจ็บใจ":"เจ๋บใจ๋","ชอบ":"ชอบ","เกลียด":"ชัง","ซึม":"ซึม",
"ดีใจ":"ดีใจ๋","ดูถูก":"ดูแควน","ตกใจ":"ต๋กใจ๋","ตื้นตัน":"กั้ดอ๋ก","ทุกข์ใจ":"ตุ้กใจ๋",
"น้อยใจ":"น้อยใจ๋","เบื่อ":"ก้าย","เป็นห่วง":"เป๋นห่วง","ไม่สบายใจ":"บ่สบายใจ๋","โมโห":"โขด",
"ร้องไห้":"ไห้","ร้อนใจ":"ฮ้อนใจ๋","ระอาใจ":"เสี้ยงใจ๋","รัก":"ฮั่ก","รำคาญ":"ลำคาญ",
"ลำบากใจ":"กึ้ดญาก","กังวล":"ใจ๋บ่ดี","ว้าเหว่":"ง่อม","เศร้า":"เส้า","สบายใจ":"ม่วนใจ๋",
"เสียใจ":"เสียใจ๋","เสียดาย":"กิ๋นแหนง","หนักใจ":"กึ้ดญาก","หน่าย":"หน่าย","หลง":"หลง",
"หวง":"ขาง","หึง":"ขาง","เหงา":"ง่อม","อยาก":"ไค่ได้","อิจฉา":"ขอย",
"อึดอัด":"บ่ม่วนใจ๋"


,		//////////////////		คำกริยาที่เกี่ยวกับอาหารของร่างกายและการเจ็บป่วย
"กระตุก":"กะตุ๋ก","เกร็ง":"เก็ง","ขากะเผลก":"ขาห้าน","เขม่น":"เขม่น","ค่อยยังชั่ว":"ญังแควน",
"คลอดลูก":"เกิดลูก","ง่วงนอน":"ไค่หลั๋บ","ใจสั่น":"ใจ๋บ่ดี","จุก":"กั้ดต๊อง","ชา":"หมึน",
"ชัก":"จั้ก","ตาลาย":"ต๋าลาย","ถ่ายยา":"ถ่ายยา","แน่นท้อง":"กั้ดต๊อง","แน่นหน้าอก":"แหน้นหน้าอ๋ก",
"โน":"โน","ปวดมวน":"กิ้ว","ปวด":"เจ็บ","ปูด":"ปูด","เป็นลม":"เป๋นลม",
"เพ้อ":"เพ้อ","ฟื้น":"ฟื้น","มีท้อง":"มานลูก","รู้สึกตัว":"ฮู้คิง","ระบม":"ละบม",
"ลาม":"ลาม","เรอ":"เอ๋อะ","ละเมอ":"กั้ง","เวียนหัว":"เมาหัว","สลบ":"สล๋บ",
"สั่น":"สั่น","สะอึก":"สะอึ๋ก","สำลัก":"สะมั่ก","สร่าง":"ส่าง","แสบ":"แสบ",
"เสียด":"เสียด","หน้ากลัว":"หน้ามืด","หอบ":"หอบ","หายใจ":"หายใจ๋","หาว":"หาว",
"หิว":"อยาก","เหนื่อยอ่อน":"อิ๋ดอ่อน","เหนื่อย":"อิ๋ด","หมดสติ":"บ่ฮู้คิง","อยู่ไฟ":"อยู่เดือน"


,		//////////////////		คำกริยาเกี่ยวกับการทำความสะอาด
"กวาด":"กวาด","เก็บผ้า":"ล้อนผ้า","เก็บ":"เก๋บ","ขยี้":"สูสี","ขัด":"ขั๋ด",
"แขวน":"แขวน","คลุม":"คุม","จัด":"จั๋ด","เช็ด":"เจ้ด","ซัก":"ซั่ก",
"ตาก":"ตาก","ถู":"ถู","เท":"ถอก","ทิ้ง":"ขว้าง","ปัด":"ปั๋ด",
"ผึ่ง":"ตาก","ฟอก":"ฟอก","ยก":"ญ่ก","รีด":"ลีด","รื้อ":"ลื้อ",
"เรียง":"เลียง","ล้าง":"ซ่วย","ห้อย":"ห้อย"


,		//////////////////		คำกริยาที่เกี่ยวกับการเย็บปักถักร้อยและการผลิตสิ่งของ
"กรอ":"กอ","กลึง":"เคี่ยน","แก้":"แก้","แกะสลัก":"แก๋ะสลั๋ก","แกะ":"แก๋ะ",
"ขัดเงา":"ขั๋ดเงา","ควั่น":"ควั่น","เจาะ":"เจ๋าะ","ชุบ":"จุ้บ","ตัด":"ตั๋ด",
"ถัก":"ถั๋ก","ถาก":"ถาก","ทอ":"ตอ","เนา":"เนา","ปะ":"ป๋ะ",
"ปั่นด้าย":"ปั่นด้าย","ปั้น":"ปั้น","ผูก":"มั้ด","ฝน":"ฝน","ฟั่น":"ฝั้น",
"พับ":"พั่บ","มัด":"มั่ด","ย้อม":"ญ้อม","เย็บ":"ญิ๋บ","ร้อย":"ฮ้อย",
"เลาะ":"เล่าะ","วัด":"วั่ด","วาด":"แต้ม","สลัก":"สลั๋ก","สอย":"สอย",
"ห่อ":"ห่อ","หล่อ":"หล่อ","เหลา":"เหลา"


,		//////////////////		คำกริยาที่เกี่ยวกับการทำร้ายและการต่อสู้
"กด":"เต๋ก","กัด":"ข๋บ","กระทืบ":"ตี๋นตั้ง","กระแทก":"กะแทก","กวัก":"กวั๋ก",
"ขวิด":"ขวิ๋ด","เขกหัว":"วั่ดหัว","เขี่ย":"เขี่ย","ฆ่า":"ข้า","เฆี่ยน":"เขี้ยน",
"งับ":"งั่บ","จิก":"จิ๋ก","จิ้ม":"จิ้ม","ฉก":"ส๋ก","ฉุด":"ซุ๋ด",
"โฉบ":"ซูด","ชก":"จ้ก","ชน":"จน","ชี้":"จี๊","ซ้อม":"ซ้อม",
"ดัน":"ญู้","ดึง":"ดึง","ตบ":"ต๋บ","ต่อย":"จ้ก","ตี":"ตี๋",
"เตะ":"เต๋ะ","ทับ":"ทั่บ","ทุบ":"บุ๋บ","แทง":"แตง","ถอง":"ใส่ศอก",
"ถีบ":"ถีบ","บิด":"บิ๋ด","บีบ":"บีบ","แบก":"แบก","โบย":"ตี๋",
"ปล้ำ":"ป้ำ","ผลัก":"ยู้","โผล่":"แมน","พุ่งเข้าใส่":"หล่อใส่","ฟัน":"ฟัน",
"ฟาด":"ฟาด","ย่ำ":"ยญ่ำ","ยิง":"ยิง","รัด":"ฮั่ด","ลาก":"ลาก",
"หวด":"หวด","หยิก":"หยิ๋ก","เหยียบ":"ญ้ำ","เหวี่ยง":"เหวี่ยง"


,		//////////////////		คำกริยาที่เกี่ยวกับการเคลื่อนไหวและเคลื่อนที่
"ก้ม":"ก้ม","กระโจน":"โด๋น","กระชาก":"สะต้ก","กระดุกกระดิก":"กะดุ๋กกะดิ๋ก","กระเดาะ":"เด๋าะ",
"กระโดด":"กะโดด","กระตุก":"กะตุ๋ก","กระเถิบ":"ถ๋อดแถ๋ด","กระพริบตา":"พั่บต๋า","กวัก":"กวั๋ก",
"ก้าว":"ก้าว","กลิ้ง":"กลิ้ง","แกว่ง":"แกว่ง","ไกว":"ไกว๋","ขนส่ง":"ขนส่ง",
"ขยับ":"ข๋ด","ขยี้":"สี","ขึ้น":"ขึ้น","ขย่ม":"ห่ม","เข็น":"ญู้",
"เขย่ง":"แหย่งแย๋ง","เขย่า":"สว่าย","เขี่ย":"เขี่ย","โขยกเขยก":"ป๋อกกะแแด๋ก","คลาน":"กาน",
"คลอน":"คอน","คลึง":"กะลิ่ก","ควัก":"ควั่ด","คว้า":"เปี๋ย","คืบ":"คืบ",
"งัด":"งั่ด","เงย":"เงย","เงื้อ":"เงื้อ","จม":"จ๋ม","จูง":"จู๋ง",
"ฉุด":"ดึง","โฉบ":"ซูด","เฉี่ยว":"ซวาด","ชะเง้อ":"เหง้ย","ชะโงก":"หยื้อหน้า",
"ชัก":"จั้ก","เซ":"เซ","แซง":"แซง","โซเซ":"โซเซ","ดัน":"ญู้",
"ดำน้ำ":"ดำน้ำ","ดึง":"ดึง","เดินผ่าน":"เตียวก๋าย","เดิน":"เตียว","ตก":"ต๋ก",
"ต้อน":"ต้อน","ตอม":"ต๋อม","ตะครุบ":"ญั่บ","เต้น":"เต้น","ไต่":"ไต่",
"ถอด":"ถอด","ถอย":"ถอย","ถัด":"แถ๋ด","ไถ":"ไถ","ไถล":"ผะเลิด",
"ลื่น":"ผะเลิด","บิน":"บิน","ปรี่เข้าหา":"งอมใส่","ปล่อย":"ป่อย","ปลิว":"ปิ๋ว",
"ปีน":"ขึ้น","ผลัก":"ญู้","ผุด":"ผุ๋ด","ฝ่า":"ฝ่า","หยักหน้า":"กะง่อกหัว",
"พยุง":"เฟีย","พลิก":"ปิ้น","พัง":"ปัง","ตลิ่งพัง":"โหยด","พัด":"ปั้ด",
"พา":"ปา","พุ่ง":"ปุ้ง","ฝัด":"ฝั๋ด","ฟัด":"ฟั่ด","มุด":"มุ่ด",
"ย่อง":"ย่อง","ย้าย":"ญ้าย","ยืนค้ำศีรษะ":"ยืนงำหัว","โยก":"โยก","ร่อน":"ร่อน",
"ร่วง":"หล่น","ลง":"ลง","ลอด":"ลอด","ลาก":"ลาก","ลุก":"ลุ่ก",
"เลี้ยว":"เลี้ยว","แล่น":"แล่น","ไล่":"ไล่","วก":"ว่ก","วน":"วน",
"ว่าย":"หว้าย","วิ่ง":"วิ่ง","เวียน":"เวียน","ส่ง":"ส่ง","สะดุ้ง":"สะดุ้ง",
"สะบัด":"สะวั่ด","สั่น":"สั่น","หกล้ม":"ต้าว","หรี่":"หลี่","หล่น":"หล่น",
"หลุด":"หลุ๋ด","ห้อย":"ห้อย","หา":"เซ่าะ","เหลียว":"เหลียว","เหาะ":"เห๋าะ",
"แหงน":"แหงน","เหนี่ยว":"เหนี่ยว","หมุน":"ผั๋ดมน","โหน":"โหน","ไหล":"ไหล",
"ไหว":"ไหว","อ้อม":"อ้อม","แอ่น":"แง่น","เอื้อม":"หยื้อ"


,		//////////////////		คำกริยาที่เกี่ยวกับการศึกษาเล่าเรียน
"เขียน":"เขียน","คัด":"คั่ด","จด":"จ๋ด","จบ":"จ๋บ","จำ":"จ๋ำ",
"ท่อง":"ท่อง","รู้":"ฮู้","เรียน":"เฮียน","ลอก":"ลอก","วาด":"วาด",
"สอบ":"สอบ","อ่าน":"อ่าน"


,		//////////////////		คำกริยาที่เกี่ยวกับการเกษตร
"กลบ":"หล๋บ","เกี่ยว":"เกี่ยว","ขุดทำแปลง":"บ๋กแปง","ขุด":"ขุ๋ด",
"ขุน":"ขุน","ชำ":"จำ","เด็ด":"เด็ด","ตอน":"ต๋อน","ถอน":"หล๋ก",
"ถางหญ้า":"แส๋ะหญ้า","ไถ":"ไถ","นวดข้าว":"นวดเข้า","ปลูก":"ปูก",
"พรวนดิน":"พวนดิน","เพาะ":"เป่าะ","ฟัก":"ฟั่ก","ฟันกิ่งไม้":"ปั้ดกิ่ง",
"รดน้ำ":"ห๋ดน้ำ","ลิด":"ลิ่ด","เลี้ยง":"เลี้ยง","หว่าน":"หว่าน",
"ให้อาหาร":"เกื๋อเข้า"


,		//////////////////		คำกริยาที่เกี่ยวกับตา
"กระพริบตา":"พั่บต๋า","ขยี้ตา":"สีตา","ขึงตา":"จงต๋า","ค้อน":"หลั๋บต๋าจัง",
"จ้องดู":"ส่องผ่อ","จ้องมอง":"เหง้อ","ชม้อย":"แลต๋า","ชายตามอง":"แลต๋า",
"ชำเลือง":"แล","ตั้งตาคอยดู":"แนผ่อ","ถลึงตา":"โมกต๋า","ทำตาปริบๆ":"พั่บต๋าหยิ๋บๆ",
"เพ่งดู":"แญงผ่อ","มองเห็น":"หันใส่","มองหา":"ส่องผ่อ","มอง":"ผ่อ",
"ลืมตา":"มืนต๋า","เล็ง":"เเน","ส่อง":"แญง","หรี่ตา":"หลี่ต๋า","หลบตา":"หล๋บต๋า",
"หลับตา":"หลั๋บต๋า","เห็น":"หัน","เหลือกตา":"เหลือกต๋า","เหลือบเห็น":"สั่ดต๋าหัน",
"แอบดู":"ผ๋กผ่อ"



,		//////////////////		คำบุรุษสรรพนาม
"กู":"ฮา","แก":"สู","ข้า":"ข้า","เขา":"เปิ้น","คุณ":"คุณ","ฉัน":"เฮา",
"ดิฉัน":"ข้าเจ้า","ท่าน":"ต่าน","เธอ":"ตั๋ว","ผม":"ผม","พวกเรา":"หมู่เฮา",
"พี่สาว":"ปี้","พี่ชาย":"อ้าย","มัน":"มัน","มึง":"มึง","เรา":"เฮา"


,		//////////////////		คำแสดงคำนาม
"กี่":"กี่","ใคร":"ไผ","ทำไม":"ยะใด","เหตุใด":"เป๋นใด",
"เท่าไหร่":"เต้าใด","บ้าง":"พ่อง","เพราะเหตุใด":"เพราะอะหยัง",
"หรือว่า":"ก่อว่า","หรือ":"หรือ","ไหน":"ไหน","ไหม":"ก่อ",
"อย่างไร":"จะใด","อะไร":"อะหญัง"


,		//////////////////		คำยอกกำหนดหรือชี้เฉพาะ
"ทางนี้":"ตางเพ้","ทางโน้น":"ตางปู๊น","ที่นั่น":"ตี้หั้น",
"ที่นี่":"ตี้หนี้","เท่านั้น":"เต้าอั้น","เท่านี้":"เต้าอี้",
"นั้น":"นั้น","นั่น":"หั้น","นี้":"นี้","นี่":"หนี้",
"นี่ไง":"หนี้ลอ","โน่น":"ปู๊น","โน้น":"ปู๊น",
"อย่างนี้":"จะอี้","อย่างนั้น":"จะอั้น"


,		//////////////////		คำบอกช่วงเวลาใน1วัน
"เช้า":"เจ๊า","ดึก":"ดึ๋ก","เที่ยง":"เตี้ยง",
"บ่าย":"บ่าย","เย็น":"แลง","รุ่งสาง":"ใกล้เเจ้ง",
"สาย":"ขวาย","หัวค่ำ":"เมื่อค่ำ"


,		//////////////////		คำบอกระยะเวลา
"กลางคืน":"เมื่อคืน", "กลางวัน":"เมื่อวัน", "งวด":"งวด", "จนสว่าง":"เต๊าแจ้ง", "ชั่วโมง":"จั้วโมง",
"ช้า":"จ๊า", "เดิมที":"หัวตี", "เดี๋ยวเดียว":"กำเดียว", "เดี๋ยวนี้":"บ่ะเดี่ยวนี้", "ขณะนี้":"บ่ะเดี่ยวนี้",
"ตลอดคืน":"สุ๋ดคืน", "ตลอดวัน":"วันค่ำ", "ตอนนี้":"ต๋อนนี้", "แต่ก่อน":"ตะก่อน", "ทั้งวันทั้งคืน":"ตึงวันตึงคืน",
"ทุกวัน":"ตึงวัน", "ทุ่ม":"ทุ่ม", "นาที":"นาที", "วินาที":"วินาที", "นาน":"เมิน",
"ประเดี๋ยว":"กำเดียว", "เดี๋ยว":"กำเดียว", "ปีก่อน":"ปี๋ก่อน", "ปีก่อนปีที่แล้ว":"ปี๋ซืน", "ปีที่แล้ว":"ปี๋แล้ว",
"ปีนี้":"ปี๋นี้", "ปีหน้า":"ปี๋หน้า", "เพล":"เพล", "เมื่อก่อน":"ตะก่อน", "เมื่อวานนี้":"ตะวานี้",
"โมง":"โมง", "ยาม":"ญาม", "เร็ว":"โวย", "ฤดูหนาว":"หน้าหนาว", "ฤดูร้อน":"หน้าฮ้อน",
"ฤดูฝน":"หน้าฝน", "ฤดู":"หน้า", "วันข้างขึ้น":"วันเดือนออก", "วันข้างแรม":"วันเดือนดั๋บ", "วันนี้":"วันนี้",
"วันพรุ่งนี้":"วันพู้ก", "วันเพ็ญ":"วันเดือนเป็ง", "วันมะรืน":"วันฮือ", "วันมะเรื่อง":"วันซืน", "วันเว้นวัน":"วันเว้นวัน",
"วันหน้า":"วันหน้า", "สมัยเก่า":"สมัยบ่าเก่า", "สมัยก่อน":"สมัยตะก่อน", "สักครู่":"สั๋กกำ", "สักครั้ง":"สั๋กเตื้อ",
"สักหน":"สั๋กเตื้อ", "สักพักหนึ่ง":"สั๋กบึ๋ด", "สัปดาห์":"อาติ้ด"


,		//////////////////		คำบอกจำนวนและปริมาณ
"เกินไป":"ล้ำไป", "เก้า":"เก้า", "เกลี้ยง":"เกี้ยง", "โกฎิ":"โกฎิ", "ค่อน":"ข้อน",
"ครึ่ง":"กึ่ง", "ครบ":"ค่บ", "คี่":"กี้", "คู่":"กู้", "เจ็ด":"เจ๋ด",
"เดี่ยว":"เดียว", "เต็ม":"เต๋ม", "ทั้งคู่":"ตึกกู้", "ทั้งหมด":"ตึงหม๋ด", "น้อย":"หน้อย",
"ปานกลาง":"มอกฮ้ายมอกดี", "ไม่ดีไม่เลวจนเกินไป":"มอกบ่ฮ้ายบ่ดี", "แปด":"แปด", "พัน":"ปัน", "พร่อง":"บ๋ก",
"มาก":"นั่ก", "มากๆ":"นั่กๆ", "เยอะๆ":"หลายๆ", "มากมาย":"นั่กขนาด", "ยี่สิบ":"ซาว",
"ร้อย":"ล้อย", "ล้าน":"ล้าน", "สอง":"สอง", "สาม":"สาม", "สิบ":"สิ๋บ",
"สี่":"สี่", "แสน":"แสน", "หก":"ห๋ก", "หนึ่งร้อยหนึ่ง":"ล้อยเอ๋ด", "หนึ่งร้อย":"ล้อยนึ่ง",
"หนึ่งพันหนึ่ง":"ปันเอ๋ด", "หนึ่งพัน":"ปันหนึ่ง", "หนึ่ง":"นึ่ง", "หมด":"เสี้ยง", "หมื่น":"หมื่น",
"หลาย":"หลาย", "ห้า":"ห้า", "โหล":"โหล"


,		//////////////////		คำบอกรสและรสชาติ
"ขม":"ขม", "ขื่น":"ขื่น", "เค็ม":"เก็ม", "จืด":"จ๋าง", "เซ็ง":"คาย",
"เปรี้ยว":"ส้ม", "เผ็ด":"เผ๋ด", "ฝาด":"ฝาด", "เฝื่อน":"ฮืน", "พอดี":"จั๋บปอดิ",
"มัน":"มัน", "กลมกล่อม":"ก๋ำปอ", "หวาน":"หวาน", "อร่อย":"ลำ"


,		//////////////////		คำบอกสี
"ขาวสลับดำ":"โก้ง", "ขาว":"ขาว", "เขียวแก่":"เขียวแก่", "เขียว":"เขียว", 
"ชมพู":"จมปู", "ซีด":"เปิด", "ดำ":"ดำ", "แดงเข้ม":"แดงก่ำ", "แดง":"แดง", 
"เทา":"หม่น", "น้ำเงิน":"แหล้", "น้ำตาล":"น้ำต๋าล", "เผือก":"ปอน", "ฟ้า":"ฟ้า", 
"ม่วงเข้ม":"ม่วงก่ำ", "ม่วง":"ม่วง", "ส้ม":"ส้ม", "แสด":"แสด", "เหลือง":"เหลือง"


,		//////////////////		คำบอกกลิ่น
"คาว":"คาว", "ฉุน":"ขิ๋ว", "สาบ":"สาบ", "หอม":"หอม", "เหม็น":"เหม็น", "หืน":"หืน"


,		//////////////////		คำบอกลักษณะ
"กรอบ":"ผ่อย", "กาง":"ก๋าง", "เก๊":"เก๊", "เกลี้ยง":"เกี้ยง", "โก่ง":"โก่ง",
"ของแท้":"ของแต๊", "ขัน":"ขัน", "ขุ่น":"ขุ่น", "เขยิน":"ซูน", "คด":"ก้ด",
"คม":"คม", "ค่อย":"ก้อย", "คล้าย":"ค้าย", "โค้ง":"โก๊ง", "งอน":"งอน",
"งุ้ม":"งุ้ม", "เฉ":"จ๊าย", "เฉา":"ญม", "แฉะ":"แจ้ะ", "ชัน":"จัน",
"ชื่น":"จื้น", "ชุ่ม":"จุ้ม", "ดัง":"ดัง", "ดี":"ดี", "ตรง":"ซื่อ",
"ตายนึ่ง":"ม้าน", "ตื้น":"ตื้น", "ถูก":"ถูก", "ทู่":"มุ่ม", "เท่า":"เต้า",
"นูน":"นูน", "เน่า":"เน่า", "บาง":"บาง", "บอบบาง":"แลบ", "บุบ":"เบบ",
"ปลอม":"ป๋อม", "แปลก":"แปก", "เปียก":"เปี๋ยะ", "ผอม":"ผอม", "ฟู":"ฟู",
"แฟบ":"ญุ่บ", "มัน":"มัน", "มัว":"มัว", "ย่น":"หญ้น", "ยับ":"ยั่บ",
"ร่วน":"ฮ่วน", "ร้าย":"ฮ้าย", "เรียบ":"เลียบ", "ลาด":"ลาด", "ลึก":"ลึ่ก",
"แวววาว":"เหลื้อม", "สด":"ส๋ด", "ใส":"ใส", "เหี่ยว":"เหี่ยว", "แห้ง":"แห้ง",
"แหลก":"เหลียก", "แหลม":"แหลม", "เหลว":"แหลว", "หนัก":"หนั๋ก", "เหนียว":"เหนียว",
"หมาด":"หมาด", "เหมือน":"เหมือน", "อ้วน":"ตุ้ย",


		//////////////////		คำบอกขนาด
"กว้าง":"กว้าง", "ขนาดนี้":"มอกอี้", "แค่นี้":"มอกอี้", "แคบ":"กีด", "ต่ำ":"ต่ำ",
"เตี้ย":"ป๋อก", "ปานกลาง":"มอกฮ้ายมอกดี", "พอดี":"มอกจั๋บ", "พอเหมาะ":"มอกปอดี", "ยาว":"ญาว",
"เล็ก":"หน้อย", "สั้น":"สั้น", "สูง":"สูง", "หนา":"หนา", "หนา":"หนา",
"ใหญ่":"ใหญ่",


		//////////////////		คำบอกสัมผัส
"แข็ง":"แข็ง", "คาย":"กาย", "ระคาย":"กาย", "ด้าน":"ด้าน", "น่วม":"น่วม",
"นุ่ม":"นุ่ม", "เย็น":"เย็น", "ร้อน":"ฮ้อน", "ลื่น":"มื่น", "เละ":"สว่าน",
"สาก":"จา", "หนาว":"หนาว", "อ่อน":"อ่อน", "อุ่น":"อุ่น", "ทำ":"ย่ะ",
"ห้าม":"จะไป",


		//////////////////		คำลงท้าย
"กระมัง":"ก๊า", "ครับ":"คั่บ", "คะ":"เจ้า", "ค่ะ":"เจ้า", "เฉยๆ":"บ่ดาย",
"ไง":"ลอ", "ไงล่ะ":"แหน่", "ซิ":"กะ", "สิ":"แป๋ะ", "เถอะ":"เต้อะ",
"เถิด":"เต้อะ", "เถอะนะ":"เต๊อะนา", "นะ":"เอาะ", "ด้วยนะ":"ตวย",
"นั่นแหละ":"น่ะก่า", "น่ะสิ":"น่ะก่า", "นา":"นา", "นะ":"นา", 
"หนอ":"เนอ", "ละสิ":"ล่ะกะ", "ละนะ":"ล่ะหนา", "ละ":"ล่ะ", 
"เลยแล้ว":"เลยเเล้ว", "เกินแล้ว":"เกินเเล้ว", "เลย":"แหละ", 
"อีกละ":"แหมเม่าะ", "วะ":"บ่า", "โว้ย":"บ่ะเฮ้ย", "เสียก่อน":"เฮี๋ยก่อน", 
"เสียที":"เฮี่ยกำ", "เสียสิ":"เฮี๋ยก่า", "เสียเลย":"เฮี้ยเลย", 
"เสียนี่":"สั๋กกำ", "แหละ":"น่ะ", "สวัสดี":"ส่ะหวัดดี", 
"ปลา":"ป๋า", "ไม่":"บ่ะ", "นอนพัก":"งีบ", "เชิงดอย":"ตี๋นดอย",


		//////////////////		หมวดหมู่ คำกิริยา
"คิดมาก":"กึ๊ดนัก", "อย่าคิดมาก":"จ๊ะไปกึ๊ดนัก", 
"ไม่ต้องคิดมาก":"จ๊ะไปกึ๊ดนัก", "ไม่ต้องไปคิดมาก":"จ๊ะไปกึ๊ดนัก", 
"อย่าไปคิดมาก":"จ๊ะไปกึ๊ดนัก", "ผม":"เปิ้ล", "ชื่อ":"จื่อ", 
"คิดไม่ออก":"กึ๊ดหม่ะออก", "อย่าพูดดัง":"จ๊ะไปอู้ดัง", 
"อย่าพูดเสียงดัง":"จ๊ะไปอู้ดัง", "ห้ามพูดเสียงดัง":"จ๊ะไปอู้ดัง", 
"พูดดัง":"อู้ดัง", "พูดเสียงดัง":"อู้ดัง", "อร่อยมาก":"จ๊าดลำ", 
"พูดมาก":"ปากนัก", "อย่าพูดมาก":"จ๊ะไปปากนัก", 
"ห้ามพูดมาก":"จ๊ะไปปากนัก", "ไม่ต้องมาพูดมาก":"จ๊ะไปปากนัก", 
"ไม่ต้องพูดมาก":"จ๊ะไปปากนัก",



}


function escapeRegExp(string) {
    return string.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
}

function satar() {
    var h3Element = document.getElementById('languageText');
    var inputElement = document.getElementById('searchInput');
    var resultElement = document.getElementById('result');

    if (!h3Element || !inputElement || !resultElement) {
        console.log("Error: Missing elements.");
        return;
    }

    var searchData = inputElement.value.trim();

    if (h3Element.classList.contains('swapped-h3')) {
        // 🟢 โหมดย้อนกลับ: แปลจากอังกฤษ → ไทย
        console.log('Mode 1: Reverse Lookup'); 
        var result = searchData;

        if (Object.values(dictionary).includes(searchData)) {
            result = Object.keys(dictionary).find(key => dictionary[key] === searchData);
        }

        resultElement.innerText = result;
        console.log("Translated Text (log1):", result);

    } else {
        // 🔵 โหมดปกติ: แปลจากไทย → อังกฤษ
        console.log('Mode 2: Normal Translation'); 
        
        var regex = new RegExp(Object.keys(dictionary).map(escapeRegExp).sort((a, b) => b.length - a.length).join("|"), "g");

        var result = searchData.replace(regex, function (matched) {
            return dictionary[matched];
        });

        resultElement.innerText = result;
        console.log("Translated Text:", result);
    }
}

// Function to switch between languages (Thai and Kham Mueang)
function changeText() {
    let h3 = document.getElementById("languageText");
    let h2 = document.getElementById("languageText2");

    // Toggle classes to swap languages
    h3.classList.toggle("swapped-h3");
    h2.classList.toggle("swapped-h2");

    // Swap positions of h3 and h2
    let h3Top = h3.style.top;
    let h2Top = h2.style.top;

    h3.style.top = h2Top;
    h2.style.top = h3Top;

    let h3Left = h3.style.left;
    let h2Right = h2.style.right;

    h3.style.left = h2Right;
    h2.style.right = h3Left;
 } 


 const crosshair = document.querySelector('.crosshair');
 const crosshairInner = document.querySelector('.crosshair-inner');

 let angle = 0;

 function updateRotation() {
     angle += 2; // ปรับค่าการหมุน (2 องศาต่อเฟรม)
     crosshairInner.style.transform = `rotate(${angle}deg)`;
     requestAnimationFrame(updateRotation);
 }

 document.addEventListener('mousemove', (e) => {
     crosshair.style.left = `${e.clientX}px`;
     crosshair.style.top = `${e.clientY}px`;
 });

 document.addEventListener('touchmove', (e) => {
     const touch = e.touches[0];
     crosshair.style.left = `${touch.clientX}px`;
     crosshair.style.top = `${touch.clientY}px`;
 });

 updateRotation(); // เรียกฟังก์ชันหมุนเมื่อโหลดหน้าเว็บ

 function randomWord() {
    const keys = Object.keys(dictionary);
    let randomWords = [];

    while (randomWords.length < 5) {
        const randomKey = keys[Math.floor(Math.random() * keys.length)];
        if (!randomWords.some(item => item.key === randomKey)) {
            randomWords.push({ key: randomKey, value: dictionary[randomKey] });
        }
    }

    let resultText = "ช่วง!!!!แนะนำคำศัพท์<br><br>"; // เว้นบรรทัดหลังหัวข้อ
    randomWords.forEach(item => {
       
    resultText += `${item.value} &nbsp; แปลว่า &nbsp; ${item.key}<br>`; // เพิ่มช่องว่างเล็กน้อยระหว่างคำ
});

    document.getElementById("result").innerHTML = resultText;
}

 
function createStars() {
    for (let i = 0; i < 10; i++) { // สร้างดาว 10 ดวง
        let star = document.createElement("div");
        star.classList.add("star");

        // สุ่มตำแหน่ง x และ y ภายในหน้าจอ (เพิ่มค่าตำแหน่ง x และ y สำหรับให้สูงขึ้นและไปขวานิดหน่อย)
        let x = Math.random() * (window.innerWidth - 100) + 50; // เพิ่มค่าตำแหน่ง x เพื่อให้ดาวเริ่มต้นไปทางขวา
        let y = Math.random() * (window.innerHeight - 200) + 50; // เพิ่มค่าตำแหน่ง y เพื่อให้ดาวเริ่มต้นสูงขึ้น

        // ตั้งค่า --x, --y สำหรับการเคลื่อนไหว
        star.style.setProperty('--x', `${x}px`);
        star.style.setProperty('--y', `${y}px`);

        // เพิ่มดาวลงในเอกสาร
        document.body.appendChild(star);

        // ใช้ setTimeout เพื่อแสดงดาวหลังจากกดปุ่ม
        setTimeout(() => {
            star.classList.add("visible");
        }, 100); // หลังจาก 100ms ดาวจะแสดงขึ้น

        // ลบดาวออกเมื่อการเคลื่อนไหวเสร็จสิ้น
        star.addEventListener('animationend', () => {
            star.remove(); // ลบดาวออกจาก DOM
        });
    }
}

document.addEventListener("DOMContentLoaded", function() {
    if (typeof responsiveVoice !== 'undefined') {
        responsiveVoice.speak("", "Thai Female"); // โหลดเสียงล่วงหน้า
    }
});

function sdata() {
    let text = document.getElementById("result").textContent.trim();
    if (!text) {
        console.log("ไม่มีข้อความให้พูด");
        return;
    }

    if (typeof responsiveVoice !== 'undefined') {
        responsiveVoice.speak(text, "Thai Female");
    } else {
        console.log("ไม่พบ ResponsiveVoice");
    }
}


 // เมื่อโหลดหน้าเว็บ ให้แสดงหน้าจอดำ 5 วินาทีแล้วค่อย ๆ จางออกใน 2 วินาที
 document.addEventListener("DOMContentLoaded", function () {
    // รายการสุภาษิต
    const quotes = [
        "เงินอยู่ใต้น้ำ คำอยู่ใต้ดิน",
        "เยียะหยังหื้อเยียะแต้ดีหลี จะได้เป็นเศรษฐีวันนึ่ง",
        "เจ๊าก็ว่ายังงาย ขวายก็ว่าแดดออก",
        "ควายบ่ตาย ไปฟั่งปาดจิ้น",
        "วัดบ่เข้า พระเจ้าบ่ไหว้ คือ คนหนา",
        "จะจูงก็ไปก่อน จะส่อนก็ตวยหลัง",
        "มีเงินว่าเป็นเจ้า มีข้าวว่าเป็นนาย",
        "จิกปิกไหนก็ป้อ จ้อหว้อไหนก็ขวัก",
        "กามตัณหาพาหื้อล่วงล้ำ บังเกิดไหม้สันดาน",
        "จะไปหล็วกก่อนหมอ จะไปซอก่อนปี่",
        "หนุ่มเอาเก๊า เถ้าเอาปล๋าย",
        "ควายบ่กินหญ้า จะไปก้มเขามันลง",
        "คนหล็วกว่าใกล้ คนใบ้ว่าไกล",
        "หลับเดิ้กลุกเจ๊า หนึ้งข้าวเป่าไฟ",
        "น้ำขุ่นไว้ใน น้ำใสแวดนอก",
        "ไฟในจะไปเอาออก ไฝนอกจะไปเข้า",
        "ตุ้มผ้าลายหมาจั่งเห่า ค้นคำเก่าจั่งผิดกัน",
        "จับใจหมี ปดีใจเผึ้ง จับใจมองเซิง บ่เพิ่งใจเงี้ยว",
        "นั่งหื้ออดูตี้ หนีหื้อดูกัน",
        "หัวใจคนใผหยั่งบ่ตึ้ก น้ำแม่สมุทรใหญ่กล้างพิลึก ยังหยั่งได้เถิงทราย",
        "ไม้โค่นค้างก็เพื่อคมเสียม ขุดเลาะเลียมเก๊างุนรากแก้ว",
        "ใคร่รู้หื้อถาม ใคร่งามหื้อแต้ม",
        "จะไปกินน้ำย้อยศอกคนอื่น",
        "หมาเห่า อย่าเห่าตวยหมา",
        "เปิ่นบ่ฮู้ผู้โทษมาถู กำคองูผู้พิษใส่ข้า",
        "ขดออกแพ้เจ้า ขดเข้าแพ้ของ",
        "ยามเมื่อฮัก น้ำผักว่าหวาน ยามเมื่อจัง น้ำตาลว่าส้ม",
        "พี่น้องผิ่ดกั่น เหมือนพร้าฟันน้ำ จะไปผูกมั้นกรรมเวร",
        "เมื่อทุกข์ก็ทาข์ เมื่อผ่านก็ผาน เมื่อสุขสำราญก็ไว้เป็นห้อง",
        "น้ำไหลตวยหนทาง ผีสางเพื่อคำปาก",
        "อดเผ็ดกินหวาน อดสานได้จ้า",
        "คนใบ้ใช้หลายเตื่อ",
        "ฮักจั้น ๆ มันจั่งพันเหย เมิน ๆ เคย มันจั่งคุ้มเถ้า",
        "จะไปเป็นคน ปากหวานกันส้ม"
    ];

    // เลือกสุภาษิตแบบสุ่ม
    const randomIndex = Math.floor(Math.random() * quotes.length);
    const randomQuote = quotes[randomIndex];
    const quoteText = document.getElementById("quoteText");

    // แสดงสุภาษิตหลังจาก 1 วิ และค่อย ๆ ปรากฏ
    setTimeout(() => {
        quoteText.textContent = randomQuote;
        quoteText.style.opacity = "1"; // ค่อย ๆ ปรากฏ
        setTimeout(() => {
            quoteText.style.opacity = "0"; // ค่อย ๆ หายไป
        }, 3000); // แสดง 3 วินาที
    }, 1000);

    // หน้าจอดำจางออกใน 2 วิ หลังจาก 5 วิ
    setTimeout(() => {
        document.getElementById("blackScreen").style.opacity = "0";
        setTimeout(() => {
            document.getElementById("blackScreen").style.display = "none";
        }, 2000);
    }, 5000);
});

 // รายการสุภาษิต
 const quotes = [
    "เงินอยู่ใต้น้ำ\nคำอยู่ใต้ดิน",
    "เยียะหยังหื้อเยียะแต้ดีหลี\nจะได้เป็นเศรษฐีวันนึ่ง",
    "เจ๊าก็ว่ายังงาย\nขวายก็ว่าแดดออก",
    "ควายบ่ตาย\nไปฟั่งปาดจิ้น",
    "วัดบ่เข้า\nพระเจ้าบ่ไหว้\nคือ คนหนา",
    "จะจูงก็ไปก่อน\nจะส่อนก็ตวยหลัง",
    "มีเงินว่าเป็นเจ้า\nมีข้าวว่าเป็นนาย",
    "จิกปิกไหนก็ป้อ\nจ้อหว้อไหนก็ขวัก",
    "กามตัณหาพาหื้อล่วงล้ำ\nบังเกิดไหม้สันดาน",
    "จะไปหล็วกก่อนหมอ\nจะไปซอก่อนปี่",
    "หนุ่มเอาเก๊า\nเถ้าเอาปล๋าย",
    "ควายบ่กินหญ้า\n จะไปก้มเขามันลง",
    "คนหล็วก ว่าใกล้ \nคนใบ้ว่าไกล",
    "หลับเดิ้กลุกเจ๊า \nหนึ้งข้าวเป่าไฟ",
    "น้ำขุ่นไว้ใน \nน้ำใสแวดนอก",
    "ไฟในจะไปเอาออก\n ไฝนอกจะไปเข้า",
    "ตุ้มผ้าลายหมาจั่งเห่า \nค้นคำเก่าจั่งผิดกัน",
    "จับใจหมี ปดีใจเผึ้ง \nจับใจมองเซิง บ่เพิ่งใจเงี้ยว",
    "นั่งหื้ออดูตี้ \nหนีหื้อดูกัน",
    "หัวใจคนใผหยั่งบ่ตึ้ก \nน้ำแม่สมุทรใหญ่กล้างพิลึก \nยังหยั่งได้เถิงทราย",
    "ไม้โค่นค้างก็เพื่อคมเสียม \nขุดเลาะเลียมเก๊างุนรากแก้ว",
    "ใคร่รู้หื้อถาม\n ใคร่งามหื้อแต้ม",
    "จะไปกินน้ำย้อยศอกคนอื่น",
    "หมาเห่า\n อย่าเห่าตวยหมา",
    "เปิ่นบ่ฮู้ผู้โทษมาถู \nกำคองูผู้พิษใส่ข้า",
    "ขดออกแพ้เจ้า \nขดเข้าแพ้ของ",
    "ยามเมื่อฮัก น้ำผักว่าหวาน \nยามเมื่อจัง น้ำตาลว่าส้ม",
    "พี่น้องผิ่ดกั่น\n เหมือนพร้าฟันน้ำ \nจะไปผูกมั้นกรรมเวร",
    "เมื่อทุกข์ก็ทาข์ \nเมื่อผ่านก็ผาน \nเมื่อสุขสำราญก็ไว้เป็นห้อง",
    "น้ำไหลตวยหนทาง \nผีสางเพื่อคำปาก",
    "อดเผ็ดกินหวาน \nอดสานได้จ้า",
    "คนใบ้ใช้หลายเตื่อ",
    "ฮักจั้นๆมันจั่งพันเหย\n เมินๆเคยมันจั่งคุ้มเถ้า",
    "จะไปเป็นคน\n ปากหวานกันส้ม"
];
quotes.forEach((quote, index) => {
    console.log(`Quote ${index + 1}:`);
    console.log(quote);
    console.log("------------");
});

// เลือกสุภาษิตแบบสุ่ม
const randomIndex = Math.floor(Math.random() * quotes.length);
const randomQuote = quotes[randomIndex];
const quoteText = document.getElementById("quoteText");

// แสดงสุภาษิตหลังจาก 1 วิ และค่อย ๆ ปรากฏ
setTimeout(function() {
    quoteText.textContent = randomQuote;
    quoteText.style.opacity = "1"; // ค่อย ๆ ปรากฏ
    setTimeout(function() {
        quoteText.style.opacity = "0"; // ค่อย ๆ หายไป
    }, 5000); // แสดง 3 วินาที
}, 1000);

// หน้าจอดำจางออกใน 2 วิ หลังจาก 5 วิ
setTimeout(function() {
    document.getElementById("blackScreen").style.opacity = "0";
    setTimeout(function() {
        document.getElementById("blackScreen").style.display = "none";
    }, 2000);
}, 8000);

setTimeout(function() {
    quoteText.classList.add("show");
}, 1000); // ปรากฏหลังจาก 1 วินาที

function addEffects(image) {
    image.classList.add('rainbow-border');

    for (let i = 0; i < 4; i++) {
        const circle = document.createElement('div');
        circle.classList.add('circle');

        const size = Math.random() * 50;
        const x = Math.random() * (image.width - size);
        const y = Math.random() * (image.height - size);

        circle.style.width = size + 'px';
        circle.style.height = size + 'px';
        circle.style.left = x + 'px';
        circle.style.top = y + 'px';

        image.appendChild(circle);
    }

    setTimeout(() => {
        const circles = image.querySelectorAll('.circle');
        circles.forEach(circle => circle.remove());

        image.classList.remove('rainbow-border');
    }, 4000);
}

function SS(event) {
    const x = event.clientX;
    const y = event.clientY;

    const blurLight = document.createElement('div');
    blurLight.classList.add('blur-light');
    blurLight.style.left = (x - 75) + 'px'; // -75 เพื่อให้อยู่ตรงกลางเมาส์
    blurLight.style.top = (y - 75) + 'px'; // -75 เพื่อให้อยู่ตรงกลางเมาส์
    document.body.appendChild(blurLight);

    setTimeout(() => {
        blurLight.remove();
    }, 1000);
}



let rotation = 0;

function toggleMenu() {
  const menuButton = document.getElementById("menuButton");
  const sidebar = document.getElementById("sidebar");

  rotation += 360;
  menuButton.style.transform = `rotate(${rotation}deg)`; // ✅ แก้แล้ว
  menuButton.style.transition = 'transform 0.6s ease';
  sidebar.classList.toggle("active");
}





function toggleSubmenu0() {
    const submenu = document.getElementById("vocabSubmenu0");
    submenu.style.display = submenu.style.display === "none" ? "block" : "none";
  }

function toggleSubmenu1() {
    const submenu = document.getElementById("vocabSubmenu1");
    submenu.style.display = submenu.style.display === "none" ? "block" : "none";
  }
  function toggleSubmenu2() {
    const submenu = document.getElementById("vocabSubmenu2");
    submenu.style.display = submenu.style.display === "none" ? "block" : "none";
  }

    function toggleSubmenu3() {
    const submenu = document.getElementById("vocabSubmenu3");
    submenu.style.display = submenu.style.display === "none" ? "block" : "none";
  }

  function toggleSubmenu4() {
    const submenu = document.getElementById("vocabSubmenu4");
    submenu.style.display = submenu.style.display === "none" ? "block" : "none";
  }


   const bodyList = {
 "กระดอง" : "ดอง",  "กระดูกเชิงกราน" : "ดูกดะด้าม", "กระดูกซี่โครง" : "กระดูกขี้ข้าง",
"กระดูกสันหลัง" : "กระดูกหลัง", "กระดูกไหปลาร้า" : "กระดูกห้า", "กระเพาะ" : "กะเพ่าะ", "กระหม่อม" : "ขม่อม", "กราม" : "กาง",
"กล้าม" : "ก้าม", "กะโหลกศีรษะ" : "กะโหล้งหัว",
 "เกล็ด" : "เก๋ด",  "แก้วหู" : "แก้วหู",
"ขนคิ้ว" : "ขนกิ๊ว", "ขนจมูก" : "ขนฮูดัง", "ขนตา" : "ขนต๋า", "ขมับ" : "หงีบ", "ข้อเท้า" : "ข้อตี๋น",
 "ข้อพับ" : "ข้อพั่บ", "ข้อพับที่น่อง" : "กะหล็อกน่อง",  "ข้อศอก" : "ต๋าศอก",
 "ขากรรไกร" : "ต๋งกาง",  "รักแร้" : "ขี้แฮ้",
 "คราบ" : "คาบ", "ครีบ" : "คีบ", 
"คาง" : "กาง", "คิ้ว" : "กิ้ว", "เครา" : "หนวด", "เครื่องใน" : "คัวใน",
  "จมูก" : "ฮูดัง", "จะงอยก้น" : "ก้นจุ้น", "ซอกขาพับ" : "กะล๋อกน่อง",
 "ต้นขา" : "เก๊าขา", "ต้นแขน" : "เก๊าแขน",  "โหนก" : "ตะพอง",
"ตับ" : "ดั๋บ", "ตา" : "ต๋า", "ตาขาว" : "ต๋าขาว", "ตาดำ" : "ต๋าดำ", "ตาตุ่ม" : "ต๋าตีน",
 "ตูด" : "ฮูขี้",  "ถุงน้ำดี" : "ดี", "ท้อง" : "ต๊อง",
"ท้องขา" : "ต๊องขา", "ท้องแขน" : "ต๊องแขน", "ท้องน้อย" : "ต๊องน้อย", "ท้ายทอย" : "ง่อน", "เท้า" : "ตี๋น",
 "นิ้วกลาง" : "นิ้วก๋าง", "นิ้วก้อย" : "นิ้วก้อย",
"นิ้วชี้" : "นิ้วจี้", "นิ้วเท้า" : "นิ้วตี๋น",  "นิ้วโป้ง" : "นิ้วโป้,นิ้วโข้", 
"นิ้วหัวแม่มือ" : "นื้วโข้", "เบ้าตา" : "เบ้าต๋า", 
 "ผ้าขี้ริ้ว" : "ญ่อ", "ฝ่าเท้า" : "ฝ่าตี๋น",
"ฝ่ามือ" : "อ้งมือ", "พุง" : "ขี้ปุ๋ม", "พุงปลา" : "ปื๊นต๊อง", "ฟัน" : "เขี้ยว",
"ฟันกราม" : "เขี้ยวเก๋า", "ฟันน้ำนม" : "เขี้ยวน้ำนม", "มดลูก" : "ม่ดลูก", "มันสมอง" : "อ่องออ", 
 "ริมฝีปาก" : "ฮิมปาก", "ลำไส้" : "ไส้",
 "ลูกกระเดือก" : "แก๋นคอ", "ลูกตา" : "แก่นต๋า", "ลูกนัยน์ตา" : "แก่นต๋า",
"ลูกอัณฑะ" : "ขะหล๋ำ", "เล็บเท้า" : "เล่บตี๋น", "เล็บมือ" : "เล่บมือ","สะโพก" : "ตะก้าม",
"สีข้าง" : "ขี้ข้าง", "ไส้ตัน" : "ไส้ตั๋น", "ไส้อ่อน" : "ไส้หวาน",
 "หน้าท้อง" : "หน้าต๊อง",  "หน้าอก" : "หน้าอ๋ก", 
"หลังเท้า" : "หลังตี๋น", "หัวใจ" : "หัวใจ๋",

 "เหล็กใน" : "เหล๋กใน", "โหนก" : "หนอก", "ไหล่" : "บ่า",
"องคชาติ" : "ไอ่จ้วย", "อวัยวะเพศหญิง" : "จิ๋ม", "อัณฑะ" : "ขะหลำ",  "เอว" : "แอว",

   }

   const familyList = {
"เด็กทารก" : "น้องแอ", "ตา" : "ป้ออุ๊ย", "ทวด" : "หม่อน", "น้องเขย" : "น้องจาย", "น้องชาย" : "น้องบ่าว",
 "น้องสะใภ้" : "น้องไป๊", 
"น้าเขย" : "น้าจาย", "น้าสะใภ้" : "น้าไป๊",  "ป้าสะใภ้" : "ป้าไป๊", "ปู่" : "ป้ออุ๊ย",
"พ่อ" : "ป้อ", "พ่อตา" : "ป้อเมีย", "พ่อผัว" : "ป้อผัว", "พ่อเลี้ยง" : "ป้อน้า", "พี่เขย" : "อ้ายเขย",
"พี่ชาย" : "อ้าย", "พี่เมีย" : "ปี้เมีย", "พี่สะใภ้" : "ปี้ไป๊", "พี่สามี" : "ปี้ผัว", "พี่สาว" : "ปี้",
"เพื่อน" : "เปื่อน", "ภรรยา" : "เมีย", "แม่" : "อิแม่",  "แม่ยาย" : "แม่เมีย",
"แม่เลี้ยง" : "แม่น้า", "ย่า" : "แม่อุ๊ย", "ยาย" : "แม่อุ๊ย", "เด็ก" : "ละอ่อน", 
 "ลูกเขย" : "ลูกจาย", "ลูกคนกลาง" : "ลูกคนก๋าง", "ลูกคนเดียว" : "ลูกโตน, ลูกคนเดียว", "ลูกคนโต" : "ลูกคนเก๊า",
"ลูกคนสุดท้อง" : "ลูกหล้า", "ลูกชาย" : "ลูกบ่าว", "ลูกบุญธรรม" : "ลูกเก๋บ",
"สามี" : "ผัว", "หลานสะใภ้" : "หลานไป๊", 
   }

   const plantsList = {
    "กะลา" : "กะโหล้ง", "เกสร" : "เก๋สร",  
 "ขั้ว" : "ขวั้น", "ค่าคบ" : "ง่าไม้", "เครือ" : "เคือ",  
"โคนต้น" : "ตางเก๊า", "จาว" : "จ๋าว", "ซังข้าวโพด" : "แก๋นใน",  
"ต้น" : "เก๊า", "ตอ" : "ต๋อ", "ตาไม้" : "ต๋าไม้", "ทางมะพร้าว" : "ก้านบ่ะป๊าว",   
"ปล้อง" : "ป้อง", "ปลี" : "ปี๋", "เปลือก" : "เปือก", "ฝัก" : "ฟั๋ก", "เมล็ด" : "แก่น",  
"ยวง" : "ญวง", "ยอด" : "ญอด", "ราก" : "ฮาก", "ผล" : "หน่วย",   

   }

   const objectsList = {
    "กรรไกร": "มีดยับ", "ช้อน": "จ้อน", "ทัพพี": "ป้าก", "ไม้จิ้มฟัน": "ไม้จิ้มเขี้ยว", "ถังน้ำ": "น้ำคุ",
"จอบ": "ขอบก", "เก้าอี้ตัวเล็ก": "ก้อม",  "ไฟแช๊ค": "ก้ับไฟ", "ร่ม": "จ้อง",
"ขันน้ำ": "ก๋อก", "ขันเงิน": "สลุ๋ง", "กุญแจ": "ขะแจ๋", "ตระกร้า": "ซ้า", "ที่นอน": "สลี",
"เสื่อ": "สาด", "กงดีดฝ้าย": "ก๋งดีดฝ้าย", "กรวยดอกไม้": "สวยดอกไม้", "กระจกส่องหน้า": "แว่น", "กระด้ง": "ด้ง",
"กระต่ายขูดมะพร้าว": "แมวขูดบะพร้าว", "กระทะ": "หม้อขาง", "กระบวย": "น้ำบวย", "กระบุง": "ซ้า", "กระป๋องน้ำ": "น้ำคุ่",
"กระโถน": "กะโถน", "กระสอบ": "กะสอบ", "กล่อง": "ก่อง", "กล่องข้าว": "ก่องเข้า", "กับดักสัตว์": "แคบ",
"กา": "ก๋า", "ตาชั่ง": "ต๋าจั้ง", "แก้วน้ำ":"ก๋อก",
"ขวาน": "มุย",  
"เข็มซ่อนปลาย": "เข็มกะลั๋ด",  "คนโท": "น้ำต้น", "ครก": "ค่ก", "ครกกระเตื่อง": "ค่กมอง",
"คราดไม้": "ไม้ตาบตา", "คีม": "กีม", "คีมปากนกแก้ว": "กีมน่กเก๊า", "เคียว": "เกียว", "จวัก": "ป้าก",
"จอก": "ก๋อก", "จอบ": "ขอบ๋ก", "จั่นดักปลา": "กะต้ำ",
"จุก": "จุ๋ก",  "เชี่ยนหมาก": "แอ๋บมาก", "เชือก": "เจื๊อก", "ส้อม": "ซ่อม",
 "โซ่": "โส้", "ด้าย": "ฝ้าย", "ตลับ": "แอ๋บ",
 "ตะกร้า": "ซ้า", "ตะแกรง": "เหิง", "ตะเกียง": "โกม", 
"โต๊ะ": "ตั่ง",  
"เตาไฟ": "เต๋าอังโล่",  
 "ถุง": "ถง", "ถุงย่าม": "ถงญ่าม",  "ทัพพี": "ป้าก",
"ที่นอน": "สะลี", "เบ็ด": "เบ๋ด", "เบาะรองนั่ง": "ผ้าก้อบ", "ปลอกหมอน": "เสื้อหมอน", "ปากกา": "ปากก๋า",
"แปรงสีฟัน": "แปงสีเขี้ยว", "ผ้าเช็ดตัว": "ผ้าตุ๋ม", "ผ้าเช็ดหน้า": "ผ้าเจ้ดหน้า", "ผ้าแพร": "ผ้าแพร", "ผ้านวม": "ผ้าด้วบ",
"ผ้าปูโต๊ะ": "ผ้าปู๋โต๊ะ", "ผ้าปูที่นอน": "ผ้าหล๋บ", "ผ้าม่าน": "ผ้าหม้าน", "ผ้าอ้อม": "ผ้าอ้อม", "ฝาชี": "ฝาจี",
 "พร้า": "มีดโต้", "พัด": "วี", "พานดอกไม้": "ขันดอก",
"โพง": "น้ำถ้ง", "มีดพก": "มีดซุย", 
 "มุ้ง": "สุ๋ด", "ไม้กลัด": "ไม้กะลั๋ด", "ไม้กระบอง": "ไม้ค้อน", "ไม้กวาด": "ไม้ยู",
"ไม้ขีดไฟ": "กั๋บไฟ",  "ไม้เท้า": "ไม้เต๊า",  "ไม้พาย": "ไม้ฟาย",
 "ไม้เสียบพริก": "ไม้เสียบพิ่ก", "ไม้เรียว": "ไม้แส้", "ยอ": "จ๋ำ", "ยางลบ": "ยางล่บ",
"ราง": "ฮาง", "แร้ว": "แฮ้ว", "ลังถึง": "ซึ้ง", "แว่นตา": "แว่นต๋า",
"สมุด": "สมุ๋ด", "สว่าน": "เหล๋กจี", "สวิง": "หิง", "สาก": "แก๋นค่ก", "สายตะพาย": "สายดัง",
 "หนังสติ๊ก": "ก๋ง", "หม้อแกง": "หม้อแก๋ง",
"หม้อน้ำ": "น้ำหม้อ", "หิ้งพระ": "หิ้งพ่ะเจ้า", "หิ้ง": "ข่า",
"หีบ": "หีด", "ไหสำหรับนึ่งข้าว": "ไหข้าว",
};

const clothingList = 
{
 "แว่นตา":"แว่นต๋า", "กำไล":"ว้องแขน", "ยกทรง":"เสื้อใน", "กางเกง":"เต่ว", "กางเกงใน":"เต่วใน", 
"ผ้าถุง":"ซิ่น", "ถุงเท้า":"ถุงตี๋น", "เข็มขัด":"สายฮ้าง", "รองเท้า":"เกิบ", "รองเท้าบูท":"เกือกอ๊ก", 
"กระดุมบีบ":"มะต่อมแต๋บ", "กระดุม":"บะต่อม",  "กระเป๋าถือ":"กะเลิ้บ", "กระเป๋า":"กะเป๋า", 
"กางเกงชั้นใน":"เตี่ยวใน", "กางเกงขาสั้น":"เตี่ยวก้อม", "กางเกงขายาว":"เตี่ยวหลั่ง", "กางเกงขาก๊วย":"เตี่ยวสะดอ", "กางเกง":"เตี่ยว", 
"กำไล":"ก๋ำไล", "เครื่องนุ่งห่ม":"เคื่องนุ่งคัวใบ", "ตุ้มหู":"จี้หู", 
"ผ้าข้าวม้า":"ผ้าต่อง", "ผ้าคลุม":"ผ้าตุ๊ม", "ผ้าถุง":"ผ้าสิ้น", "ผ้านุ่ง":"ผ้าต้อย", "ผ้าโจงกระเบน":"ผ้าต้อย", 
"ผ้าพันคอ":"ผ้าปันคอ", "ผ้าโพกหัว":"ผ้าเคียนหัว", "ผ้าห่มเฉียงบ่า":"ผ้าสะหว้ายแหล้ง",  "พวงดอกไม้":"ดอกไม้ไหว", 
"รองเท้าแตะ":"เกือกแต๋ะ", "รองเท้า":"เกิบ", "สร้อยข้อมือ":"สายแขน", "สร้อยคอ":"ส้อย", "เสื้อชั้นใน":"เสื้อก้อม", 
"เสื้อผ้า":"คัวนุ่ง",  "เสื้อเเขนยาว":"เสื้อเเขนญาว", "เสื้อคอกระเช้า":"เสื้อบ่าห้อย", "เสื้อกันหนาว":"เสื้อหนาว", 
"เสื้อกล้าม":"เสื้อก้อม", "โสร่ง":"โสล่ง",    
};

const monkItemsList = 
{
    "กลด": "ก๋ด",  "จีวร": "ผ้าลังก๋า",  "ตาลปัตร": "ต๋าละปั๋ด",  
 "ผ้ารัดประคด": "ผ้ามั่ดอ๋ก", "ผ้าสังฆาฏิ": "ผ้าป้าด", "ผ้าอังสะ": "ผ้าอังส๋ะ", "ผ้าอาบน้ำ": "ผ้าอาบ",  
"พัดยศ": "พั่ดญ่ด",  "หีบใส่คัมภีร์": "หีดธรรม", "อาสนะ": "อาสน่ะ",
};
const natureList = {"กรวด":"มะแฮ่",
  "แก่ง":"แก่ง",
  "เกาะ":"เก๋าะ",
  "ข้างขึ้น":"เดือนออก",
  "ข้างแรม":"เดือนแฮม",
  "คุ้งน้ำ":"น้ำโก๊ง",
  "ขี้เถ้า":"ขี้เต้า",
  "จันทรคราส":"ก๋บกิ๋นเดือน",
  "ชะง่อนผา":"ผาเงิบ",
  "เชิงเขา":"ตี๋ยดอย",
  "ดวงจันทร์":"เดือน",
  "ดวงอาทิตย์":"ต๋าวัน",
  "ดาวลูกไก่":"ดาววี",
  "ดาวประจำเมือง":"ดาวหมูกอง",
  "ดาวประกายพฤกษ์":"ดาวผะก๋าย",
  "ดาวไถ":"ดาวง้อนไถ",
  "ดินดาน":"ดินดาก",
  "ดินเหนียว":"ดินเหนียว",
  "เดือนเพ็ญ":"เดือนเป็ง",
  "เดือนหงาย":"เดือนเเจ้ง",
  "ตลิ่ง":"ต๋าฝั่ง",
  "ตาน้ำ":"ต๋าน้ำ",
  "ทราย":"ซาย",
  "ท่าน้ำ":"น้ำต้า",
  "น้ำค้าง":"เหมย",
  "น้ำค้างแข็ง":"เหมยขาบ",
  "น้ำเชี่ยว":"น้ำเจี้ยว",
  "น้ำซับ":"น้ำจำ",
  "น้ำดื่ม":"น้ำกิ๋น",
  "น้ำตก":"น้ำต๋ก",
  "น้ำท่วม":"น้ำนอง",
  "น้ำนิ่ง":"น้ำตุ้น",
  "น้ำวน":"น้ำพั่ดต๋าไก่",
  "น้ำพุร้อน":"โป่งน้ำฮ้อน",
  "ปลัก":"บวก",
  "ป่าละเมาะ":"แพ่ะ",
  "โป่ง":"ป่ง",
  "ผง":"ผง",
  "ผีพุ่งใต้":"ผีปุ้งส้าว",
  "พยับแดด":"แดดบ๋ด",
  "พายุ":"ลมหลวง",
  "โพรงใต้ต้นไม้":"ก๋วง",
  "ภูเขาเตี้ยๆ":"ม่อน",
  "ภูเขา":"ดอย",
  "แม่น้ำ":"น้ำแม่",
  "รุ้งกินน้ำ":"ฮุ้งกิ๋นน้ำ",
  "ฤดู":"หน้า",
  "ลมที่พัดเป็นวงขึ้นไป":"ลมกิ๋ดกิ๋ว",
  "ลำคลอง":"ลำเหมือง",
  "ลำธาร":"ลำห้วย",
  "ลูกเห็บ":"บ่าเห๋บ",
  "สันเขา":"แป๋ดอย",
  "หนองน้ำ":"น้ำเหมือง",
  "ห้วงน้ำ":"วังน้ำ"};
const buildingsList = {
  "กระเบื้องไม้มุงหลังคา":"แป้นเก๋ด",
  "กระเบื้องดินเผามุงหลังคา":"แป้นดินขอ",
  "กระเบื้อง":"กะเบื้อง",
  "กระท่อม":"ตูบ",
  "กลอน":"ก๋อน",
  "กบไสไม้":"เต่า",
  "กุฎิ":"กุฏิ๋",
  "กุญแจ":"ขะแจ๋",
  "ขวาน":"มุย",
  "ขั้นบันได":"ตี๋นคันได",
  "โครงบันได":"แม่คันได",
  "เจดีย์":"ธาตุ",
  "เจดีย์บรรจุกระดูก":"กู่",
  "ชาน":"จาน",
  "ชายคา":"จายคา",
  "ด้านหลังของบ้าน":"ก้นตู",
  "ตะปู":"เหล๋กกน",
  "โถงหน้าห้องนอน":"เติ๋น",
  "ธรณีประตู":"แม่ปะตู๋",
  "บันได":"คันได",
  "ปะรำ":"ผาม",
  "ปั้นลม":"ป้านลม",
  "ประตู":"ปะตู๋",
  "ปูนขาว":"ปู๋นขาว",
  "แป":"แป๋",
  "ฝาไม้กระดาน":"ฝาแป้น",
  "ฝาไม้ไฝ่สาน":"ฝาถึม",
  "พร้า":"พ้า",
  "เพดาน":"ค่วน",
  "ไม้กระดาน":"ไม้แป้น",
  "ไม้ระแนง":"ไม้ก้านฝ้า",
  "ยุ้งข้าว":"หลองเข้า",
  "รอด":"แวง",
  "รั้ว":"ฮั้ว",
  "ราว":"ฮาว",
  "ร้าน":"ฮ้าน",
  "เรือน":"เฮือน",
  "โรงเรียน":"โฮงเฮียน",
  "โรงพัก":"โฮงพั่ก",
  "โรงพยาบาล":"โฮงยา",
  "โรงนา":"เถียงนา",
  "โรงครัว":"โฮงคัว",
  "โรง":"โฮง",
  "โลงศพ":"หล้อง",
  "วัด":"วั่ด",
  "สลัก":"แซ่ว",
  "สะพาน":"ขัว",
  "สว่าน":"เหล๋กจี",
  "เสาเอก":"เสามงกน",
  "เสาตอท่อ":"เสาป๋อก",
  "ส้วมพระ":"ฐาน",
  "ห้องครัว":"คัวไฟ",
  "ห้องส้วม":"ส้วม",
  "ห้องอาบน้ำ":"ต๊อมน้ำ",
  "อิฐ":"ดินกี่"};
const fruitsList = {"กล้วยไข่":"ก้วยไข่",
"กล้วยน้ำว้า":"ก้วยใต้",
"กล้วยหอม":"ก้วยค้าว",
"กล้วยหักมุก":"ก้วยส้ม",
"กะท้อน":"บ่ะตื๋น",
"ขนุน":"บ่ะหนุน",
"เงาะ":"เง่าะ",
"ชมพู่":"บ่ะซมปู",
"ตะขบ":"บ่ะเกว๋น",
"แตงโม":"บ่ะเต้า",
"แตงไทย":"บ่ะแต๋งลาย",
"ทับทิม":"บ่ะก๊อ",
"ทุเรียน":"ทุ่เลียน",
"น้อยหน่า":"บ่ะหน้อเเหน้",
"ฝรั่ง":"บ่ะก้วย",
"พุทรา":"บ่ะตัน",
"มะกอก":"บ่ะกอก",
"มะขามป้อม":"บ่ะขามป้อม",
"มะขามเทศ":"บ่ะขามข้อง",
"มะขาม":"บ่ะขาม",
"มะดัน":"บ่ะดัน",
"มะเดื่อ":"บ่ะเดื่อ",
"มะตูม":"บ่ะปิน",
"มะปราง":"บ่ะผ่าง",
"มะพร้าวอ่อน":"บ่ะป๊าวหนุ่ม",
"มะพร้าว":"บ่ะป๊าว",
"มะไฟ":"บ่ะไฟ",
"มะม่วง":"บ่ะม่วง",
"มะยม":"บ่ะญม",
"มะละกอ":"บ่ะก้วยเต้ด",
"มังคุด":"มังคุ่ด",
"ลองกอง":"ลองกอง",
"ละมุด":"บ่ะมุ่ด",
"ลางสาด":"ลางสาด",
"ลำไย":"ลำไญ",
"ลิ้นจี่ป่า":"บ่ะคอแลน",
"ลิ้นจี่":"ลั้นจี่",
"ลูกพลับ":"บ่ะกั๋บตอง",
"สมอ":"บ่ะน่ะ",
"ส้มเกลี้ยง":"ส้มเกี้ยง",
"ส้มเขียวหวาน":"ส้มเขียวหวาน",
"ส้มโอ":"บ่ะโอ",
"สับปะรด":"บ่ะขะหนั๋ด"

};
const foodList = {
  "กระชาย":"ละแอน",
  "กระเทียม":"หอมเตียม",
  "กะปิ":"กะปิ๋",
  "กับข้าวสำเร็จรูป":"ของกิ๋นสุ๋ก",
  "กับข้าว":"กั๋บเข้า",
  "กานพลู":"ดอกจั๋น",
  "กำจัด":"มะแขว่น",
  "เกลือ":"เกื๋อ",
  "แกงจืด":"ต้มจืด",
  "แกง":"แก๋ง",
  "ขนมจีน":"ขนมหนมเส้น",
  "ขนมเทียน":"เข้าหนมจ๋อก",
  "ขนมนางเล็ด":"เข้าแต๋น",
  "ขมิ้น":"เข้าหมิ้น",
  "ข้าวเหนียวดำ":"เข้าก่ำ",
  "ข้าวเหนียวสังขยา":"เข้ามัน",
  "ข้าวเหนียว":"เข้าหนึ้ง",
  "ข้าวหลาม":"เข้าหลาม",
  "ข้าวสาร":"เข้าสาร",
  "ข้าวสวย":"เข้าจ้าว",
  "ข้าวเม่า":"เข้าเหม้า",
  "ข้าวหมาก":"เข้าหมาก",
  "ข้าวมื้อเย็น":"เข้าแลง",
  "ข้าวมื้อเที่ยง":"เข้าตอน",
  "ข้าวมื้อเช้า":"เข้าเจ๊า",
  "ข้าวเปลือก":"เข้าเปลือก",
  "ข้าวมัน":"เข้ามัน",
  "ข้าวต้มมัด":"เข้าต้มกะทิ่",
  "ข้าวต้ม":"เข้าต้ม",
  "ข้าวเจ้า":"เข้าจ้าว",
  "ข้าวเกรียบว่าว":"เข้าควบ",
  "งบ":"ห่อแอ๋บ",
  "ตะไคร้":"จั๋กไค",
  "น้ำตาล":"น้ำต๋าน",
  "น้ำปลา":"น้ำป๋า",
  "น้ำพริก":"น้ำพิ่ก",
  "เนื้อเค็ม":"จิ๊นเกื๋อ",
  "เนื้อ":"จิ๊น",
  "บุหรี่":"บุลี",
  "ปลากรอบ":"ป๋าแห้ง",
  "ปลากระป๋อง":"ป๋ากั๋บ",
  "ปลาเค็ม":"ป๋าบ๋วง",
  "ปลาร้า":"ป๋าฮ้า",
  "ปลาแห้ง":"ป๋าบ้วง",
  "พริกขี้หนู":"พิ่กแต้",
  "พริกสด":"พิ่กหนุ่ม",
  "พริกแห้ง":"พิ่กแห้ง",
  "มะกรูด":"บ่ะขูด",
  "มะนาว":"บ่ะนาว",
  "ยี่หร่า":"เตียนแถบ",
  "ลูกชิด":"มะต๋าว",
  "วุ้นเส้น":"งุ้นเส้น",
  "วุ้น":"งุ้น",
  "ส้มฟัก":"ป๋าส้ม",
  "หมูทอด":"จิ๊นทอด",
  "ห่อหมก":"ห่อหนึ้ง",
  "หัวหอม":"หอมบั่ว",
  "เหมี้ยง":"เหมี้ยง",
  "แหนม":"จี๊นส้ม"

};
const vegetablesList = {"ผักตำลึง":"ผักแคบ",
"ชะพลู":"ผักแค",
"คื่นช่าย":"ผักกะพืน/กำปึน",
"พริกขี้หนู":"พริกแด้",
"กระเทียม":"หอมเทียม",
"มะรุม":"บะค้อนก้อม",
"กระเจี๊ยบเขียว":"บะเขือมั่น",
"ใบบัวบก":"ผักหนอก",
"ผักชี":"ผักป้อม",
"ผักชีฝรั่ง":"ผักป้อมเป้อ",
"มะเขือขื่น":"บะเขือฮึน",
"ใบแมงลัก":"ก๊อมก่อขาว",
"ถั่วแปป":"บะแปป",
"ผักกะเฉด":"ผักหนองน้้ำ",
"เพกะ":"บะลิ้นไม้",
"ผักแพว":"ผักไผ่",
"สะระแหน่":"ผักด่วน",
"หัวหอม":"หอมแดง",
"ชะอม":"ผักหละ",
"กระเจี๊ยบแดง":"ส้มปู๋",
"กะหล่ำปลี":"ผักกะหล่ำ",
"ถั่วลันเตา":"ถั่วหน้อย",
"ผักโขม":"ผักหม",
"กระชาย":"หัวระแอน",
"กุยช่าย":"ผักแป้น",
"ไมยราบ":"หญ้าจิ๊หย่อบ",
"กะเพรา":"กะเพรา",
"โหระพา":"ผักก๊อมก้อ",
"พริกสด":"พริกหนุ่ม",
"กระบก":"บ่ะมื่น",
"กระถิน":"กะถิน",
"กลอย":"ก๋อย",
"กะทกรก":"ผั่กแคบฝลั่ง",
"ไข่น้ำ":"ผำ",
"ขึ้นฉ่าย":"ผั่กก๋ำปืน",
"ดอกแค":"ดอกแก",
"ดอกขจร":"ดอกสลิ๋ด",
"ต้นหอม":"ผั่กหอม",
"แตงกวา":"บ่ะแต๋ง",
"แตงไทย":"บ่ะแต๋งลาย",
"แตงโม":"บ่ะเต้า",
"ถั่วฝักยาว":"บ่ะถั่ว",
"ถั่วพู":"ถั่วปู",
"ถั่วลิสง":"ถั่วดิน",
"น้ำเต้า":"บ่ะน้ำ",
"บวบ":"บ่ะนอย",
"บุก":"บุ๋ก",
"ใบกาหลง":"ผั่กเสี้ยว",
"ผักกะเสิม":"ผั่กไผ่",
"ผักกาดหอม":"ผั่กกาดญี",
"ผักกาดเขียว":"ผั่กกาดจ้อน",
"ผักกาด":"ผั่กกาด",
"ผักกูด":"ผั่กกูด",
"ผักขวง":"ผั่กขี้ขวง",
"ผักคราด":"ผั่กเผ๋ด",
"ผักคะน้า":"ผั่กคะน้า",
"ผักชะเลือด":"ผั่กปู่ญ่า",
"ผักชีล้อม":"ผั่กจี",
"ผักบุ้ง":"ผั่กบุ้ง",
"ผักปอด":"ผั่กกุ่มป่า",
"ผักปลัง":"ผักปั๋ง",
"ผักแว่น":"ผั่กแว่น",
"ผักเสี้ยน":"ผั่กส้มเสี้ยน",
"ผักหวาน":"ผั่กหวาน",
"พลู":"ปู",
"เพกา":"มะลิ่ดไม้",
"ไพล":"ปูเลย",
"ฟักเขียว":"บ่ะฟั่กหม่น",
"ฟักทอง":"ฟั่กแก้ว",
"มะเขือเทศ":"บ่ะเขือส้ม",
"มะเขือเปราะ":"บ่ะเขือผ่อย",
"มะเขือพวง":"บ่ะแคว้ง",
"มะเขือยาว":"บ่ะเขือญาว",
"มะระขี้นก":"บ่ะไห่",
"มะระ":"บ่ะล่ะ",
"มะแว้ง":"บ่ะแคว้งขม",
"มะอึก":"บ่ะเขือปู่",
"มันแกว":"มันแก๋วลาว",
"มันเทศ":"มันแก๋ว",
"มันสำปะหลัง":"มันต้าง",
"มันฝรั่ง":"มันอะลู",
"แมงลัก":"ก้อมก้อ",
"ลำโพง":"บ่ะเขือบ้า",
"สะเดา":"สะเลียม",
"หอมแป้น":"ผั่กแป้น",
"เห็ดฟาง":"เห๋ดเฟือง",
"เห็ดหูหนู":"เห๋ดหูแมว",
"หัวไชเท้า":"หัวผั่กกาด"};

const flowersList = {"กล้วยไม้":"ดอกเอื้อง",
"ดอกกระเจียว":"ดอกอาว",
"ดอกกระดัง":"ดอกสะบันงา",
"ดอกกระถินเทศ":"ดอกคำใต้",
"ดอกกุหลาบ":"ดอกกุหลาบ",
"ดอกแก้ว":"ดอกแก้ว",
"ดอกขจร":"ดอกสลิ๋ด",
"ดอกเข็ม":"ดอกเข็ม",
"ดอกคัดเค้า":"ดอกเก๋ดเก๊า",
"ดอกคูน":"ดอกลมแล้ง",
"ดอกจำปา":"ดอกจ๋ำป๋า",
"ดอกจำปี":"ดอกจำปี๋",
"ดอกชบา":"ดอกใหม่",
"ดอกซ่อนกลิ่น":"ดอกหอมไก๋",
"ดอกดาวเรือง":"ดอกคำปู้จู้",
"ดอกทองกวาว":"ดอกกว๋าว",
"ดอกทานตะวันป่า":"ดอกบัวตอง",
"ดอกทานตะวัน":"ดอกบัวผั่ด",
"ดอกเทียน":"ดอกเตียน",
"ดอกบัวเผื่อน":"ดอกป๊าน",
"ดอกบัว":"ดอกบัว",
"ดอกบานชื่น":"ดอกบานจื้น",
"ดอกบานไม่รู้โรย":"ดอกตะหล้อม",
"ดอกบานเย็น":"ดอกจ๋ำญาม",
"ดอกบุนนาค":"ดอกกำก่อ",
"ดอกปีบ":"ดอกก๋าสะลอง",
"ดอกพวงประดิษฐ์":"ดอกเคือออน",
"ดอกพิกุล":"ดอกแก้ว",
"ดอกพุดตาล":"ดอกสามสี",
"ดอกพุดช้อน":"ดอกเก๋ดถะหวา",
"ดอกพุด":"ดอกปุด",
"ดอกพุทธรักษา":"ดอกบัวละวง",
"ดอกพู่ระหง":"ดอกใหม่ส้อย",
"ดอกเฟื่องฟ้า":"ดอกเฟื่องฟ้า",
"ดอกมหาหงส์":"ดอกต๋าเหิน",
"ดอกมะลิวัลล์":"ดอกแซ่ว",
"ดอกมะลิ":"ดอกมะลิ่",
"ดอกยี่หุบ":"ดอกจี๋หุ๋บ",
"ดอกรัก":"ดอกป๋านเถื่อน",
"ดอกลั่มทม":"ดอกจ๋ำป๋าลาว",
"ดอกลำเจียก":"ดอกเกี๋ยง",
"ดอกลำดวน":"ดอกหอมวน",
"ดอกโศก":"ดอกส้มสุ๋ก",
"ดอกสารภี":"ดอกสาละปี",
"ดอกหงอนไก่":"ดอกด้าย"

};
const treesList = {"กระสัง":"ฮากล้วย",
"ก้ามปู":"สำสา",
"ข่อย":"ข่อย",
"ขี้เหล็ก":"ขี้เหล๋ก",
"คราม":"ห้อม",
"งิ้ว":"งิ้ว",
"ชงโค":"เสี้ยว",
"ดอกดิน":"หญ้าเข้าก่ำ",
"เดือย":"เดือย",
"ต้อยติ่ง":"ผั่กดีด",
"ต้นโพธิ์":"เก๊าสะหลี",
"ต้นข้าว":"ต้นเข้า",
"ตาล":"ต๋าน",
"เตย":"เตย",
"ตำแย":"หานไก่",
"เต็ง":"ไม้แง่ะ",
"ไทร":"ไฮ",
"นุ่น":"งิ้ว",
"พลวง":"ไม้ตึง",
"พลับพลึง":"ลีลัว",
"พะยอม":"ขะญอม",
"ไพล":"ปูเลย",
"ฝอยทอง":"เคือเขาคำ",
"ฟาง":"เฟือง",
"บอระเพ็ด":"จุ้งจาลิง",
"มะกล่ำตาหนู":"มะก่ำต๋าไก่",
"ประคำดีควาย":"บ่ะซั่ก",
"ไมยราบ":"หญ้าจิ๋ญอบ",
"ไม้รวก":"ไม้ฮวก",
"ไม้ไร่":"ไม้ไฮ่",
"ไม้เลียบ":"ผั่กเฮือด",
"รัง":"ไม้เปา",
"ละหุ่ง":"บ่ะหุ่ง",
"ลาน":"ลาน",
"สลอด":"บ่ะข่าง",
"สาบเสือ":"หญ้าแมงวาย",
"สีเสียด":"สีเสียด",
"หญ้าเจ้าชู้":"หญ้าก่อน",
"หญ้า":"หญ้า",
"หนาด":"หนาด",
"หมามุ่ย":"บ่ะเหนียง",
"หมากผู้":"หมากปู๊",
"หมาก":"หมาก",
"หางนกยูง":"ซอมพอ"};
const fishList = {
  "ปลากด": "ป๋าก๋ด",
  "ปลากระเบน": "ป๋าไม",
  "ปลากระดี่": "ป๋าสะลาก",
  "ปลากราย": "ป๋าต๋อง",
  "ปลากา": "ป๋าก๋า",
  "ปลาเข็ม": "ป๋าเข็ม",
  "ปลาแขยง": "ป๋าแก้ด",
  "ปลาช่อน": "ป๋าหลิม",
  "ปลาชะโด": "ป๋าชะโด",
  "ปลาดุก": "ป๋าดุ๋ก",
  "ปลาตะเพียน": "ป๋าขาว",
  "ปลาเทโพ": "ป๋าเต้าะ",
  "ปลาทู": "ป๋าทู",
  "ปลานิล": "ป๋านิล",
  "ปลาเนื้ออ่อน": "ป๋าหวาน",
  "ปลาบึก": "ป๋าบึ๋ก",
  "ปลาสลิด": "ป๋าสะลิ๋ด",
  "ปลาสร้อย": "ป๋าบอก",
  "ปลาสวาย": "ป๋าสวาย",
  "ปลาหมอ": "ป๋าสะเด๋ด",
  "ปลาหมึก": "ป๋าหมึ๋ก",
  "ปลาหมู": "ป๋าหมู",
  "ปลาหลด": "ป๋าล๋ด",
  "ปลาไหล": "ป๋าเหยี่ยน",
  "ตัวนาก": "บ้วน"
};

const birdsList = {
  "ไก่อู": "ไก่จง",
  "ไก่ต่อ": "ไกตั้ง",
  "ไก่ชน": "ไก่จน",
  "ไก่แจ้": "ไก่แจ้",
  "ค้างคาว": "ฮุ้งคาว",
  "นกกระจาบ": "น่กจาบ",
  "นกกระจิบ": "น่กจิ๋บ",
  "นกกระทา": "น่กกะทา",
  "นกกระทุง": "น่กตุ่งตุง",
  "นกกระปูด": "น่กก้นปู้ด",
  "นกกระเรียน": "น่กเขียน",
  "นกกระสา": "น่กคองู",
  "นกกวัก": "น่กกวั๋ก",
  "นกกระเต็น": "น่กกะเต็น",
  "นกกางเขน": "น่กจี๋แจ้บ",
  "นกกาเหว่า": "น่กก๋าเหว่า",
  "นกกินปลี": "น่กกิ๋นปี๋",
  "นกแก้ว": "น่กแล",
  "นกขมิ้น": "น่กเข้าหมิ้น",
  "นกขุนทอง": "น่กเอี้ยงคำ",
  "นกเขา": "น่กเขา",
  "นกแขวก": "น่กขวาก",
  "นกเค้าแมว": "น่กเก๊า",
  "นกเงือก": "น่กก๋ก",
  "นกถึดทือ": "น่กปู่ติ้ด",
  "นกนางแอ่น": "น่กแอ่น",
  "นกปรอด": "น่กปิ๋ดจะลิว",
  "นกพิราบ": "น่กก๋าแก๋",
  "นกโพระดก": "น่กป๋ก",
  "นกยาง": "น่กญาง",
  "นกยูง": "น่กญง",
  "นกแสก": "น่กเก๊าจ๊าง",
  "มดคันไฟ": "ม่ดแดงไฟ",
  "มดแดง": "ม่ดส้ม",
  "มวนลำไย": "มวนลำไญ",
  "มิ้ม": "มิ้น",
  "แมงกะชอน": "แมงจอน",
  "แมงคาเรือง": "แมงคา",
  "แมงป่องช้าง": "แมงเวา",
  "แมงป่อง": "แมป่อง",
  "แมงมุม": "ก๋ำปุ๊ง",
  "แมลงตด": "แมงขี้ต๋ด",
  "แมงปอ": "ก๋ำบี้",
  "แมลงทับ": "แมงตั้บ",
  "แมลงวัน": "แมงงน",
  "แมลงภู่": "แมงปู้",
  "แมลงสาบ": "แมงสาบ",
  "แมลงหวี่": "แมงหวี่",
  "ยุง": "ญุง",
  "เรือด": "เฮือด",
  "ริ้น": "ฮิ้น",
  "ไร": "ไฮ",
  "ลองไน": "แมงว้าง",
  "ลูกน้ำ": "แมงง้องแง้ง",
  "ไส้เดือน": "ไส้เดือน",
  "หนอนผีเสื้อ": "แมงบ้ง",
  "หมาร่า": "แมงใบ้",
  "หมัด": "หมั๋ด",
  "เห็บ": "เห็บ"
};

const landAnimalsList = {"กระจง":"ไก้","กระจ้อน":"ไหน่","กระทิง":"กะติง","กระรอก":"ฮอก",
"กวาง":"กว๋าง","เก้ง":"ฟาน","ค่าง":"ก้าง","ชะนี":"อี่ฮุย",
"ชะมด":"เห็นอ้ม","ช้าง":"จ๊าง","พังพอน":"ปังปอน",
"ละมั่ง":"ละโว้","ลิง":"วอก","แรด":"แฮด",};
const reptilesList = {"กบ":"ก๋บ","กิ้งก่า":"จั๊กก่า","คางคก":"คางคาก",
"งูจงอาง":"งูจ๋งละอาง","จระเข้":"จั๊กเข้",
"จิ้งจก":"จั๋กกิ้ม","จิ้งเหลน":"จั๋กกะเล้อ","ตะกวด":"แลน","ตะขาบ":"จั๋กเค๋บ","ตะเข็บ":"จั๋กเค๋บ",
"ตุ๊กแก":"ต๋กโต","แย้":"แญ้"};
const illnessList = {"กุ้งยิง":"ต๋าเป๋นต๋อน","ขี้แมลงวัน":"ขี้แมงงุน","ขี้เรื้อน":"ขี้เฮื้อน","คอพอก":"คอเอิม",
"คางทูม":"ฮ่าวอก","เจ็บไข้ได้ป่วย":"เป๋นผะญาด","ตาเข":"ต๋าเข",
"ตาส่อน":"ต๋าส่อน","ตาเหล่":"ต๋าเหล้","ตานขโมย":"ซาง","ท้องเสีย":"หลุ๋ต๊อง",
"ท้องอืด":"กิ๋ั๋ดต๊อง","ปวดขา":"เจ๋บขา","ปวดแขน":"เจ๋บแขน","ปวดตา":"เจ๋บต๋า",
"ปวดท้อง":"เจ๋บต๊อง","ปวดฟัน":"เจ๋บเขี้ยว","ปวดหลัง":"เจ๋บหลัง","ปวดหัว":"เจ๋บหัว",
"ปวดเอว":"เจ๋บแอว","เป็นไข้":"เป๋นไข้","เป็นลม":"เป๋นลม","แผลในปาก":"ขาง",
"พยาธิ":"ตัวตืด","พิษสุนัขบ้า":"ว้อ","แพ้ยา":"แป๊ยา","แพ้อาหาร":"กิ๋นผิด","แพ้อากาศ":"แป๊อากาศ",
"ฟันหลอ":"เขี้ยวเว่า","มะเร็ง":"บ่ะเฮ็ง","ริดสีดวง":"บะโหกก้นปู้ด","เรื้อน":"ขี้ตูด",
"โรคกระษัย":"มะโหก","ลมบ้าหมู":"ลมจั้ก","ลมพิษ":"หมึน","วัณโรค":"ฝีในต๊อง","เวียนหัว":"เมาหัว",
"ออกหัด":"ออกหั๋ด","อีสุกอีไส":"ตุ่มไส"};
const vehiclesList = {"กง":"ก๋ง","กำ":"ก๋ำ","เกวียน":"ล้องัว","คานหาม":"กานหาม","ซี่ล้อรถ":"สี้",
"โซ่":"โส้","แตร":"แก","แพ":"แป",
"เพลา":"เพา","ยางรถ":"ล้อ","รถเก๋ง":"ล่ดเก๋ง","รถจักรยาน":"ล่ดถีบ","รถมอเตอร์ไซค์":"ล่ดเคื่อง",
"รถดับเพลิง":"ล่ดเหวอ","รถตู้":"ล่ดตู้","รถบรรทุก":"ล่ดบันทุ่ก","รถไฟ":"ล่ดไฟ","รถม้า":"ล่ดม้า",
"รถยนต์":"ล่ดยนต์","รถสองแถว":"ล่ดสี่ล้อ","รถสามล้อ":"สามล้อถีบ","เรือ":"เฮือ","เรือสำเภา":"เฮือสะเปา",
};
const religionList = {"กรวยดอกไม้":"สวย","เข้าพรรษา":"เข้าพันสา","คัมภีร์":"กำปี","เครื่องไทยทาน":"คัวตาน","โคมลอย":"โกมลอย",
"งานฉลอง":"งานปอย","เจ้าอาวาส":"ตุ๊หลวง","ดอกไม้ไฟ":"บอกไฟ","เทศน์":"เต้ด","เทียน":"เตียด",
"ธงล้านนา":"ตุง","น้ำที่ใช้กรวดน้ำ":"น้ำหยาด","บวชเณร":"บวชลูกแก้ว",
"บวชพระ":"บวชเป้ก","ประตูป่า":"ปะตู๋ป่า","พระสงฆ์":"ตุ้เจ้า","พระผู้ใหญ่":"คูบา","พ่อซื้อแม่ซื้อ":"ป้อเกิดแม่เกิด",
"ระฆัง":"เด็ง","ลอยประทง":"ญี่เป็ง","วันขึ้น 15 ค่ำ":"วันเดือนเป็ง","วันเถลิงศก":"วันพะญาวัน","วันพระ":"วันศีล",
"วันมหาสงกรานต์":"วันสังขารล่อง","วันแรม 15 ค่ำ":"วันเดือนดั๋บ","วันสุกดิบ":"วันดา","สลากภัตร":"ก๋วยสลาก","สงกรานต์":"ปี๋ใหม่",
"สัปทน":"จ้องหลวง","ออกพรรษา":"ออกพันสา"};
const entertainmentList = {"กลองเพล":"ก๋องปู่จา","กลองยาว":"แอว","กลอง":"ก๋อง","ขลุ่ย":"ขุ่ย","ขายของ":"ขายคัว",
"ฆ้อง":"ก๊อง","ฉาบ":"สว่า","ฉิ่ง":"สิ่ง","ซ่อนหา":"ลั่บลี้","ตั้งเต":"บ้าต๋าแสง",
"ประทัด":"บ่ะถ๋บ","แตรปี่":"แน","แตรวง":"แกวง","เพลงพื้นบ้าน":"ซอ",
"ระนาด":"ละนาด","รำ":"ฟ้อน","ลูกข่าง":"บ่ะข่าง","เล่นชิงช้า":"สิ๋กจุ้งจา",
"หนังสติ๊ก":"ก๋ง"};
const professionsList = {"กำนัน":"ป้อแคว่น","ข้าราชการ":"ข้าลาดสะก๋าน","คนขับเพลงพื้นบ้าน":"จ้างซอ","คนใช้":"คนใจ๊","คนฟ้อนรำ":"จ้างฟ้อน",
"ครู":"คู","คหบดีผู้ชาย":"ป้อเลี้ยง","คหบดีผู้หญิง":"แม่เลี้ยง","ช่างไม้":"จ้างไม้","ช่างทอผ้า":"จ้างตอผ้า",
"ช่าง":"จ้าง","ตำรวจ":"ต๋ำหนวด","ทหาร":"ตะหาร","นักร้อง":"นักฮ้อง",
"ปลัด":"ปะลั๋ด","ผู้ชายที่หย่ากับภรรยา":"ป้อฮ้าง","ผู้ทำพิธีทางศาสนา":"อาจ๋าน","ผู้หญิงที่หย่ากับสามี":"แม่ฮ้าง","ผู้ใหญ่บ้าน":"ป้อหลวง",
"พยาบาล":"หมอ","พ่อค้า":"ป้อก๊า","พ่อหม้าย":"ป้อหม้าย","แม่ค้า":"แม่ก๊า",
"สัปเสร่อ":"สั่บปะเหล่อ","หมอดู":"หมอเมื่อ",
"อาจารย์":"อาจ๋าน","อุบาสก":"ป้อออก","อุบาสิกา":"แม่ออก"};
const classifiersList = {"กระบอก":"บอก","กลีบ":"กีบ","กอ":"ก๋อ","กอง":"ปุ้น","กำ":"ก๋ำ",
"ข้าง":"ขอน","ครั้ง":"เตื่อ","คัน":"กัน",
"คำ":"กำ","คู่":"กู้","เครือ":"เคือ","ช่อ":"จ้อ",
"ชิ้นเล็กๆ":"ติ่น","ชั้น":"จั๊น","ซี่":"สี้","ซึก":"โขบ",
"ตน":"ต๋น","ต้น":"เก๊า","ตับ":"ไพ",
"ถุง":"ถง","ท่อน":"ต้อน","ทะนาน":"ลิ่ตร","ทะลาย":"ปี๋",
"แปลง":"ปั้น","ฝัก":"ฝั๋ก","พวง":"ปุ้ก",
"พวก":"หมู่","พับ":"แหลบ","มวน":"เบ้า","มัด":"มั่ด",
"ยวง":"ญวง","รูป":"ต๋น","ลูก":"แก่น","เล่ม":"เหล้ม","เล่ม":"เถี่ยน",
"วง":"บ้วง","แว่น":"แหว้น",
};
const cookingVerbsList = {"กวน":"ก๋วน","ก่อไฟ":"ดังไฟ","แกะ":"แก๋ะ","แกง":"แก๋ง","ขอด":"เถ๋าะ",
"ขยำ":"ฟั้น","โขลก":"ต๋ำ","คน":"กน","คลุก":"คุ่ก",
"คั้น":"กั๊น","คั่ว":"ขั้ว",
"เฉาะ":"เบ๋าะ","ชำแหละ":"คัว","แช่":"แจ่","ซาวข้าว":"หวดเข้า",
"เด็ด":"ไซ้","ตัก":"ตั๋ก","ตำ":"ต๋ำ",
"เติม":"เตื่อม","ทำอาหาร":"ญ่ะกิ๋น","ทุบ":"ตุ้บ","เท":"ถอก",
"นึ่ง":"หนึ้ง","บด":"บ๋ด",
"ผัด":"ผั๋ด","ผ่า":"โบ๋ะ","ฝัด":"ฟั๋ด",
"พลิก":"ปิ้น","มัด":"มั่ด","โม่":"โหม้",
"ยก":"ญ่ก","ยัด":"ป๋ด","ย่าง":"ญั่ด","ยำ":"หย้าง","ยี":"ส้า",
"ร่อน":"ญี","รูด":"ฮ่อน","ลวก":"ฮูด","ลอก":"ลวก","เลาะ":"ลอก",
"แล่":"เล่าะ","สะเด็ด":"แล่","สุก":"สะเด๋ด","สับ":"สุ๋ก","เสียบ":"ลาบ",
"ห่อ":"เสียบ","หั่น":"ห่อ","หุง":"ก๋ก","หมก":"หุง","หมัก":"หม๋ก",
};
const eatingVerbsList = {"กลืน":"ลืน","กัด":"ข๋ม","กิน":"กิ๋น","เคี้ยว":"เกี๊ยว","งับ":"งั่บ",
"จิบ":"จิ๋บ","ฉัน":"สัน","ชิม":"จิม","ซด":"หีบ",
"ดื่ม":"กิ๋น","แทะ":"แหง้น","รับประทาน":"กิ๋น",};
const dressingVerbsList = {"เกล้าผม":"มัดผม","โกนผม":"โก๋นผม","เขียนคิ้ว":"เขียนกิ้ว","คาด":"เคียด","คาด":"ฮั่ด",
"ดัดผม":"ดั๋ดผม","ทำผม":"แป๋งผม","แปรงผม":"แปงผม",
"ย้อมผม":"ญ้อมผม","ยีผม":"ญีผม",
"ส่องกระจก":"แญงแว่น","สระผม":"สระหัว","สวมหมวก":"สุ๋บ","สวม":"ใส่",
"หวีผม":"หวีหัว"};
const speakingVerbsList = {"กรน":"ขน","กระซิบ":"ซุ่บซาบ","กรีดร้อง":"เอ๋ก","โกหก":"จุ๋",
"คราง":"คาง","คุย":"อู้","คู":"ฮ้อง","จู้จี้":"ญ่อย",
"ตะโกน":"เอิ้น","ตะคอก":"เอ๋ก","ติดอ่าง":"ปากกั้ก",
"ทะเลาะ":"ผิ๋ดกั๋น","นินทา":"เล่าขวัญ","บ่น":"จ่ม",
"ประกาศ":"ป่าว","พูด":"อู้",
"ร้องเรียก":"เอิ้น","ร้อง":"ฮ้อง","วาจาสิทธิ์":"ปากปิ้ด",
"หัวเราะเสียงดัง":"เหิด",};
const feelingVerbsList = {"กลัว":"กั๋ว","กล้า":"ก้า","โกรธ":"โขด","ขยะแขยง":"ขี้จ้ะ","คิดถึง":"กึ้ดเติงหา",
"เจ็บใจ":"เจ๋บใจ๋","เกลียด":"ชัง",
"ดีใจ":"ดีใจ๋","ดูถูก":"ดูแควน","ตกใจ":"ต๋กใจ๋","ตื้นตัน":"กั้ดอ๋ก","ทุกข์ใจ":"ตุ้กใจ๋",
"น้อยใจ":"น้อยใจ๋","เบื่อ":"ก้าย","เป็นห่วง":"เป๋นห่วง","ไม่สบายใจ":"บ่สบายใจ๋","โมโห":"โขด",
"ร้องไห้":"ไห้","ร้อนใจ":"ฮ้อนใจ๋","ระอาใจ":"เสี้ยงใจ๋","รัก":"ฮั่ก","รำคาญ":"ลำคาญ",
"ลำบากใจ":"กึ้ดญาก","กังวล":"ใจ๋บ่ดี","ว้าเหว่":"ง่อม","เศร้า":"เส้า","สบายใจ":"ม่วนใจ๋",
"เสียใจ":"เสียใจ๋","เสียดาย":"กิ๋นแหนง","หนักใจ":"กึ้ดญาก",
"หวง":"ขาง","หึง":"ขาง","เหงา":"ง่อม","อยาก":"ไค่ได้","อิจฉา":"ขอย",
"อึดอัด":"บ่ม่วนใจ๋"};
const healthVerbsList = {"กระตุก":"กะตุ๋ก","เกร็ง":"เก็ง","ขากะเผลก":"ขาห้าน","ค่อยยังชั่ว":"ญังแควน",
"คลอดลูก":"เกิดลูก","ง่วงนอน":"ไค่หลั๋บ","ใจสั่น":"ใจ๋บ่ดี","จุก":"กั้ดต๊อง","ชา":"หมึน",
"ชัก":"จั้ก","ตาลาย":"ต๋าลาย","แน่นท้อง":"กั้ดต๊อง","แน่นหน้าอก":"แหน้นหน้าอ๋ก",
"ปวดมวน":"กิ้ว","ปวด":"เจ็บ","เป็นลม":"เป๋นลม",
"มีท้อง":"มานลูก","รู้สึกตัว":"ฮู้คิง","ระบม":"ละบม",
"เรอ":"เอ๋อะ","ละเมอ":"กั้ง","เวียนหัว":"เมาหัว","สลบ":"สล๋บ",
"สะอึก":"สะอึ๋ก","สำลัก":"สะมั่ก","สร่าง":"ส่าง",
"หน้ากลัว":"หน้ามืด","หายใจ":"หายใจ๋",
"หิว":"อยาก","เหนื่อยอ่อน":"อิ๋ดอ่อน","เหนื่อย":"อิ๋ด","หมดสติ":"บ่ฮู้คิง","อยู่ไฟ":"อยู่เดือน"};
const cleaningVerbsList = {"เก็บผ้า":"ล้อนผ้า","เก็บ":"เก๋บ","ขยี้":"สูสี","ขัด":"ขั๋ด",
"คลุม":"คุม","จัด":"จั๋ด","เช็ด":"เจ้ด","ซัก":"ซั่ก",
"เท":"ถอก","ทิ้ง":"ขว้าง","ปัด":"ปั๋ด",
"ผึ่ง":"ตาก","ยก":"ญ่ก","รีด":"ลีด","รื้อ":"ลื้อ",
"เรียง":"เลียง","ล้าง":"ซ่วย",
};
const craftingVerbsList = {"กรอ":"กอ","กลึง":"เคี่ยน","แกะสลัก":"แก๋ะสลั๋ก","แกะ":"แก๋ะ",
"ขัดเงา":"ขั๋ดเงา","เจาะ":"เจ๋าะ","ชุบ":"จุ้บ","ตัด":"ตั๋ด",
"ถัก":"ถั๋ก","ทอ":"ตอ","ปะ":"ป๋ะ",
"ผูก":"มั้ด","ฟั่น":"ฝั้น",
"พับ":"พั่บ","มัด":"มั่ด","ย้อม":"ญ้อม","เย็บ":"ญิ๋บ","ร้อย":"ฮ้อย",
"เลาะ":"เล่าะ","วัด":"วั่ด","วาด":"แต้ม","สลัก":"สลั๋ก",
};
const fightingVerbsList = {"กด":"เต๋ก","กัด":"ข๋บ","กระทืบ":"ตี๋นตั้ง","กระแทก":"กะแทก","กวัก":"กวั๋ก",
"ขวิด":"ขวิ๋ด","เขกหัว":"วั่ดหัว","ฆ่า":"ข้า","เฆี่ยน":"เขี้ยน",
"งับ":"งั่บ","จิก":"จิ๋ก","ฉก":"ส๋ก","ฉุด":"ซุ๋ด",
"โฉบ":"ซูด","ชก":"จ้ก","ชน":"จน","ชี้":"จี๊",
"ดัน":"ญู้","ตบ":"ต๋บ","ต่อย":"จ้ก","ตี":"ตี๋",
"เตะ":"เต๋ะ","ทับ":"ทั่บ","ทุบ":"บุ๋บ","แทง":"แตง","ถอง":"ใส่ศอก",
"บิด":"บิ๋ด","โบย":"ตี๋",
"ปล้ำ":"ป้ำ","ผลัก":"ยู้","โผล่":"แมน","พุ่งเข้าใส่":"หล่อใส่",
"ย่ำ":"ยญ่ำ","รัด":"ฮั่ด",
"หยิก":"หยิ๋ก","เหยียบ":"ญ้ำ",};
const movingVerbsList = {"กระโจน":"โด๋น","กระชาก":"สะต้ก","กระดุกกระดิก":"กะดุ๋กกะดิ๋ก","กระเดาะ":"เด๋าะ",
"กระโดด":"กะโดด","กระตุก":"กะตุ๋ก","กระเถิบ":"ถ๋อดแถ๋ด","กระพริบตา":"พั่บต๋า","กวัก":"กวั๋ก",
"ไกว":"ไกว๋",
"ขยับ":"ข๋ด","ขยี้":"สี","ขย่ม":"ห่ม","เข็น":"ญู้",
"เขย่ง":"แหย่งแย๋ง","เขย่า":"สว่าย","โขยกเขยก":"ป๋อกกะแแด๋ก","คลาน":"กาน",
"คลอน":"คอน","คลึง":"กะลิ่ก","ควัก":"ควั่ด","คว้า":"เปี๋ย",
"งัด":"งั่ด","จม":"จ๋ม","จูง":"จู๋ง",
"ฉุด":"ดึง","โฉบ":"ซูด","เฉี่ยว":"ซวาด","ชะเง้อ":"เหง้ย","ชะโงก":"หยื้อหน้า",
"ชัก":"จั้ก","ดัน":"ญู้",
"เดินผ่าน":"เตียวก๋าย","เดิน":"เตียว","ตก":"ต๋ก",
"ตอม":"ต๋อม","ตะครุบ":"ญั่บ",
"ถัด":"แถ๋ด","ไถล":"ผะเลิด",
"ลื่น":"ผะเลิด","ปรี่เข้าหา":"งอมใส่","ปล่อย":"ป่อย","ปลิว":"ปิ๋ว",
"ปีน":"ขึ้น","ผลัก":"ญู้","ผุด":"ผุ๋ด","หยักหน้า":"กะง่อกหัว",
"พยุง":"เฟีย","พลิก":"ปิ้น","พัง":"ปัง","ตลิ่งพัง":"โหยด","พัด":"ปั้ด",
"พา":"ปา","พุ่ง":"ปุ้ง","ฝัด":"ฝั๋ด","ฟัด":"ฟั่ด","มุด":"มุ่ด",
"ย้าย":"ญ้าย","ยืนค้ำศีรษะ":"ยืนงำหัว",
"ร่วง":"หล่น","ลุก":"ลุ่ก",
"วก":"ว่ก",
"ว่าย":"หว้าย",
"สะบัด":"สะวั่ด","หกล้ม":"ต้าว","หรี่":"หลี่",
"หลุด":"หลุ๋ด","หา":"เซ่าะ","เหาะ":"เห๋าะ",
"หมุน":"ผั๋ดมน","แอ่น":"แง่น","เอื้อม":"หยื้อ"};
const educationVerbsList = {"คัด":"คั่ด","จด":"จ๋ด","จบ":"จ๋บ","จำ":"จ๋ำ",
"รู้":"ฮู้","เรียน":"เฮียน",};
const farmingVerbsList = {"กลบ":"หล๋บ","ขุดทำแปลง":"บ๋กแปง","ขุด":"ขุ๋ด",
"ชำ":"จำ","ตอน":"ต๋อน","ถอน":"หล๋ก",
"ถางหญ้า":"แส๋ะหญ้า","นวดข้าว":"นวดเข้า","ปลูก":"ปูก",
"พรวนดิน":"พวนดิน","เพาะ":"เป่าะ","ฟัก":"ฟั่ก","ฟันกิ่งไม้":"ปั้ดกิ่ง",
"รดน้ำ":"ห๋ดน้ำ","ลิด":"ลิ่ด",
"ให้อาหาร":"เกื๋อเข้า"};
const eyeVerbsList = {"กระพริบตา":"พั่บต๋า","ขยี้ตา":"สีตา","ขึงตา":"จงต๋า","ค้อน":"หลั๋บต๋าจัง",
"จ้องดู":"ส่องผ่อ","จ้องมอง":"เหง้อ","ชม้อย":"แลต๋า","ชายตามอง":"แลต๋า",
"ชำเลือง":"แล","ตั้งตาคอยดู":"แนผ่อ","ถลึงตา":"โมกต๋า","ทำตาปริบๆ":"พั่บต๋าหยิ๋บๆ",
"เพ่งดู":"แญงผ่อ","มองเห็น":"หันใส่","มองหา":"ส่องผ่อ","มอง":"ผ่อ",
"ลืมตา":"มืนต๋า","เล็ง":"เเน","ส่อง":"แญง","หรี่ตา":"หลี่ต๋า","หลบตา":"หล๋บต๋า",
"หลับตา":"หลั๋บต๋า","เห็น":"หัน","เหลือกตา":"เหลือกต๋า","เหลือบเห็น":"สั่ดต๋าหัน",
"แอบดู":"ผ๋กผ่อ"};
const pronounsList = {"กู":"ฮา","แก":"สู","เขา":"เปิ้น","ฉัน":"เฮา",
"ดิฉัน":"ข้าเจ้า","ท่าน":"ต่าน","เธอ":"ตั๋ว","พวกเรา":"หมู่เฮา",
"พี่สาว":"ปี้","พี่ชาย":"อ้าย","เรา":"เฮา"};
const nounsList = {"ใคร":"ไผ","ทำไม":"ยะใด","เหตุใด":"เป๋นใด",
"เท่าไหร่":"เต้าใด","บ้าง":"พ่อง","เพราะเหตุใด":"เพราะอะหยัง",
"หรือว่า":"ก่อว่า","ไหม":"ก่อ",
"อย่างไร":"จะใด","อะไร":"อะหญัง"};
const demonstrativesList = {"ทางนี้":"ตางเพ้","ทางโน้น":"ตางปู๊น","ที่นั่น":"ตี้หั้น",
"ที่นี่":"ตี้หนี้","เท่านั้น":"เต้าอั้น","เท่านี้":"เต้าอี้",
"นั่น":"หั้น","นี่":"หนี้",
"นี่ไง":"หนี้ลอ","โน่น":"ปู๊น","โน้น":"ปู๊น",
"อย่างนี้":"จะอี้","อย่างนั้น":"จะอั้น"};
const daytimeList = {"เช้า":"เจ๊า","ดึก":"ดึ๋ก","เที่ยง":"เตี้ยง",
"เย็น":"แลง","รุ่งสาง":"ใกล้เเจ้ง",
"สาย":"ขวาย","หัวค่ำ":"เมื่อค่ำ"};
const durationList = {"กลางคืน":"เมื่อคืน", "กลางวัน":"เมื่อวัน", "จนสว่าง":"เต๊าแจ้ง", "ชั่วโมง":"จั้วโมง",
"ช้า":"จ๊า", "เดิมที":"หัวตี", "เดี๋ยวเดียว":"กำเดียว", "เดี๋ยวนี้":"บ่ะเดี่ยวนี้", "ขณะนี้":"บ่ะเดี่ยวนี้",
"ตลอดคืน":"สุ๋ดคืน", "ตลอดวัน":"วันค่ำ", "ตอนนี้":"ต๋อนนี้", "แต่ก่อน":"ตะก่อน", "ทั้งวันทั้งคืน":"ตึงวันตึงคืน",
"ทุกวัน":"ตึงวัน",  "นาน":"เมิน",
"ประเดี๋ยว":"กำเดียว", "เดี๋ยว":"กำเดียว", "ปีก่อน":"ปี๋ก่อน", "ปีก่อนปีที่แล้ว":"ปี๋ซืน", "ปีที่แล้ว":"ปี๋แล้ว",
"ปีนี้":"ปี๋นี้", "ปีหน้า":"ปี๋หน้า", "เมื่อก่อน":"ตะก่อน", "เมื่อวานนี้":"ตะวานี้",
"ยาม":"ญาม", "เร็ว":"โวย", "ฤดูหนาว":"หน้าหนาว", "ฤดูร้อน":"หน้าฮ้อน",
"ฤดูฝน":"หน้าฝน", "ฤดู":"หน้า", "วันข้างขึ้น":"วันเดือนออก", "วันข้างแรม":"วันเดือนดั๋บ", 
"วันพรุ่งนี้":"วันพู้ก", "วันเพ็ญ":"วันเดือนเป็ง", "วันมะรืน":"วันฮือ", "วันมะเรื่อง":"วันซืน", 
 "สมัยเก่า":"สมัยบ่าเก่า", "สมัยก่อน":"สมัยตะก่อน", "สักครู่":"สั๋กกำ", "สักครั้ง":"สั๋กเตื้อ",
"สักหน":"สั๋กเตื้อ", "สักพักหนึ่ง":"สั๋กบึ๋ด", "สัปดาห์":"อาติ้ด"};
const quantitiesList = {"เกินไป":"ล้ำไป", "เกลี้ยง":"เกี้ยง",  "ค่อน":"ข้อน",
"ครึ่ง":"กึ่ง", "ครบ":"ค่บ", "คี่":"กี้", "คู่":"กู้", "เจ็ด":"เจ๋ด",
"เดี่ยว":"เดียว", "เต็ม":"เต๋ม", "ทั้งคู่":"ตึกกู้", "ทั้งหมด":"ตึงหม๋ด", "น้อย":"หน้อย",
"ปานกลาง":"มอกฮ้ายมอกดี", "ไม่ดีไม่เลวจนเกินไป":"มอกบ่ฮ้ายบ่ดี",  "พัน":"ปัน", "พร่อง":"บ๋ก",
"มาก":"นั่ก", "มากๆ":"นั่กๆ", "เยอะๆ":"หลายๆ", "มากมาย":"นั่กขนาด", "ยี่สิบ":"ซาว",
"ร้อย":"ล้อย",  "สิบ":"สิ๋บ",
 "แสน":"แสน", "หก":"ห๋ก", "หนึ่งร้อยหนึ่ง":"ล้อยเอ๋ด", "หนึ่งร้อย":"ล้อยนึ่ง",
"หนึ่งพันหนึ่ง":"ปันเอ๋ด", "หนึ่งพัน":"ปันหนึ่ง", "หนึ่ง":"นึ่ง", "หมด":"เสี้ยง", 
};
const flavorsList = {"เค็ม":"เก็ม", "จืด":"จ๋าง", "เซ็ง":"คาย",
"เปรี้ยว":"ส้ม", "เผ็ด":"เผ๋ด", "เฝื่อน":"ฮืน", "พอดี":"จั๋บปอดิ",
"กลมกล่อม":"ก๋ำปอ","อร่อย":"ลำ"};
const colorsList = {"ขาวสลับดำ":"โก้ง", 
"ชมพู":"จมปู", "ซีด":"เปิด",  "แดงเข้ม":"แดงก่ำ",  
"เทา":"หม่น", "น้ำเงิน":"แหล้", "น้ำตาล":"น้ำต๋าล", "เผือก":"ปอน", 
"ม่วงเข้ม":"ม่วงก่ำ",};
const scentsList = { "ฉุน":"ขิ๋ว", };
const featuresList = {"กรอบ":"ผ่อย", "กาง":"ก๋าง",  "เกลี้ยง":"เกี้ยง",
"ของแท้":"ของแต๊",  "เขยิน":"ซูน", "คด":"ก้ด",
"ค่อย":"ก้อย", "คล้าย":"ค้าย", "โค้ง":"โก๊ง", "เฉ":"จ๊าย", "เฉา":"ญม", "แฉะ":"แจ้ะ", "ชัน":"จัน",
"ชื่น":"จื้น", "ชุ่ม":"จุ้ม",  "ตรง":"ซื่อ",
"ตายนึ่ง":"ม้าน",  "ทู่":"มุ่ม", "เท่า":"เต้า",
 "บอบบาง":"แลบ", "บุบ":"เบบ",
"ปลอม":"ป๋อม", "แปลก":"แปก", "เปียก":"เปี๋ยะ", 
"แฟบ":"ญุ่บ",  "ย่น":"หญ้น", "ยับ":"ยั่บ",
"ร่วน":"ฮ่วน", "ร้าย":"ฮ้าย", "เรียบ":"เลียบ","ลึก":"ลึ่ก",
"แวววาว":"เหลื้อม", "สด":"ส๋ด", 
"แหลก":"เหลียก",  "เหลว":"แหลว", "หนัก":"หนั๋ก",  "อ้วน":"ตุ้ย",};
const sizesList = { "ขนาดนี้":"มอกอี้", "แค่นี้":"มอกอี้", "แคบ":"กีด",
"เตี้ย":"ป๋อก", "ปานกลาง":"มอกฮ้ายมอกดี", "พอดี":"มอกจั๋บ", "พอเหมาะ":"มอกปอดี", "ยาว":"ญาว",
"เล็ก":"หน้อย",};
const touchList = { "คาย":"กาย", "ระคาย":"กาย","ร้อน":"ฮ้อน", "ลื่น":"มื่น", "เละ":"สว่าน",
"สาก":"จา", "ทำ":"ย่ะ",
"ห้าม":"จะไป",
};
const endingsList = {"กระมัง":"ก๊า", "ครับ":"คั่บ", "คะ":"เจ้า", "ค่ะ":"เจ้า", "เฉยๆ":"บ่ดาย",
"ไง":"ลอ", "ไงล่ะ":"แหน่", "ซิ":"กะ", "สิ":"แป๋ะ", "เถอะ":"เต้อะ",
"เถิด":"เต้อะ", "เถอะนะ":"เต๊อะนา", "นะ":"เอาะ", "ด้วยนะ":"ตวย",
"นั่นแหละ":"น่ะก่า", "น่ะสิ":"น่ะก่า",  "นะ":"นา", 
"หนอ":"เนอ", "ละสิ":"ล่ะกะ", "ละนะ":"ล่ะหนา", "ละ":"ล่ะ", 
 "เลย":"แหละ", 
"อีกละ":"แหมเม่าะ", "วะ":"บ่า", "โว้ย":"บ่ะเฮ้ย", "เสียก่อน":"เฮี๋ยก่อน", 
"เสียที":"เฮี่ยกำ", "เสียสิ":"เฮี๋ยก่า", "เสียเลย":"เฮี้ยเลย", 
"เสียนี่":"สั๋กกำ", "แหละ":"น่ะ",};

function showCategory(category) {
  document.querySelectorAll('.category').forEach(el => {
    el.style.display = 'none';
  });

  // ซ่อนเนื้อหาอื่น ๆ
  ['languageText', 'languageText2', 'searchInput', 'soundButton', 'result']
    .forEach(id => {
      const el = document.getElementById(id);
      if (el) el.style.display = 'none';
    });

  document.querySelectorAll('.animated-image, .animated-button')
    .forEach(el => el.style.display = 'none');

  // ถ้าเลือกกลับบ้าน
  if (category === 'home') {
    location.reload();
    return;
  }

  // แสดงหัวข้อหมวด
  const header = document.getElementById(category);
  if (header) header.style.display = 'block';

  // 👉 แสดงรายการคำศัพท์
  const wordMap = {
  body: bodyList,
  family: familyList,
  plants: plantsList,
  objects: objectsList,
  clothing: clothingList,
  monkItems: monkItemsList,
  nature: natureList,
  buildings: buildingsList,
  fruits: fruitsList,
  food: foodList,
  vegetables: vegetablesList,

  flowers: flowersList,
  trees: treesList,
  fish: fishList,
  birds: birdsList,
  landAnimals: landAnimalsList,
  reptiles: reptilesList,
  illness: illnessList,
  vehicles: vehiclesList,
  religion: religionList,
  entertainment: entertainmentList,
  professions: professionsList,
  classifiers: classifiersList,
  cookingVerbs: cookingVerbsList,
  eatingVerbs: eatingVerbsList,
  dressingVerbs: dressingVerbsList,
  speakingVerbs: speakingVerbsList,
  feelingVerbs: feelingVerbsList,
  healthVerbs: healthVerbsList,
  cleaningVerbs: cleaningVerbsList,
  craftingVerbs: craftingVerbsList,
  fightingVerbs: fightingVerbsList,
  movingVerbs: movingVerbsList,
  educationVerbs: educationVerbsList,
  farmingVerbs: farmingVerbsList,
  eyeVerbs: eyeVerbsList,
  pronouns: pronounsList,
  nouns: nounsList,
  demonstratives: demonstrativesList,
  daytime: daytimeList,
  duration: durationList,
  quantities: quantitiesList,
  flavors: flavorsList,
  colors: colorsList,
  scents: scentsList,
  features: featuresList,
  sizes: sizesList,
  touch: touchList,
  endings: endingsList
};


  const wordData = wordMap[category];
  if (wordData) {
    const listContainer = document.getElementById(`${category}List`);
    if (listContainer) {
      listContainer.innerHTML = "";
      for (const [thai, northern] of Object.entries(wordData)) {
        const p = document.createElement("p");
        p.textContent = `${thai} : ${northern}`;
        listContainer.appendChild(p);
      }
    }
  }

  // เล่นเสียงคลิก
  const clickSound = document.getElementById("clickSound");
  if (clickSound) {
    clickSound.currentTime = 0;
    clickSound.play().catch(e => console.warn(e));
  }

  // ปิด sidebar
  const sidebar = document.getElementById("sidebar");
  if (sidebar) sidebar.classList.remove('active');
}
